{
  "place_slug": "88-club",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "88 Club - Review - Beverly Hills - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/88-club",
      "published_at": "2025-05-22",
      "trust_level": "editorial",
      "content": "88 Club is a swanky Chinese spot where a fun Beverly Hills dinner gets remixed with Chinese food nostalgia. If you threw La Dolce Vita and P.F. Chang's into a blender you'd end up with 88 Club, a swanky Chinese spot from the former Nightshade chef. With a low-lit clubby aura, thumping Michael Jackson and Big Pun playlist, and glammed-up prawn toast the size of corn dogs, the place has all the ingredients for a fun Beverly Hills dinner, remixed with Chinese food nostalgia. The crispy sweet and sour fish sauced tableside and glistening char siu with hot mustard should be your priorities—both spendy but shareable. Get the milk tea custard buns to end the night, or the cheeky Long Island Iced Tea with baijiu and bergamot to keep it going."
    },
    {
      "source_id": "src_resy_2025",
      "publication": "Resy",
      "title": "88 Club Is Your New Destination Restaurant in Beverly Hills",
      "url": "https://blog.resy.com/2025/04/88-club/",
      "published_at": "2025-04-15",
      "trust_level": "editorial",
      "content": "Top Chef champion Mei Lin and restaurateur Francis Miranda have been creating magic together in Los Angeles for several years now, from opening their lauded pan-Asian hotspot Nightshade to launching the wildly popular Szechuan hot chicken joint Daybird. Their newest collaboration, 88 Club, makes a splashy entrance in Beverly Hills: an upscale Chinese restaurant that reimagines nostalgic family-style dishes with a modern touch. Kung pao scallops and caviar-topped sesame prawn toast, anyone? It had been a longtime dream for Miranda, who also owns Trophies Burger Club, to open a Chinese restaurant — and it made sense for him to tap Lin as its chef. Lin wanted to recreate the classic cocktail after a night searching for the drink with chefs Lucas Sin (host of the Bon Appétit show Street Eats) and Eric Sze (owner of New York's 886 and Wenwen restaurants) years ago. \"Long Island Iced Teas get a really bad rap for a lot of different reasons, but I wanted to put the flavors of Hong Kong lemon iced tea in it,\" says Lin. As for wines, 88 Club's general manager and sommelier Diana Lee (Gwen, Intercrew) curated the European-leaning program that highlights small and sustainable producers. One of the most notable wines complements to Lin's dishes is the Stein \"Weihwasser\" Feinherb Riesling from Rheinhessen, Germany. \"When people think about Rieslings they think, 'Oh, it's a sweet wine,' but its aromatic qualities pair really well with Asian cuisine, especially Chinese and Thai food,\" says Lin. Miranda teamed up with the Los Angeles design firm Preen Inc. to bring his vision for 88 Club — a melding of vintage Chinese and elegant contemporary vibes — to life. Upstairs in the mezzanine, there's a 10-seat private table that overlooks a 2,200-square-foot floor that is separated into two spaces: a dining area referred to as the \"Jade Room\" and a five-seat bar dubbed the \"Rose Room.\" The facade of the cocktail bar is lined in stunning Rosso marble in shades of burgundy and rose. Plush pink chairs are decorated with Chinese patterns like the round symbol of longevity. The wall is adorned with Chinese artist Wu Yue's experimental artwork utilizing bleach on canvas. In the 44-seat dining room, where the walls are lacquered in a light jade color (a nod to the stone's symbol of auspiciousness), black oak wood tables are surrounded by black leather banquettes and dark green leather chairs. Miranda searched far and wide at flea markets to create this collection for the restaurant. He also rounded up vintage jade artwork and a Chinese painting of a man riding a horse, among other personal details placed throughout the space. \"I love the old school vintage pieces that we have on the wall that really scream chinoiserie,\" says Lin. With the vintage items bridging the past with the present, Miranda sees 88 Club as the next chapter of Chinese food in Beverly Hills, which is already home to the renowned 51-year-old Mr. Chow, just a few blocks away. \"The man is a legend,\" Miranda says of the eponymous owner. \"We take our hats off to him. We just want 88 Club to give people another option; to feel like a younger breath of fresh air.\" Lin, who was born in China, grew up in Dearborn, Michigan working at her family's Chinese restaurant long before she cooked in the acclaimed kitchens of Wolfgang Puck's Spago and Michael Voltaggio's ink. \"The food at 88 Club is a nod to my upbringing,\" says Lin. \"Creating this menu really meant bringing comfort to the plate.\" In some ways, Miranda sees 88 Club as an outgrowth of Nightshade, which closed due to the pandemic. \"I think I'll finally get to give myself and the team the best shot at creating an institution,\" he says. \"Nightshade had all the makings for one — all the accolades and attention — but it was so short-lived. I always think about what could have been,\" he says. Perhaps the name 88 Club, which refers to the number that symbolizes prosperity in Chinese culture, is a harbinger of good things to come for the restaurant."
    },
    {
      "source_id": "src_finedininglovers_2025",
      "publication": "Fine Dining Lovers",
      "title": "88 Club | Fine Dining Lovers",
      "url": "https://www.finedininglovers.com/restaurants/88-club",
      "published_at": "2025-04-15",
      "trust_level": "editorial",
      "content": "Mei Lin's Beverly Hills restaurant, 88 Club, offers a refined 44-seat dining room where guests can experience Chinese banquet-style dishes elevated with modern technique and precision. The stakes were high for Mei Lin's return to fine dining after the closure of her acclaimed Nightshade in Downtown LA's Arts District in 2020. But with 88 Club, she brings a new kind of allure to Beverly Hills—nestled along a culinary corridor of Santa Monica Boulevard that includes The Cheese Store of Beverly Hills and La Dolce Vita. The 44-seat space is moody and intimate, with deep green walls, dim lighting, and a five-seat cocktail bar that sets the tone for the evening. The bar program—led by General Manager Diana Lee (Gwen, Intercrew) and Kevin Nguyen (Death & Co, Camelia)—blends inventive flavors with classic technique. A standout Whiskey Sour combines hibiscus aperitif, Ceylon tea, and orange blossom with bourbon and lemon. 88 Club pairs exclusivity with warmth. The design and service convey polish, but the soul of the restaurant lies in its menu: nostalgic, family-style dishes reimagined through a fine-dining lens. Larger tables feature lazy Susans, a nod to traditional Chinese banquet dining. Cold starters set a vibrant tone: mung bean jelly noodles arrive in a pool of aged black vinegar and chili oil, topped with chopped nuts; thick-cut hiramasa crudo comes dressed in XO sauce with garlic chives and bright yellow oil. Sesame prawn toast is served in neat rectangles, dolloped with red sweet-and-sour sauce and yellow hot mustard aioli. Wontons filled with prawn and bamboo shoot swim in a delicate chicken stock enriched with ginger oil. Main dishes come in generous portions meant to be shared. The Nam Yu Roasted Chicken, served with ginger-scallion oil and aromatic soy sauce, is a personal homage—part Hainan chicken, part tribute to the wings her father cooked for her growing up."
    },
    {
      "source_id": "src_wallpaper_2025",
      "publication": "Wallpaper*",
      "title": "Beverly Hills' latest hot ticket is Chinese restaurant 88 Club",
      "url": "https://www.wallpaper.com/travel/restaurants/88-club-los-angeles-review",
      "published_at": "2025-05-24",
      "trust_level": "editorial",
      "content": "Chef Mei Lin's 88 Club pays tribute to the prosperity, success, and good fortune symbolized by the number 8 in Chinese culture. The venue has been designed by Los Angeles-based firm Preen, which has an office in Chinatown and has worked on many local favourite restaurants, from Pine & Crane to Akasha. For this project, the designers wanted the space to look and feel like a private club, or that you just stumbled upon a secret – and they nailed the concept. The dimly lit, intimate space is a mix of leather and dark woods, with lighter moments from the pink stone bar top and scalloped chairs to the retro-futuristic bar lamps, and round booths that also add a touch of glamorous Hollywood 'golden era' nostalgia. The team wanted a subtle nod to Lin's Chinese menu, hence the black lacquered dining room panels and wall sconces. 88 Club's menu is very personal for chef Lin as it is rooted in the Chinese flavours she grew up cooking with her parents, all while focusing on elevated comfort favourites and a modern take on time-honoured Chinese cuisine."
    },
    {
      "source_id": "src_herebeverlyhills_2025",
      "publication": "Here Beverly Hills",
      "title": "Beverly Hills Restaurant: Chef Mei Lin's 88 Club Opens",
      "url": "https://www.herebeverlyhills.com/2025/04/05/beverly-hills-restaurant-88-club/",
      "published_at": "2025-04-05",
      "trust_level": "editorial",
      "content": "Discover Beverly Hills restaurant 88 Club by Chef Mei Lin featuring innovative Chinese dishes. Reserve your spot for a unique dining experience! 88 Club will showcase a carefully curated menu featuring a delightful array of Chinese dishes that are both nostalgic and innovative. Expect to tantalize your taste buds with mouthwatering items like nam yu roasted chicken, scrumptious prawn and bamboo shoot wontons, and the classic sweet and sour squirrel fish. Each dish is designed to celebrate Chef Lin's rich cultural background and culinary journey. Chef Mei Lin, a multi-award-winning culinary talent, is no stranger to the food scene. Having successfully opened the popular Nightshade in Los Angeles, this new venture signifies her exciting return to fine dining after the restaurant sadly shut its doors in 2020 amid the pandemic. Nightshade was cherished for its unique twist on modern Asian cuisine and had racked up various accolades, including the prestigious 2019 Eater Award for Restaurant of the Year as well as being a finalist for the James Beard Foundation Best New Restaurant. Now, with the opening of 88 Club, Lin is partnering up once again with chef Francis Miranda, who has a wealth of experience from various restaurant kitchens including Nightshade. The duo aims to bring a fresh take on classic Chinese culinary delights while ensuring the flavors are straightforward and comforting. Unlike traditional Chinese cuisine, the menu at 88 Club steers clear of strict regional boundaries. Instead, it embraces a myriad of influences from Lin's own experiences in places like Hong Kong and Vancouver. Expect signature dishes like a reimagined sesame prawn toast and a modern twist on her father's beloved nam yu chicken wings. Don't worry, vegetarians! The menu also features options such as Singaporean chow mein to cater to various palates in the diverse Los Angeles dining scene. Step inside 88 Club and you'll find yourself enveloped in an elegant, Art Deco style interior designed by Alexis Readinger, featuring green hues and chic brass accents. 88 Club will be located at 9737 S. Santa Monica Boulevard, Beverly Hills, CA 90210, and will be open from Tuesday to Thursday, 5:30 p.m. to 10:30 p.m., and until 11 p.m. on Friday and Saturday. The restaurant will be closed on Sundays and Mondays, giving their team a chance to recharge. Reservations are available through Resy, and with a menu that promises to be both comforting and innovative, you'll want to secure your spot as soon as possible!"
    }
  ]
}