{
  "place_slug": "ace-hotel-downtown-los-angeles",
  "sources": [
    {
      "source_id": "src_timeout_2024",
      "publication": "Time Out LA",
      "title": "Downtown L.A.'s decade-old Ace Hotel is closing down in January",
      "url": "https://www.timeout.com/los-angeles/news/downtown-l-a-s-decade-old-ace-hotel-is-closing-down-in-january-121323",
      "published_at": "2023-12-14",
      "trust_level": "editorial",
      "content": "It anchored part of Downtown L.A.'s upswing, operated one of the area's first rooftop bars and became a cultural destination, but at the end of January, DTLA's Ace Hotel will be no more. Ace Hotel announced that its L.A. location \"will cease operations soon\" after a decade in business on Broadway. The one bit of good news is that the attached theater—the former United Artists Theatre, a nearly century-old, Gothic-flourished movie palace that was restored when the hotel opened in 2014—will continue to operate under new management. Though the hotel, restaurant and bar will shutter, the theater will continue to host shows under new management. If you've been following or frequenting the hotel and its neighboring retail and restaurant scene for the past decade, this probably feels like the end of an era—and maybe even yet another foreboding sign of the area's seemingly halted momentum since the pandemic. This is a district where, only a few years ago, there was talk of building a streetcar and the term \"Manhattanization\" was routinely being tossed about. Now, even though about a half-dozen hotels with similar vibes have since moved into the neighborhood, that spark of excitement that once buzzed about Broadway seems to have faded—though hopefully not permanently. The hotel itself was a fixture in a number of our travel features, and its programming was unparalleled for a while: The Halloween and New Year's Eve parties were epic, it was a hangout hub for fests like RIOT LA and it hosted everything from a climate change forum to a Nick Cave art show."
    },
    {
      "source_id": "src_timeout_2017",
      "publication": "Time Out LA",
      "title": "Ace Hotel Downtown Los Angeles | Hotels in Downtown Historic Core, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/hotels/ace-hotel-downtown-los-angeles",
      "published_at": "2017-11-13",
      "trust_level": "editorial",
      "content": "Night owls, artists, and musicians are the target at the Ace Hotel, which counts two bars, a New American restaurant and a lobby coffee kiosk as its public offerings. Time Out tip: Given the hotel's rock 'n roll propensities, it makes a good base for party animals who like to do their carousing in one spot, preferably with room service just a phone call away. If you and your friends like the idea of an all-night rager minus the clean-up, ask to upgrade to one of the hotel's lofts (typically only $150 more than a regular room), which add conveniences like a kitchenette and leather upholstered seating, for your guests' comfort. Don't underestimate the colorful history of this humming hipster hang: what was once the tallest building in L.A. (albeit just for a year) in 1927 also contains the crown jewel of LA's emerging Broadway Theatre District: the United Artists theater, a 1,600-seat Spanish-Gothic Revival masterpiece adjacent to the lobby of the Ace Hotel. It's a true artist's loft, with extra space to sprawl out on the floor with a guitar (many rooms have acoustic Martin guitars hanging on the wall) or practice some in-room yoga. The intentionally bare rooms can be a nice respite after a rousing evening up on the hotel's rooftop, a popular hang for zippy cocktails, DJ parties, and twinkling views of the DTLA skyline. Location: Mid-block on South Broadway, the Ace Hotel makes it easy to tackle the many hidden gems of Downtown L.A., from speakeasy-style cocktail dens to modish restaurants that have become stars in their own right on Instagram."
    },
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Upstairs at Ace Hotel - Review - Downtown LA",
      "url": "https://www.infatuation.com/los-angeles/reviews/upstairs-rooftop-lounge-at-ace-hotel",
      "published_at": "2023-06-21",
      "trust_level": "editorial",
      "content": "As downtown continues to fill scary, vacant parking lots with new high rises, its rooftop bar situation is only getting stronger. But one of our favorites continues to be Ace Hotel's Upstairs. The industrial rooftop has fantastic downtown views, great cocktails, and plenty of private areas for birthday parties, office parties, and I-don't-need-an-excuse parties."
    },
    {
      "source_id": "src_laist_2023",
      "publication": "LAist",
      "title": "The Ace Hotel Is Leaving A Storied Downtown Spot. Here's Its Colorful History",
      "url": "https://laist.com/news/la-history/los-angeles-ace-hotel-closing-downtown-history-united-artists-theater-jesus-saves-sign",
      "published_at": "2023-12-28",
      "trust_level": "editorial",
      "content": "The Ace Hotel in downtown Los Angeles is closing at the end of January, and with that the most recent chapter in the Spanish Gothic building's storied past. When the Ace Hotel arrived in 2014, the operators were interested in \"reactivating\" the theater as a focal point for culture in downtown. Since its stewardship, the Theater at Ace Hotel has held numerous big shows, including ones with the Sundance Institute and Cinespia. It's hosted live reads and screenings like the Mad Men series finale. The location at 929 South Broadway has gone through many transformations, including an office conversion, an arts theater and a church. Downtown has largely been quiet since the pandemic as nearby offices go unused, so the departure of the Ace Hotel may not surprise some."
    }
  ]
}