{
  "place_slug": "alba-los-angeles",
  "sources": [
    {
      "source_id": "src_lamag_2025",
      "publication": "LA Magazine",
      "title": "Inside Alba, the Debut L.A. Restaurant From New York's Prince Street Hospitality",
      "url": "https://lamag.com/food/inside-new-italian-restaurant-alba-from-prince-street-hospitality/",
      "published_at": "2025-02-06",
      "trust_level": "editorial",
      "content": "It was a parking lot.\" · Fortunately for us Angelenos, 8451 Melrose Ave. is a parking lot no more and now houses the sibling to Cucina Alba in New York — a celebrity-studded Italian hot spot on West 18th Street and 10th Avenue that built a cult following for giving patrons exactly what they crave: decadent, comforting yet elevated dishes like freshly baked focaccia with creamy whipped ricotta and an agnolotti with black truffle that's so addictive, you'll want to order it every time.\n\nChef Adam Leonti calls it \"vacation Italian,\" as in, the food you want on holiday. The Italian culinary pioneer — renowned for his run at Vetri in Philadelphia and for founding Brooklyn Bread Lab in Bushwick — takes his bread very seriously, and it shows.\n\nAlba's Accanto salad with avocado and cashew makes an appearance alongside a kale persimmon with kumquats. Heartier starters include the hit eggplant parmigiana and a shrimp trapanese with spot prawns and marcona almonds. You can't go wrong with anything from the \"garden section\" (squash blossoms with lemon mousse, grilled zucchini and white beans) but the Roman artichokes with mustard bagna cauda proved warranted — and they were another favorite dish.\n\nPasta options are all crowd-pleasers, and while you wouldn't skip the agnolotti, other options that may switch up with ingredients include a rigatoni with pesto, paccheri cacio e pepe, the signature lasagna and orecchiette arrabbiata topped with burrata snipped up tableside. The Chicken all Diavola with a unique spicy bomba sauce is another staple, or the Branzino topped with a yellow pepper crema sauce.\n\nUpon arrival, you'll be greeted by a car with the Alba logo (a yellow complement to the orange one in New York). Then, waltz down a runway-like walkway into a magnificent main dining room reminiscent of an Italian garden with high ceilings, elegant drapes, lush greenery, dim lighting, stone floors, a buzzing bar and a colorful mural from artist Alex Proba. The wall-length piece peeking through arches references traditional Italian frescos and features modern shapes and pops of colors including red, the color of Sicily (and Alba).\n\nThere's also an additional neutral-toned dining room further back and upstairs, a plush VIP room with a bar that will certainly play host to the group's starry clientele. But unlike other trendy and stylish spots, you'll want to come here for the food as much as the scene."
    },
    {
      "source_id": "src_lamag_2025b",
      "publication": "LA Magazine",
      "title": "How Alba Los Angeles Turned a Parking Lot Into WeHo's Trendiest New Restaurant",
      "url": "https://lamag.com/food/alba-los-angeles-chef-adam-leonti-cobi-levy-prince-street-hospitality-l/",
      "published_at": "2025-02-06",
      "trust_level": "editorial",
      "content": "Since opening Alba Los Angeles on Melrose Avenue Feb. 6, guests have been coming up to co-owner Cobi Levy and thanking him, noting, \"We really needed it.\" Which is perhaps a bit surprising, given the wealth of Italian restaurants in L.A. (and New York, for that matter — where he and Prince Street Hospitality partner Will Makris debuted their original Cucina Alba on West 18th Street in the summer of 2022).\n\n\"If you consider that dining is entertainment, then we sit in this perfect place,\" Levy explains. \"The restaurant is vibey and pretty and it's truly an experience — and it also has excellent food and service. There are a lot of places that have fantastic food, but maybe no vibe. And there's plenty of places that have a lot of vibe and the food's not that great. We pride ourselves on finding that perfect spot in between.\"\n\nThey had some practice refining their formula, with New York City restaurants Little Prince, a Parisian bistro that opened in 2013, and Lola Taverna — a Greek eatery. After doing a few projects, like Lucali, in Miami, Prince Street Hospitality looked to expand to Los Angeles.\n\nThey were looking for venues in L.A. — \"we were considering maybe doing Lola,\" Levy notes — when Catch Hospitality Group co-founder Mark Birnbaum alerted them to a spot right behind Catch Steak, which hadn't even opened yet, on Melrose and La Cienega. \"He's like, 'You've got to look at the space,'\" Levy recalls. \"And so, we did, and I saw this room — it was nothing, truly nothing. But I saw potential. I looked at what was a parking lot, and I saw an Italian garden.\"\n\nThe vision for the 10,000-square-foot, indoor-outdoor Alba began to take shape. \"This is a town built for outdoor dining,\" says Levy, who'd been experimenting with retractable roofs at Jibs in New York. \"I love dining outside. There's just something truly European about it, and it's something that I love — even in New York. Whenever I can get outside and eat, I'm in.\n\nSo I saw this space, and I thought, 'This is it. I can build something incredible here.'\"\n\nThe main dining room designed by GRT Architects features a similar color palette and materials as New York — from the white oak paneling to ivory leather and Cesca chairs. \"We work with Artemest, who does incredible sourcing Italian artisans for us,\" says Levy. \"We wanted to carry some of the art that we have in New York. And that really left me this outdoor patio, the garden space, to make something truly spectacular.\"\n\nWhat diners will enjoy at Alba Los Angeles are the brand's tried-and-true dishes. \"There are some parts of the diet here that are a little different than New York — people eat a little healthier,\" Levy says. \"And our menus work like that: you can eat largely very light and flavorful. And if you want to indulge, you can. That's true in New York, just as much as it is here in L.A. From a what's-in-season, that's more interesting: we can put things out on a plate right now that are not in season in New York. There's incredible seafood here on the West Coast. And because we are very market-driven, the menu here changes a bit.\"\n\nLeonti frequents the Melrose Place Farmers Market for produce, and the team is constantly experimenting with new dishes. \"We have a great persimmon salad I absolutely adore — with castelfranco and beautiful lettuces,\" Levy says.\n\nNext, Alba will be unveiling a private dining room featuring décor that's \"a little darker, a little more '70s, Milan-style: a bit glossy, and the palettes are dark reds and browns,\" Levy says. \"It really is very chic, and you have the private bar there too. It's got a sexier, swanky look.\" And later this year, they'll be opening a private garden on the roof. \"Roof bars are typically very cheesy,\" Levy decrees. \"So rather than build a roof bar, I built a garden that we can do very special, bespoke dinners on. Rather than trying to maximize every dollar, I've looked at it as, 'What would be the most beautiful dining room outside on a roof that I could build?'\" While Levy — who's \"mostly here for now\" — will be back and forth to New York, he and Makris added L.A. native Julian Black (Carbone, The Grill) to the team."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "The crowd-pleasing food at Alba is good, the wild scene is better",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/alba-los-angeles",
      "published_at": "2025-05-01",
      "trust_level": "editorial",
      "content": "The back patio at Alba gives off the same energy as Caesar's Palace—the one in Vegas, not Rome. Espresso martinis are on every table, big bowls of orecchiette with burrata are tossed tableside, and there'll be at least a few dudes with one too many shirt buttons undone.\n\nAt a recent meal, somebody at the table next to us shouted that they knew the person who had the keys to the Vatican. Whatever that means. It's a wild scene even by Weho standards, and while the food at Alba is mostly fine, sometimes good, its most important feature is that it doesn't distract from the negroni circus unfolding around you.\n\nDuring one visit, we saw a lady a few lambruscos deep wrap focaccia into her napkin and stuff it into a Birkin handbag. We weren't as keen on the bread as she was apparently, but there's enough good stuff on the menu at Alba to ensure everyone leaves happy.\n\nLike a greased-up American Gladiator, Alba's cocktails are both strong and smooth. Big news for the person who's getting an unsolicited text from you later tonight because you didn't realize a negroni could sneak in that much gin.\n\nThis dish might be fun to say out loud, but it's a mediocre bread plate. The focaccia is dense and a bit flat, and the whipped ricotta on the side doesn't add much. You can skip this one—unless you want something to mop up sauces from the entrees.\n\nArriving at the table looking like a miniature Mount Etna diorama, this dish is essentially four giant molten mozzarella cubes wrapped in semolina dough and crisped up in brown butter.\n\nThough the shrimp are a bit on the puny side, this dish is saved by a rust-colored almond pesto covering the plate that tastes like a nutty vodka sauce with a texture.\n\nAt most restaurants, getting the chicken is a sign you didn't see anything else that looked interesting. At Alba, it's the must-order. The crispy-skinned cutlets are tender and juicy and the Halloween-orange bomba sauce has an intense fiery-sweetness. Another prime moment for clean-up focaccia here.\n\nThe pastas tend to be the best bets, including that tableside orecchiette and truffle-y agnolotti stuffed with caramelized onions—a hit dish from the original NYC location."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Alba",
      "url": "https://www.timeout.com/los-angeles/restaurants/alba",
      "published_at": "2025-03-01",
      "trust_level": "editorial",
      "content": "This see-and-be-seen NYC Italian transplant serves salads, crudos, pastas and mains from a dreamy, vacation-inspired space along Melrose Avenue. Despite its snoozeworthy dining genre, Alba keeps it fresh with a tightly curated, ever-changing menu and a dimly lit, art-filled pastel pink hued dining room that feels straight out of a Wes Anderson film.\n\nTransplanted head chef Adam Leonti revels in the superior quality of L.A.'s fresh produce with standout starters like the accanto salad (cashews, avocado, lettuce) and a pistachio-topped tuna tartare. Throw in the well-executed cocktails and impossibly chic clientele, and you've got another crowdpleasing West Hollywood hot spot perfect for those occasions where the ambience and scene matter just as much as the food."
    },
    {
      "source_id": "src_hollywoodreporter_2025",
      "publication": "The Hollywood Reporter",
      "title": "Signature N.Y.C. Restaurants Have A Mixed Record in L.A. Can Alba Beat the Odds?",
      "url": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/alba-los-angeles-new-york-city-eatery-1236155394/",
      "published_at": "2025-03-07",
      "trust_level": "editorial",
      "content": "Alba specializes in what business partner Cobi Levy terms \"holiday Italian.\" This is a cuisine and decor that's unconcerned with the strictures of geography or authenticity.\n\nOne of the other partners, Carbone alum Julian Black, explains that \"we're trying to capture that idea of sprezzatura,\" the Italian concept of unfussy elegance. \"It's reflective in everything we're doing here — from how the servers are dressed to the way the wine program operates.\" Adds the son of The Equalizer producer Todd Black — alluding to the rough go of it this town has had of late, with wildfires, strikes and streaming contractions — \"this is a movie town. Just as people go to the movies to escape, we want them to come to Alba and know the feeling of escape, if only for a two-hour meal.\""
    }
  ]
}