{
  "place_slug": "alta-adams",
  "sources": [
    {
      "source_id": "src_infatuation_2023",
      "publication": "The Infatuation",
      "title": "Alta Adams - Review - West Adams - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/alta-adams",
      "published_at": "2023-02-23",
      "trust_level": "editorial",
      "content": "If you're looking for all the charm and hospitality of a casual dinner in the South, but don't particularly feel like leaving the Pacific Time Zone, head to Alta Adams. Their versions of Southern classics are great–specifically, the black-eyed pea fritters and the shrimp and grits–and the staff is very friendly and attentive. There's moist, crunchy fried chicken served with homemade hot sauce and vanilla-coated candied yams topped with a handful of chopped pecans. They've also got a solid list of vegan options, including smoked tofu gumbo and BBQ cauliflower in a miso pureé. We also highly recommend booking a table on their warmly lit patio and taking advantage of the excellent list of cocktails. They're the right balance of sweet and refreshing, not to mention strong enough to make you forget about that white hair you found on your head this morning. And if you're planning a special date night, there's a $30 wine flight that's fun to share. Anyone interested in learning more about women & BIPOC winemakers should also check out Adams Wine Shop right next door, run by the same people. Not starting your meal at Alta with these fritters is like skipping the opening bank robbery scene in The Dark Knight - it might not seem absolutely essential, but you missed out on something really good. The three best sides are the collard greens, an excellent carrot salad with spicy peppers, peanuts, and mint, and the mac and cheese, which could've been served a little warmer, but still goes well with everything. This fried chicken is perfectly crispy, super moist, and comes with a very good hot sauce on the side. In other words, it's really, really great fried chicken. The fish on the menu changes seasonally, and the two we've had are both great."
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Alta Adams – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/alta-adams",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "This is the kind of homey and comforting spot that anyone would be glad to have in their neighborhood, but would just as happily drive to find. Generous portions make it a favorite for family-style and group dining. The lovely back patio is draped with string lights and vines, fashioning a perfect backdrop for evenings alfresco. The cooking is soulful and comforting, starting with a plate of golden-fried black-eyed pea fritters with a garlicky green herb sauce for dipping. Their fried chicken is decadent, served juicy with a wickedly spicy hot sauce and caramelized sweet potatoes."
    },
    {
      "source_id": "src_timeout_la_2019",
      "publication": "Time Out LA",
      "title": "Alta Adams | Restaurants in West Adams, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/alta-adams",
      "published_at": "2019-03-14",
      "trust_level": "editorial",
      "content": "This joint venture from Watts native Keith Corbin—an alumnus of Roy Choi's original Locol—and San Francisco's Michelin-recognized Daniel Patterson has grown into a beloved staple of both West Adams and the greater L.A. Black community, as well as a see-and-be-seen hangout for Black Hollywood. Featuring a menu that Corbin broadly defines as \"California soul\" and a wine shop next door, Alta Adams is one of L.A.'s only soul food eateries to offer an upscale sit-down experience. On my visits, I've enjoyed the cornbread with honey butter, black eyed pea fritters, and fried catfish with spicy tartar sauce. The mains, however, are somewhat of a mixed bag: I find the house fried chicken to be pricey for how dry and small the pieces are, though the Fresno hot sauce alleviates some of that issue. The oxtails and grits and smothered bone-in pork chops are much better options."
    },
    {
      "source_id": "src_hollywood_reporter_2022",
      "publication": "The Hollywood Reporter",
      "title": "How Alta Adams Became Black Hollywood's Top Restaurant",
      "url": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/alta-adams-restaurant-black-hollywood-1235090816/",
      "published_at": "2022-02-18",
      "trust_level": "editorial",
      "content": "There are dozens of L.A. restaurants that draw actors dining with agents and directors imbibing with studio executives. Only one, however, lays claim to an outdoor space where said guests also will do the electric slide, mid-meal, while belting out Luther Vandross. Such was the scene at Alta Adams a few months ago, when Lena Waithe and her Hillman Grad Productions team convened there for a night of soul-food-laced revelry. A restaurant that would foster that level of comfort and joy is exactly what co-owner, chef and Watts native Keith Corbin was aiming for when he opened the West Adams restaurant with Michelin-starred restaurateur Daniel Patterson in 2018. To that end, it's fitting that Alta Adams has become a favorite among Black Hollywood and neighborhood residents alike. Still, like many restaurateurs bringing a new concept to life in a notoriously fickle city, he was cautiously optimistic about its success. \"I was nervous as hell,\" says Corbin of his mind-set shortly before its opening. \"[But] for our soft opening, John Legend showed up. Then, from there, Tiffany Haddish. Tracee Ellis Ross showed up, and she told me that she would be the first person to book my restaurant for an event.\" Ross made good on the promise, buying out the spot for a \"Women of Black-ish\" dinner. \"When you go in there, you feel so welcome and you feel at home,\" says Compass real estate agent and Alta Adams regular Pam Lumpkin. \"[Corbin] is liable to walk up and sit at your table whether he knows you or not, and you don't get that a lot anymore, especially since COVID.\" Fried chicken, corn bread and impossibly tender braised oxtails have enticed everyone from Issa Rae and Sterling K. Brown to Jay-Z and Diddy."
    }
  ]
}