{
  "place_slug": "anajak-thai",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Anajak continues to be the best restaurant in LA",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/anajak-thai",
      "published_at": "2025-11-04",
      "trust_level": "editorial",
      "content": "In 2021, we named this family-run Thai spot in Sherman Oaks our highest-rated restaurant in the city. In the years since, it has been the subject of near-universal acclaim, received national awards, and, most recently, has undergone a massive renovation that saw the square footage of its dining room nearly double.\n\nAt Anajak, you'll find the total package—a menu that mixes family traditions with sharp creativity, expertly sourced ingredients that are allowed to shine, a killer wine list stocked with unusual finds, and a fun, fully energized room that feels both of-the-moment and rooted in its old-school Valleyness (note the signed Fonzi headshot above the door). Even in a city with some of the best Thai food in the country, there's nothing else quite like it.\n\nThe restaurant originally opened in the early '80s, but it wasn't until Justin Pichetrungsi—son of the original owners and a former Disney imagineer—took over the business that Anajak began to look like does now, a place where couples share tuna tostadas over glasses of orange wine in an alleyway and tureens of tom yum come with dry-aged kanpachi collars floating in the broth.\n\nMore recently, the charmingly dated dining room underwent a full HGTV-worthy remodel, expanding the seating area, lifting the ceiling, and ripping out a wall so that the wok action in the kitchen sits in full view, all of which injects the space with fresh energy without sacrificing its quirky personality.\n\nThese days, you'll find two menus: one for regular dinner service, and one for the restaurant's famed Thai Taco Tuesday, where a handwritten poster of fusion-y weekly specials like dry-aged fish tacos and chinese sausage tostadas is hung near the door (you're told to snap a pic before sitting down). Of course, the regular menu is no slouch, either. It's an always-thrilling assortment of seasonal dishes made with locally raised pork, of-the-moment creations ported over from Anajak's alleyway omakase, and spot-on renditions of Thai classics that they've been serving for decades. We could probably spend the rest of this review listing out what to order, but just know that the laab tot and whole grilled fish are good places to start.\n\nSeats on the string-lit side alley are a lot of fun, too—especially during the slightly chaotic Thai Taco Tuesdays, which used to be a free-for-all but now require a reservation (a good thing). Unfortunately, though, that leaves the sidewalk seats on the front patio, which face traffic on Ventura, as the one area where you'll feel slightly removed from the hum of social electricity powering the rest of the restaurant. No matter where you end up, however, you're sure to watch a similar scene unfold. Pichetrungsi family members slicing mangoes at the counter, woks sizzling with baby bok choy driven in from the farm that day, and more than likely, Justin himself pouring a rare Hungarian wine for a group of diners that took an airplane ride just to dine here."
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Anajak Thai – Sherman Oaks - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/sherman-oaks/restaurant/anajak-thai",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Now in its fifth decade of operation, this beloved family-owned fixture has never been more in-demand. Much of its current acclaim owes, no doubt, to second-generation Chef Justin Pichetrungsi, whose approach hits a sweet spot between minding tradition and walking his own boldly idiosyncratic path. This is amply demonstrated on freewheeling \"Thai Taco Tuesdays,\" a no-reservations event that draws lines around the block. For additional excitement, one weekend per month, a unique omakase experience is surely one of the city's most coveted reservations. Whether sampling spot-on versions of Thai classics, or delving into more rarified fare, the warm service, memorable wine list and singularly buzzy atmosphere make for a one-of-a-kind experience."
    },
    {
      "source_id": "src_theinfatuation_2021",
      "publication": "The Infatuation",
      "title": "Give Up Pad Thai? Anajak Says It's Time",
      "url": "https://www.theinfatuation.com/los-angeles/features/give-up-pad-thai-anajak-says-its-time",
      "published_at": "2021-05-26",
      "trust_level": "editorial",
      "content": "It's 7pm on a Friday night, and the dining room at Anajak Thai stands empty. Gone are the waiters, weaving their way through crowded tables brimming with pad thai, tom yum, and crispy garden rolls. The host station is deserted, there are no glasses of water in need of refills. Instead, what I find at the Sherman Oaks restaurant, now in its 40th year of service, is a modest, efficient crew, quietly packing to-go boxes while a row of delivery drivers waits out front.\n\n\"We didn't close for a single day,\" says Justin Pichetrungsi, the current head chef and owner of Anajak Thai, when asked about the pandemic. \"But thankfully, Thai restaurants are known for takeout.\" There's a whiff of annoyance when he says that second part – half resignation, half genuine gratitude. \"Thai food as takeout\" is a stereotype that Justin's been trying to break ever since he took over his dad's restaurant.\n\nWhen Justin's father, Rick Pichetrungsi, first opened Anajak in 1981, it was a very different restaurant. At the time, there were only a handful of other Thai spots in Los Angeles, and many diners were unfamiliar with the cuisine. \"People didn't know what Thai food was,\" laughs Justin. \"They all thought it was, like, spicy Chinese.\"\n\nHis first target was the wine program. He launched a complete overhaul, personally selecting bottles made by smaller vineyards, like orange skin contacts from Chinon and rich, fruity gamays produced in Northern California. Then, he chopped over half the menu and replaced them with a rotating list of monthly specials.\n\nInspired by the family meals he and his kitchen were eating, beginning in summer 2020 Justin launched into a rapid-fire succession of takeout events, ranging from Thai Taco Tuesdays to post-apocalyptic-themed menus featuring waste products like fish heads and guts. Anajak Thai quickly became one of the most exciting places in town to grab a to-go meal, hosting a series of collaborations with chefs like Johnny Lee of Pearl River Deli, sushi and bento specialist Ai Kennedy, the team at Moo's Craft BBQ, Rebecca King of The Bad Jew, and more. All of which lead to his most ambitious dine-in project yet — the Thai Omakase."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Anajak Thai Cuisine | Restaurants in Sherman Oaks, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/anajak-thai-cuisine",
      "published_at": "2025-09-03",
      "trust_level": "editorial",
      "content": "Of course, national fame has changed this beloved second-generation Thai restaurant in Sherman Oaks, where James Beard award-winning chef Justin Pichetrungsi holds court over Anajak's infamously busy Thai Taco Tuesdays (where, on a good day, you'll wait only a hour to be seated—unless you're a celebrity, of course), plus an à la carte dinner service full of seasonality and nuanced flavor. I found the food here generally delicious and refined, from the must-order hat yai fried chicken to the enormous river prawns with nam jim sauce. The customer service and consistency of the kitchen has also improved in the last few years."
    },
    {
      "source_id": "src_michelin_2024",
      "publication": "Michelin Guide",
      "title": "Ian Krupp of Anajak Thai is The MICHELIN Guide California 2024 Sommelier Award Winner",
      "url": "https://guide.michelin.com/us/en/article/michelin-guide-ceremony/ian-krupp-anajak-thai-sommelier-award-michelin-star-guide-ceremony-california",
      "published_at": "2024-08-20",
      "trust_level": "editorial",
      "content": "Congratulations to Ian Krupp of Anajak Thai, MICHELIN Guide California 2024 Sommelier of the Year, presented in partnership with Franciacorta!\n\nOne of the earliest Thai restaurants in LA, Anajak Thai has delighted locals with its iconic dishes for over 43 years. Its buzzy, casual atmosphere might not be what most people imagine as a setting for serving fine wines, and the bold, high impact flavors of its Thai cuisine may not make obvious partners for pairings—but sommelier and wine director Ian Krupp has created a singular program that attracts connoisseurs and neophytes alike.\n\nFirst introduced to wine through working at Two MICHELIN Star and Green Star Providence and One MICHELIN Star Kali, Krupp has used his expertise to expand upon Anajak Thai owner Justin Pichetrungsi's foundation. Going beyond the expected realm of Riesling (though the list is certainly no slouch in that department), Krupp's list spans an impressive breadth of Burgundy and beyond, served in a friendly and approachable way. Most recently, he has begun collaborating directly with wineries themselves to make custom wines for Anajak Thai guests."
    }
  ]
}