{
  "place_slug": "augustine-wine-bar",
  "sources": [
    {
      "source_id": "src_the_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Augustine Wine Bar - Review - Sherman Oaks - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/augustine-wine-bar",
      "published_at": "2025-05-27",
      "trust_level": "editorial",
      "content": "After closing due to a kitchen fire in 2023, Augustine is back in business—and back to being the best wine bar in the Valley. If you were familiar with this Sherman Oaks standby, you probably remember the rustic interior that looked like an ADU in the Burgundy countryside. It's a space that begs you to burrow in next to a bookshelf with a glass of something from their Old World-leaning wine list. We particularly like swinging by for a nightcap after dinner at Sushi Note, their sister restaurant across the street. If you're feeling snacky, there's a reliable food menu of charcuterie, grilled caesars, and other small plates that go well with vintage brunellos."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Augustine | Bars in Sherman Oaks, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/augustine",
      "published_at": "2025-01-16",
      "trust_level": "editorial",
      "content": "A visit to Augustine is like stopping by your oenophile-buddy's home to sample some rare vintage wine. Matthew Kaner and Dustin Lancaster (Bar Covell), along with newcomer Dave Gibbs, have carved out a little slice of heaven from a former Brats Brothers along Ventura Boulevard, complete with black truffle cheese plates, tater tots, and some of the rarest vino you'll find in the valley, let alone the entire city. Soak up the jazz humming through the sound system and sink into a worn-in sofa as you get your money's worth out of the 1964 Chateau Latour Pauillac that caught your eye on the chalkboard behind the bar. There's a rotating list of dozens of varieties by the glass. For some guidance, find your nearest bartender. These guys and gals know the menu like the back of their hands and will find exactly what you are looking for—or what you weren't, which makes it all-too easy to burn a hole in your wallet."
    }
  ]
}