{
  "place_slug": "azay",
  "sources": [
    {
      "source_id": "src_the_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Azay - Review - Little Tokyo - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/azay",
      "published_at": "2024-02-21",
      "trust_level": "editorial",
      "content": "Azay is a half-French, half-Japanese restaurant in Little Tokyo where you'll find the only Japanese breakfast being served in LA proper. You'll find Azay in a tiny storefront on 1st Street, with giant glass windows and a bright-red trim; a building that at first glance, looks like a stationary store or a modern art museum's gift shop. But instead of overpriced postcards and Keith Haring candles, Azay offers an impressive mastery of both Japanese and French cuisines. Upon entering, you'll be greeted by Jo Ann or Philip, a mother-and-son duo who quit their jobs at the beginning of the pandemic to run Azay's front-of-house. Along with head chef Akira (their husband/dad), this family's been a part of the Little Tokyo community since 1946, when Jo Ann's father opened Anzen Hardware just blocks away. The menu is succinct, a mix of both French and Japanese dishes where sukiyaki beef and pork belly omurice live next to boeuf bourguignon, duck confit, and omelette francaise. Does that make Azay a fusion restaurant? Sure. But that's like calling Julia Louis-Dreyfus that \"lawyer from Arrested Development\" – technically true, but so uniform it's almost offensive. Like the 11-time Emmy winner, Azay flawlessly shapeshifts between many roles. You may find yakitori-style tacos, traditional tea ceremonies, fine dining prix-fixe menus, or bentos served with live jazz on any given night. Of course, you should probably throw in a Japanese breakfast order too, regardless of what time it is. Packed to the brim with flaky fish, bright-yellow eggs, and white rice that'll stick to your insides (in the best of ways), even if Azay didn't wind up as the last in town, their version would still be our favorite. Azay's Japanese breakfast is quite understated - nothing but a tray of broiled fish, tamago, tofu, miso soup, a side of rice, plus a few pickles."
    },
    {
      "source_id": "src_time_out_la_2022",
      "publication": "Time Out LA",
      "title": "Azay | Restaurants in Little Tokyo, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/azay",
      "published_at": "2022-01-15",
      "trust_level": "editorial",
      "content": "Although this tiny family-run restaurant on First Street first opened in late 2019, Azay can trace its roots back to 1946, when co-owner Jo Ann Hirose's father opened Anzen Hardware (which has since relocated nearby) in the same storefront. Offering a moderately priced, compact menu of French and Japanese dishes made by Jo Ann's husband Akira, Azay is best known for offering the elusive Japanese breakfast: a traditional meal consisting of broiled fish, miso soup and choice sides of seasonal vegetables, pickles and tofu, as well as slices of tamago omelette and a bowl of rice. While the breakfast set is always worth an order, don't skip out on sampling a few French dishes and desserts, including the deftly prepared duck confit and a complex, bittersweet matcha crème brûlée."
    },
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "Stephanie Hsu's Guide to LA",
      "url": "https://guide.michelin.com/us/en/article/travel/stephanie-hsu-los-angeles-california-la-michelin-guide-travel-restaurants",
      "published_at": "2025-02-06",
      "trust_level": "editorial",
      "content": "AZAY. I love a Japanese breakfast, and this place feels like the coziest, non-fussiest, most delicious-iest spot for just that."
    }
  ]
}