{
  "place_slug": "bar-monette",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Bar Monette - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/bar-monette",
      "published_at": "2024-08-01",
      "trust_level": "editorial",
      "content": "Bar Monette wants to be the cool kid on the block, what with Ice Spice booming through its speakers and a menu that reads like someone drew a big circle around southern Europe and said, \"Let's do this.\" That's all well and good. Especially since Santa Monica's Third Street Promenade could use a cool kid. But while the tiny, emerald-green restaurant from a well-known Toronto chef may be a safe haven from tourist mayhem, its cobbled-together menu poses problems. If you treat Bar Monette as the tapas spot it's trying to be, the disappointing food won't justify spending over $100 per person. Your best option is to use this restaurant as a solid pizza spot, though even then expect to spend.\n\nThose coming for drinks and snacks might interpret Bar Monette's space as a nice change of pace for the neighborhood. Its dark dining room resembles a kooky Cambridge professor's study, with gilded framed paintings, Greco-Roman busts, and a playlist that was curated by her 21-year-old students.\n\nCandles illuminate the faces of real estate bros and couples who emerged from their north-of-Montana homes to eat a $26 plate of poached prawns in a forgettable saffron bisque. Prawns and all, Bar Monette's food doesn't fit neatly into a genre. Italian? Ehh, kind of. A little overthought? Yeah, that's more like it. Half the menu is dedicated to small plates drowning in emulsified sauce, which can be ignored altogether. There's a scallop crudo with an off-puttingly sweet salsa negra, some maitake mushrooms in an oversalted butter sauce, and sobrasada-stuffed agnolotti coated in a smoked tomato butter that's strikingly similar to processed cheese. The best bite of the bunch is a sweet ribbon of jamon de Paris with manchego, but, in reality, you're paying nearly $20 for ham and cheese. Wine prices follow suit—most glasses cost over $20 and bottles float around $100.\n\nSo instead of spending on Bar Monette's stomped grapes or creamy things that don't taste as good as they look, focus your funds on the chewy, deeply charred pizzas. These are individually portioned and have an extra-thick crust to dip into \"sugos\" you can get on the side (we like the puttanesca sauce). Order the garlicky pesto pie with lumps of sweet crab or the soppressata with honey with a nice sweet-spicy thing going on. Even if you love your hypothetical Cambridge professor's charming study and her colorful office hour chats, don't spend too much time (or cash) at Bar Monette. Split a pizza, sip a glass of wine, and save room for a full meal elsewhere.\n\nWe don't know Aunty Wendy, but kudos to her for getting creative with her salad recipes. Soft, white radicchio is easy to bite through, and its bitterness is balanced by a basil and passion fruit dressing. This salad borders on being just a little too sweet, but it still makes for a good way to kick off a pizza night here. Don't let the delicate size of these pasta dumplings fool you, they're way too rich."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Bar Monette | Bars in Santa Monica, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/bar-monette",
      "published_at": "2025-02-01",
      "trust_level": "editorial",
      "content": "Written by Patricia Kelly Yeo, Food & Drink Editor, Time Out Los Angeles\n\nSteps away from the Third Street Promenade, Bar Monette primarily functions as an upscale wine bar, but the artfully presented cicchetti, delicious wood-fired pizzas and fleet of housemade sauces make this tiny, emerald green space a worthwhile destination for a light Italian-ish dinner on the Westside. Chef Sean MacDonald, who's already found success in his native Toronto, skillfully weaves well-trod gourmet ingredients like A5 Wagyu beef and Santa Barbara sea urchin into elegant starters that complement the long list of mostly natural wines. The individually-sized pies, while pricier than average, are a cut above the middle-of-the-road pizzas at nearby Elephante and come with a puffy, ultra-thick crust, ideal for dipping into a side of jalapeño tonnato or burnt romesco."
    },
    {
      "source_id": "src_resy_2023",
      "publication": "Resy",
      "title": "Meet Bar Monette, a New Santa Monica Destination for Hot Pizzas and Cool Wines",
      "url": "https://blog.resy.com/2023/07/bar-monette-santa-monica-destination-pizza-wine/",
      "published_at": "2023-07-24",
      "trust_level": "editorial",
      "content": "In 2021, destiny (in the form of a dating app) brought Sean MacDonald, a chef living and working in Toronto, together with Monette Moio, an actress and stunt double born and raised in L.A. \"As soon as we met [on Raya], we both knew we'd found the one,\" says the chef. MacDonald had always dreamed of living in Los Angeles, so meeting Monette felt like kismet. In 2022, he moved from The 6ix to Tinseltown to be with his soulmate and flex his culinary chops in the U.S.\n\nWhile scouting for a larger restaurant space, MacDonald walked into a 900-square-foot shoebox a block from the ocean in Santa Monica that he couldn't resist. He immediately had a vision for the future Bar Monette: forest-green walls, patinaed copper accents, and a menu of simple-yet-standout pizza and small plates. \"I'd just sit in the room and think about the flow and how I wanted people to feel,\" says MacDonald, already sounding endearingly Angeleno.\n\nChef de cuisine Jeff Whittaker (formerly of Hippo) and MacDonald turn out Neapolitan-New York hybrid pies made with sourdough starter and a high water-to-flour ratio. This leads to beautifully airy dough with a crisp bottom and generous blistering. \"It comes fully intact,\" Macdonald explains, \"because we don't want to ruin the integrity of the pizza.\" The pizza is served with scissors so you can cut it yourself, just like they do in Naples.\n\nThere are six pies on offer, including a Margherita-esque version that's cooked with tomato and olive oil, then topped with stracciatella cheese and basil after it emerges from the oven. For a richer, funkier option, look to the white pie, with aged cheese and truffle honey (and optional caviar). For vegans, there's an off-menu marinara pie as well. Jambon de Paris with Manchego and pickled peppers.\n\nTo build the wine list, MacDonald simply asks his wine suppliers, \"What do you think is cool and have limited quantities of, and what are you excited about?\" The bottles rotate, but MacDonald plans to keep the Domaine Lelièvre Leucquois Brut Rosé — a sparkling rosé made from Gamay grapes in a Champagne-adjacent region, which happens to go down very easily — as a permanent fixture.\n\nVibe-wise, think less touristy Santa Monica Pier (just down the street) and more cool-kid culinary salon. The space is decidedly intimate, with just 26 indoor seats, including bar stools that look onto the pizza oven, as well as front patio seats with views of the ocean. Service is well-informed, with no question about the lesser-known wines or ingredients unanswered (and no glass left empty). Given the tight quarters, you'd be wise to book your Resy a few weeks out.\n\nMacDonald is planning to open another Bar Monette soon, possibly in Calabasas or West Hollywood. In 2024, he plans to open a larger Monette restaurant with 90-plus seats. Beyond that, who can say what else love will inspire.\n\nErin Mosbaugh is a food and travel writer who has worked in kitchens in New York and L.A. and co-created the James Beard Award-winning food site First We Feast."
    },
    {
      "source_id": "src_resy_2023_hitlist",
      "publication": "Resy",
      "title": "The June Hit List: Mon Ami, Bar Monette, Damon's, and More",
      "url": "https://blog.resy.com/2023/06/los-angeles-restaurants-june-2023/",
      "published_at": "2023-06-01",
      "trust_level": "editorial",
      "content": "The latest addition to L.A.'s ever-growing pizza scene is Santa Monica's buzzy new Bar Monette. Here, chef Sean MacDonald makes wood-fired pizzas with fluffy, leopard-spotted crusts and luxe toppings like truffle and aged cheese or pesto and Dungeness crab, in addition to seasonal \"tapas\" such as potato agnolotti with cultured butter and chive oil and charcoal-grilled prawns in a saffron bisque. It's a casual spot with just the right amount of fancy."
    }
  ]
}