{
  "place_slug": "barra-santos",
  "sources": [
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Barra Santos makes a fun night of tapas feel effortless",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/barra-santos",
      "published_at": "2025-05-22",
      "trust_level": "editorial",
      "content": "Few spots in LA are as effortlessly fun as Barra Santos, a Portuguese bar-restaurant hybrid by the Found Oyster team that spills out onto its Cypress Park sidewalk.\n\nWe suggest making a reservation if you want a guaranteed seat at the handsome counter, but walk-ins come with perks, too. People sip crisp Portuguese whites on the curb while waiting for a table, allowing a night to kick off before the garlicky prawns show up. If you're looking to embrace leisure and delicious acid-drenched food this evening, the nonchalance of Barra Santos is delightful.\n\nBarra Santos' menu is short, so you can either eat a bowl of olives with a beer or order one of everything. Dishes skew simple, sticking to the bones of Portuguese classics you'd find on a family's Saturday lunch table, and almost uniformly relying on garlic, white wine, and lemon. Vinegary heat from piri-piri sauce tickles your throat like a goose feather, jamón melts on your tongue, and a cinnamon-heavy almond cake softens up under a dollop of cream.\n\nIf you manage to corral a friend for a go-with-the-flow kind of night at Barra Santos, split a gorgeous seared dorade, and chase off-dry sherry with a pork sandwich dribbling herb sauce out of the sides. The narrow, blue-tiled dining room is the perfect backdrop for a romantic (albeit cramped) date, but don't overlook the sidewalk. There's more legroom, music spills out from the restaurant's front door, and couples giggle into their wine glasses. The general contentment at every table sets the tone for an evening here, which, with the right company, can transform a run-of-the-mill dinner into a memorable night out.\n\nIf you crave a little salty something, this is a dream spread. The kitchen uses an old-school deli slicer to cut razor-thin pieces of jamón iberico that last three seconds before melting away on your tongue. Add briny coriander-flavored olives and wedges of soft Portuguese cheese (which changes daily) and it's a perfect snack."
    },
    {
      "source_id": "src_michelin_guide_2024",
      "publication": "Michelin Guide",
      "title": "Barra Santos – Los Angeles",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/barra-santos",
      "published_at": "2024-07-10",
      "trust_level": "editorial",
      "content": "Snag a seat outside or in at this small, no reservations restaurant in Cypress Park. Inside, the best seats are at the bar with a view into the kitchen. The focused menu is Portuguese and even features some family recipes. Plenty of items are designed for sharing, including their crispy and tender bacalhau fritters with salt cod, potato, and caramelized onion, or charred cabbage over a bed of white beans studded with Iberico pork and garlic butter sauce. Their whole branzino with a flavorful green sauce made with pumpkin seeds, roasted serranos, and tomatillos is an absolute must. Finally, spiced almond cake with whipped crème fraîche is a nice ending."
    },
    {
      "source_id": "src_resy_blog_2025",
      "publication": "Resy",
      "title": "Barra Santos Feels Like a Dinner Party Every Night",
      "url": "https://blog.resy.com/2025/07/barra-santos/",
      "published_at": "2025-07-07",
      "trust_level": "editorial",
      "content": "In my 30s, when I could no longer muster the energy to climb on top of a bar — much less shimmy my way across it at 2 a.m. — I started chasing a different kind of party: one that replenishes your energy, rather than sucking you dry. I found that in Cypress Park's Barra Santos, a petite sliver of a restaurant that packs so much exuberance into its few square feet that most summer nights, its chattering guests spill out onto the sidewalk, clinking glasses of vinho, lingering for just one more plate of pork bifana, just one more flirtatious conversation with their neighbor, just one more story from their server. It feels like a dinner party every night — which is just my speed these days.\n\nI've never had a bad night at Barra Santos. It has all the familiarity, intimacy, and tight spaces I associate with a great night out, minus the club-level decibels and accompanying hangover. It fulfills the part of me that wants to feel like I'm having a big night, while acknowledging the realities of my life as a mostly responsible adult human.\n\nGod bless our restaurants, Los Angeles, but a good number of them never figured out that they could do more with less — less space, less menu, less garnish. Barra Santos' narrow galley-like interior is a workhorse, just large enough to attract some 28 guests with its quirky sense of magical realism. Its door arches are patterned deep blue and white in licensed reproductions of azulejos, traditional glazed Portuguese tiles that murmur \"charming seaside Porto bodeguita.\" The warm red brick wall is notched with the most miniscule, floating two-tops, and the 25-foot red oak bar commands most of the room. The vivid black and white photos on the walls tell stories of fado singers in Portugal, where partner and director of operations Mike Santos lived as a young child. After a night of sipping on sherry and porto, you'd swear you were about to step out onto patterned 16th-century cobblestones instead of the cold Los Angeles concrete.\n\nI sometimes find myself wandering down the street from Loquat \"just to see\" what's happening at Barra Santos, when my feet meant to go home. The Portuguese-influenced cuisine, with seafood from Portugal and Greece and fresh produce from the farmers' market, helmed by Nogales-raised chef-partner Melissa López, strikes the right balance of unpretentious and creative. There are five small plates and seven large plates on the menu, no more — and every single one hits. Ordering as a group of four feels easy here. They say that running a restaurant is like throwing a party every night, and at Barra Santos manages to make you feel like you're in it all together, if just for one night."
    }
  ]
}