{
  "place_slug": "bavel",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "DTLA's Bavel mixes blockbuster energy with incredible mezze",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/bavel",
      "published_at": "2025-09-10",
      "trust_level": "editorial",
      "content": "Bavel is the middle child restaurant from the people behind Bestia, the Italian restaurant where it's still tough to book a table, and Saffy's, a neighborhood-y spot in East Hollywood that was our highest-rated restaurant of 2022. With siblings like that, you might think the middle child could get lost in the shuffle—but Bavel remains the best of the bunch. This upscale Middle Eastern restaurant combines delicious, deeply personal food with reliably great service, all in a stunning, blockbuster space that buzzes with energy.\n\nBavel is in the Arts District, on a stretch of pavement that might once have been described as quiet, but is now Times Square for hulking construction cranes. The industrial dining room manages to feel sunny even when you're sitting down for a 10pm reservation: long green vines hang from the ceiling, a huge open kitchen, and a side patio that nearly doubles the size of the restaurant. It's a place you instantly want to hang out in, and also a setting that will immediately blur into the background once you start eating.\n\nThe Middle Eastern menu is mostly pumped-up versions of familiar dishes—they're not trying to reinvent baba ghanoush here—but the food isn't quite traditional either. There's hummus with duck 'nduja, grilled celery root with honey mushroom tzatziki, and a lamb neck shawarma dish that's so big it could be the only thing you order (it won't be).\n\nThere are two hummus options at Bavel: one with duck 'nduja and one without. After eating both, we're here to tell you should probably just plan to put both on your table—they're that good. The classic is creamy with two different types of chili paste, while the duck 'nduja has a smoky sweetness that goes perfectly with the buttery pita that comes on the side.\n\nThis dish has been on the menu since Bavel opened. It was one of our favorites then and it's even more of a favorite now. It involves fried flatbread, grated tomato, herby creme fraiche, a soft-boiled egg, and a spicy strawberry zhoug sauce that we always want more of.\n\nYou'll enjoy a lot of different sauces during a meal at Bavel, but the eggplant tzatziki that comes under these perfectly cooked prawns might just be the best of the night.\n\nThis dish comes out looking very impressive—a whole roasted lamb neck laid over a huge piece of laffa—and only gets better from there. It's a rich piece of meat, but add the fermented vegetables to your mini sandwich and your fancy shawarma turns into a G.O.A.T. shawarma.\n\nWe could tell you about the tagine—it's very, very good. But the coconut rice it comes with is even better. It's soft and pillowy with a sweetness that brightens up the decadent oxtail.\n\nWe never regret ordering these round little donuts, even if we have zero stomach room remaining. Plan to do the same.\n\nThere's still a strong chance you'll need to book a reservation in advance (even if you're eating at 5pm), but that comes with territory. Bavel remains a fine-tuned restaurant machine that we'll find any excuse to visit, and we recommend you do the same.\n\nBest Of The Best: These are as close to perfect as restaurants get. Whether they're counter-service or fancy schmancy, we're confident you'll love them."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Bavel",
      "url": "https://www.timeout.com/los-angeles/restaurants/bavel",
      "published_at": "2025-03-01",
      "trust_level": "editorial",
      "content": "From Ori Menashe and Genevieve Gergis, the same couple behind Bestia, Bavel draws upon Levantine culinary traditions in a sprawling, plant-filled dining room offset by a string-lit patio."
    }
  ]
}