{
  "place_slug": "beethoven-market",
  "sources": [
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Beethoven Market is the neighborhood spot other neighborhood spots dream about - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/beethoven-market",
      "published_at": "2025-04-03",
      "trust_level": "editorial",
      "content": "Beethoven Market is a straightforward Cal-Ital spot in Mar Vista with great food, a great vibe, and reasonable neighborhood restaurant prices. Reliably packed with family dinners and date nights, Beethoven is the textbook definition of a fantastic neighborhood restaurant, the kind of place that buzzes with enough social energy to charge every Rivian parked outside. It also helps that everything here is reasonably priced. All of the pastas are under $20, and entrees hover around $30, including a smoky grilled pork collar with roasted cabbage and tart, cooked-down cherries that's big enough to split.\n\nLots of restaurants like to describe themselves as casual, but Beethoven is one of the few sit-down spots on the Westside where the term \"casual dining\" truly applies. It might also explain the least casual thing about Beethoven right now—booking a table. But if you have the patience to plan a few days ahead for a reservation, you'll be rewarded with a lovely meal that'll clue you in on what the Mar Vista crowd already knows.\n\nUpdate: Beethoven Market's liquor license is currently suspended, and they're unable to serve alcohol at the moment. Beethoven Market used to be a corner grocery store in a previous life, but even though the deli counter and shelves of breakfast cereal are long gone, this breezy Cal-Italian spot still feels comfortably lived-in. Half of Mar Vista seems to be here every night, splitting a few pastas, small-talking over calamari, or drinking chilled vespers on the patio. Nothing about the simple, straightforward food at Beethoven is particularly groundbreaking, but it doesn't need to be. The housemade pastas are spot-on al dente, like the standout leaf-shaped foglie d'ulivo tossed in silky pesto. Light and airy pizzas deliver a satisfying crunch. The bright salads and grilled vegetables that make up half the menu come well-spritzed with lemon—maybe even from the lemon trees lining the patio.\n\nBeethoven's pesto has so much parmesan mixed in that it's almost a basil cream, and the chewy, handmade leaf-shaped pasta scoops it up like mini soup ladles. Finally, a place that doesn't forget arrabbiata is supposed to be spicy. Beethoven's version hits like a bull's-eye: al dente bucatini, pomodoro with concentrated tomato flavor, and enough chili flake to remind you it's there between wine sips. Beethoven ferments its pizza dough for three days, so you get an airy, crispy pie that looks like a collapsed soufflé. This seafood pizza's flavor isn't as memorable as its crust, though. A hint of chili heat and bitter lemon come through, but the clams get lost in the cheese. We go back and forth on the best pasta at Beethoven Market, but we never question our loyalty to this beautiful pork collar. It's a banger of an entree and tastes like it was in a smoky lip-lock with the grill seconds before landing at the table.\n\nBeethoven's tiramisu is 90% fluffy, coffee-flavored mascarpone, and that's not a bad thing. It's rich in flavor, light in texture, a little crunchy from dark chocolate chunks, and, most importantly, not too sweet. The real reason to order this dessert, however, is that a server scoops it from a giant tray onto your plate with a satisfying splat."
    },
    {
      "source_id": "src_resy_2025",
      "publication": "Resy Blog",
      "title": "How to Get Into Beethoven Market (And What to Order Once You're There)",
      "url": "https://blog.resy.com/2025/05/beethoven-market/",
      "published_at": "2025-06-02",
      "trust_level": "editorial",
      "content": "At the end of March, the corner of Beethoven Street and Palms Boulevard became one of the most popular spots in Mar Vista. From the moment Beethoven Market opened, business has been booming. Guests throng the bar and spill out onto the sidewalk as they angle for a shady seat on the patio or an indoor table where they can watch flames lick hanger steaks and rotisserie chickens in the open kitchen. Clearly, the neighborhood was hungry — and thirsty — for a place like this. Located in the middle of a mostly residential area, the restaurant's vibe is casual enough for families and snazzy enough for date nights — around 7 p.m., the staff dims the lights to amp up the amorous ambiance.\n\nFor 75 years, Beethoven Market was a popular local grocery and liquor store. When it closed in 2023, Adler stepped in. Open daily for dinner, the new iteration of Beethoven Market is a hit. General manager and beverage director Isa Roske, who was previously the wine director at Scopa and the regional beverage director for the Butcher's Daughter group, has a few tips for getting in. We have about 120 seats and an 23 additional seats at the bar. If you sit at the bar, can you order everything that's on the menu? Our full dinner menu is available at the bar. You just have to be in a seat. Currently, you're just open for dinner.\n\nSince your biggest rush comes at 5 p.m. and you get another bump around 6:30 or 7, is it easier to get a reservation later in the evening, at 8 or 9 p.m.? We close at 9, Sunday through Wednesday, and at 10 Thursday through Saturday, so yeah, definitely towards 8 or 9, there'll be a lot of flexibility. We definitely get some no-shows or cancellations for those later slots, so people can usually nab those the day of. If someone is coming to Beethoven Market for the first time, what dishes are an absolute must? Ooh, that's tough. The chef did such a good job curating this menu. But some standouts are our housemade focaccia with whipped ricotta, and they drizzle a little bit of avocado honey over it.\n\nThis was a 75-year-old market called Beethoven Market that closed down about three years ago. Jeremy Adler bought the building, and it was under construction for almost two-and-a-half years, so I think it built anticipation and buzz. It's an odd place to put a restaurant in the middle of a neighborhood, but I think there's something very smart about it because I would say approximately 40% of our guests are people who live within walking distance. People come in the door and as you're trying to seat them, they're stopping and saying hi to someone at the bar or at another table. It has this really great community feel. That's what we're going for at the core. Our business entity is called Third Place LLC. The concept is that your home is your first place, your work is your second place, and your third place is your local hang. It feels like we have been losing a lot of third spaces over the last several decades, so it's nice that people have a neighborhood spot like this."
    },
    {
      "source_id": "src_wallpaper_2025",
      "publication": "Wallpaper*",
      "title": "Mar Vista restaurant Beethoven Market: California meets Italy",
      "url": "https://www.wallpaper.com/travel/restaurants/beethoven-market-los-angeles-review",
      "published_at": "2025-06-29",
      "trust_level": "editorial",
      "content": "Beethoven Market owner Jeremy Adler, a partner at the Michelin-recognised South Asian restaurant Cobi's in Santa Monica, wanted his first solo venture to be a neighbourhood gathering place for the Mar Vista community (not far from the Santa Monica airport) – an extension of your own living room, where you might gather with family and friends. The renovated 1949 historic building was designed by Tara Bean (known for Elephante in Santa Monica and Belles Beach House in Venice) to embrace the indoor-outdoor California lifestyle while adding a touch of Italian cosiness and charm. The outdoor patio features lavender and rosemary bushes, kumquat trees, and a central 30-year-old olive tree, with French doors leading into the open kitchen, central bar, and communal seating. The original wood ceiling and steel beams were restored, while Roman-plastered walls, interior oak herringbone flooring, exterior limestone pavers, and leathered marble countertops were added, complemented by earthy Italian tones. With a background that includes two of the top pasta-and-pizza havens in town (Funke and Mother Wolf), chef Michael Leonard brings his dough-making talents to the kitchen, from simple lemon linguine to zucchini and ricotta pizza. A new Ora del Dolce Far Niente hour, now running from 4 to 5pm, is a good option if you didn't book ahead. Grab a seat at the bar, order a Vesper Dream cocktail (with olive oil–infused vodka), and enjoy all-beef meatballs or crispy artichokes. A highlight of the main menu is the half chicken, slow-roasted on the rotisserie for four hours, recycling its own juicy drippings, then finished over a live fire. Adler spotted a 16th-century rotisserie in France years ago and finally realised his dream of having one custom-built at Grills by Demant in Atlanta. Be sure to save room for the tableside tiramisù, when the server brings the whole dish to your table and scoops out a generous portion, just like at home."
    },
    {
      "source_id": "src_laweekly_2025",
      "publication": "LA Weekly",
      "title": "The Historic Beethoven Market Reopens In Mar Vista",
      "url": "https://www.laweekly.com/the-historic-beethoven-market-reopens-in-mar-vista/",
      "published_at": "2025-03-29",
      "trust_level": "editorial",
      "content": "After two years of meticulous renovation with careful thought given to its history in the neighborhood, restaurateur Jeremy Adler will open the Beethoven Market as a restaurant for happy hour and dinner in Mar Vista on Saturday, March 29. While the market aspect of the location is gone, Adler polished up the 1949 building that functioned mostly as a liquor store, keeping its integrity. The restaurant's design, by Tara Bean Designs, includes a cozy central bar and homey outside patio that feels like a neighbor's backyard with a breezy indoor-outdoor flow, surrounded by French doors and lots of natural light."
    }
  ]
}