{
  "place_slug": "betsy",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "At Betsy in Altadena, simple wood-fire cooking makes the whole room glow",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/betsy",
      "published_at": "2025-11-19",
      "trust_level": "editorial",
      "content": "Betsy is a homey dinner spot in Altadena that charms you with straightforward wood-fired cooking and neighborly service. It's impossible to talk about Betsy without mentioning its unusual journey. The Altadena restaurant originally opened as Bernee a month before the Eaton Fire devastated the tight-knit foothill community. It narrowly escaped the flames, even as many surrounding homes and businesses did not. Eight arduous months later, it reopened with a new name, but the same ethos: a neighborhood gathering spot that doubles as a damn fine place to have dinner. These days, driving up the long, steep slope of Lake Avenue until you start seeing bare foundations where buildings once stood remains a surreal and sobering experience. Betsy exists practically on the edge of the burn zone, and in some ways, eating there can feel like dining at the edge of the world.\n\nOnce inside, your eyes will be drawn to the huge, roaring wood-fire hearth that takes up most of the kitchen. Flames leaping from three iron grills illuminate the dining room like a bonfire in a cave, each one radiating enough heat to make any extra layers you arrived in completely unnecessary. Betsy certainly isn't the only restaurant in LA that cooks almost everything over fire, but it might be the most visceral about it. If you were sitting at the chef's counter and wanted your strip steak medium-well, you could probably lean over and sear it with a long enough stick. All Time, and his new restaurant shares a good amount of DNA with Los Feliz's favorite spot for big-ass salads and unfussy plates of grilled meat. The menu at Betsy similarly includes a plate of heirloom tomatoes with a runny mound of burrata and warm focaccia, and a smoke-kissed cobbler baked until its fruity innards bubble up like a lava field.\n\nThere will be seasonal vegetables—usually heavily blistered and charred on the grill—that your server will describe with the urgency of a car salesman at the end of the month. During one visit, ours kindly but sternly reminded us that we only had a few weeks left until stone fruit season ended, and time was ticking. For the most part, though, Betsy operates at an unhurried, settled-down pace. Expect to see married retirees and groups of Pasadena moms in kaftans cutting into pork chops while saying things like, \"This red was a perfect choice, Jeanine.\" The bar is especially ideal for dates, and you'll usually find couples canoodling longer after they polish off their blackened cheesecake, soaking in the glow of the embers and nursing top-off splashes of pinot. Some restaurants are built for lingering, long conversations, and meals that stretch deep into the night. Betsy is one of them. It's a subtle but stirring reminder that on the long road to recovery, shared spaces like this aren't going anywhere—and neither is Altadena.\n\nA fairly by-the-books caesar that's large enough to feed a table of adults, so no take-two-leaves-and-pass-it going on here. Groups of four take note. If you've had the famed burrata toast at All Time, this will feel familiar. Juicy-sweet tomatoes dressed with salt and nice olive oil, some gooey burrata, and crispy-crust focaccia. Much like the Haim Sisters, this is a power trio we pray never breaks up. Some of the charring on Betsy's vegetable dishes can be a bit uneven, but this grilled cabbage arrives Goldilocks levels of just-right. The crunchy carmelized edges give way to a sweet, fork-tender center. The dessert situation at Betsy is serious. Do yourself a favor and make a vow before you sit down that you'll order both the wood-oven cheesecake and cobbler no matter how full you are. Skip other stuff, if necessary. Truly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_resy_2025",
      "publication": "Resy",
      "title": "Betsy Marks an Emotional Homecoming to Altadena",
      "url": "https://blog.resy.com/2025/10/betsy-altadena/",
      "published_at": "2025-10-06",
      "trust_level": "editorial",
      "content": "This is the genuine hospitality-forward perspective with which owner Tyler Wells runs Betsy (formerly Bernee). Wells, of L.A.'s well-known All Time and coffee connoisseur fame, opened Bernee in December 2024. It was an immediate hit, full every one of the 31 nights it was open. On January 7, 2025, the Eaton Fire cut that celebration short. Wells' restaurant miraculously survived, but his home, marriage, and spirit did not. The chef was left reeling, contemplating abandoning a dream. After some initial months of recuperating, Wells accepted an invitation to a residency at The Ecology Center in San Juan Capistrano — giving him carte blanche to live and cook on the farm, to reconnect with himself and his craft. The experience recentered Wells, who returned to Altadena determined to reopen his space, now renamed Betsy in honor of his mother.\n\nMany months and a life-changing fire after our initial encounter, Wells texted me from 32,000 feet: \"Sharon! The opening was perfect and exactly what I dreamed of. The restaurant was full of friends and people I didn't know or who had been to the restaurant once before we closed. This space has become the best food and professional experience of my career. We [the staff] all had to scatter and figure out our lives in order to come back together, and as a result, we're extremely grateful. There's a shared feeling that we all left and reflected, and now there's a new seriousness to what we do.\n\nThis summer, you published a personal message on your Substack announcing Betsy's opening. You said that you want the restaurant to be a lighthouse for Altadena, which resonated with many people, myself included. Back in spring, our friend Randy [Clement, of Good Neighbor Bar] said that the places we lost in the fire only exist in our memories, and the places that survived can be the lighthouses, not only prospectively, but because they are literal touchpoints to the past. If you dig deeper into that idea, what do you hope being a lighthouse means for Betsy?\n\nRestaurants have never been only about food for me. I obviously love food, but the strength and vibrancy of a restaurant is directly correlated to the strength and vibrancy of a neighborhood. In L.A., we have a lot of destination restaurants due to our geography, but I love walking around a city and seeing a restaurant that you can tell acts in service of the immediate locale overflowing with people.\n\nHow do you feel Betsy could bring customers to Altadena who haven't visited since the fires, and what kind of feedback have you gotten from those diners? I approach this work with humility and I take nothing for granted. This year has been full of reckoning and accepting truths, but there is something magical happening now. Overall, I feel a big responsibility. We're experiencing the contrast between seeing that everything outside is gone, and then coming into this space that is singular, alive, and vibrant. I love the space because when you're inside, if you didn't know what had happened, you wouldn't know where you were or what year it is, and you certainly wouldn't know what it looks like outside. For people who are coming up for the first time since the fire, I'm experiencing gratitude, kindness, and shock. People arrive and say, \"Wow, I had no idea that everything was gone.\" It's a similar refrain that then moves into, \"but it feels so good in here.\" That's affirming and lifegiving."
    },
    {
      "source_id": "src_lamag_2026",
      "publication": "Los Angeles Magazine",
      "title": "Los Angeles Magazine's 10 Best New Restaurants",
      "url": "https://lamag.com/food/los-angeles-magazine-best-new-restaurants-january-2026-l/",
      "published_at": "2026-01-01",
      "trust_level": "editorial",
      "content": "In Dec. 2024, Tyler Wells (of Los Feliz cafe All Time) opened the intimate restaurant Bernee in Altadena for what would amount to 31 nights before the Eaton fire devastated the area. The space was spared, and in Aug. 2025, Wells revived what he considers to be the dream restaurant he's worked toward for 20 years: a simple, rustic neighborhood spot serving food entirely sourced from growers and producers who respect the soil. Almost every dish is cooked over a custom-built live-fire hearth, from blistered tomatoes and charred cabbage to ricotta gnocchi in lemon butter and heritage pork chops or tomahawk rib-eyes. A wine list is equally rustic and personable, featuring selections from Wells' friends and growers who respect the soil. Betsy (named after Wells' late mother) is a solid neighborhood option with a homey vibe and food well worth the trip from other parts of L.A."
    },
    {
      "source_id": "src_pasadenastarnews_2025",
      "publication": "Pasadena Star News",
      "title": "After the Eaton fire, this Altadena restaurant offers hope on every plate",
      "url": "https://www.pasadenastarnews.com/2025/10/26/after-the-eaton-fire-this-altadena-restaurant-offers-hope-on-every-plate/",
      "published_at": "2025-10-27",
      "trust_level": "editorial",
      "content": "Pardon me a deep dive into the murky waters of cliché, but Betsy (the restaurant), which sits some distance up Lake Avenue in Altadena amid the ruins of January's Eaton fire, is a phoenix of a destination, rising from the devastation that once surround it, to feed locals a very personal cuisine — with hope on every plate, and in every bite. This minimalist storefront isn't so much a restaurant, as it is a testament to our ability to carry on, despite the odds. Dining at Betsy feels like a communion of survivors.\n\nChef Tyler Wells has turned what was Bernee into Betsy, with a blazing wood burning hearth behind the counter — which gives you a front-row seat to the preparation of every dish. The flames that devastated Altadena have been tamed, turned from a destructive power, to a culinary force. It's a bit like being witness to human history, with flames brought under control, and made to do brilliant things to meat and fish. And focaccia, which is as good as bread can be. It's not so much a dish, as it is a symbol. A statement that Altadena is back in every bite.\n\nTraveling up Lake to Betsy, near the intersection of Lake and Mariposa Street, is a sobering experience. The ruins are mostly cleared, leaving a moonscape of vacant lots waiting for the return of life. Though Mariposa just west of Lake was not spared the flames, the building that houses Betsy still stands, rebuilt and cleared of smoke. Betsy is an oddment of a storefront, with a handful of tables on the street in front, more tables along the wall within, a small dining area just where you enter the room — and, of course, the counter. There's a sense of communion among the diners. Seated at the counter, I exchanged recent dining experiences with folks sitting next to me, and compared notes on the menu. Which, like the room, is notable for its simplicity. This is a small restaurant with a small menu. Small — but carefully curated. It's hard not to find something you'd want. And to consider something else that you promise yourself you'll order next time.\n\nThis is food that's both traditional and modern at the same time. The dishes aren't especially peppered with obscure culinary nomenclature that has you heading for Google to figure out what the heck exactly you're ordering. Though it's not 100 percent clear either. The \"wanderer\" in the Wanderer New York strip steak refers to meat from the free-range, barley fed Wanderer brand of Melbourne, Australia. The Payne walnuts in the mixed lettuce and shallot vinaigrette salad refer to the walnuts developed by George Payne in San Juan Bautista in the late 1800s. Raw and organic. The Mountain Magic tomatoes served blistered with the locally caught fish of the day are notably sweet, larger than a cherry, but not much.\n\nRising from the ashes of January's Eaton fire, at the top of Lake Avenue and surrounded by ruins, this small storefront serves brilliant food prepared in glowing ovens behind the comfortable counter. It's a statement on a plate that Altadena will rise again. Suggested dishes: 6 Appetizers ($14-$24), 5 Entrees ($29-$140), 4 Side Dishes ($14-$16), 3 Desserts ($12-$14)."
    },
    {
      "source_id": "src_eaterla_2025",
      "publication": "Eater LA",
      "title": "2025 Eater Los Angeles Award Winners",
      "url": "https://www.palosverdespulse.com/blog/eaterlaawards2025",
      "published_at": "2025-12-15",
      "trust_level": "editorial",
      "content": "At 875 E. Mariposa Street in Altadena, Betsy is a live-fire restaurant born from loss, community, and resilience. Eater describes the story behind the comeback: \"Betsy's quiet resilience has made it one of the best restaurants in America this year.\" After the devastating Eaton Fire destroyed over 9,400 structures (including owner's home), restaurateur and chef rebuilt — choosing to use live fire to realize dishes such as a chicory Caesar with white anchovy, sea-salt focaccia with \"the cheese we are liking\" of the day, ricotta gnocchi in lemon butter, sprouting cauliflower with charred onion vinaigrette, and heritage pork chops or tomahawk rib-eyes cooked over flames."
    },
    {
      "source_id": "src_resy_2025_hit_list",
      "publication": "Resy",
      "title": "The 10 Restaurants That Defined Los Angeles Dining in 2025",
      "url": "https://blog.resy.com/2025/12/la-restaurants-2025/",
      "published_at": "2025-12-05",
      "trust_level": "editorial",
      "content": "Miraculously, Bernee's building survived, but the restaurant it once housed was forever lost. After a bit of soul searching, and a life-affirming residency at the Ecology Center in San Juan Capistrano, Wells returned to Altadena and rechristened the restaurant as Betsy. It's a cozy 39-seat dining room where bottles of wine line the walls and old-fashioned kerosene lamps sit on tables out front. At the center of it all sits a roaring fire, contained in Betsy's custom-built Boreal Heat hearth. Almost every dish here is cooked over a live flame, including blistered tomatoes, blackened Basque-style cheesecakes, and charred cabbage, \"burnt to perfection,\" as a server describes it. In December 2025, Wells isn't playing with fire. He's reclaiming it as his own."
    }
  ]
}