{
  "place_slug": "buvette",
  "sources": [
    {
      "source_id": "src_ventura_blvd_2022",
      "publication": "Ventura Blvd",
      "title": "Meet Rebecca Rose Phillips, the Force Behind Vintage Wine + Eats and Buvette",
      "url": "https://www.ourventurablvd.com/meet-rebecca-rose-phillips-the-force-behind-vintage-wine-eats-and-buvette/",
      "published_at": "2022-04-20",
      "trust_level": "editorial",
      "content": "Rebecca, who grew up in Wisconsin, opened Vintage Wine + Eats in Studio City in 2018 and the intimate wine and cocktail bar Buvette in Sherman Oaks a year later. Through a mutual friend Rebecca met her future business partners who were looking to launch wine-oriented concepts. In 2018, inspired by what she felt was a need for more female leadership in the industry, she opened Vintage Wine + Eats, a charming restaurant and wine bar on Ventura Boulevard with a comfort-food menu of everything from vegan meatballs to beef bourguignon to bratwurst on a pretzel roll. Rebecca describes the menu as a collaborative effort centered around her wine selections. \"I like to say this is like the country house and Buvette is like the city house,\" says Rebecca of the difference between her two establishments. \"Buvette is really a proper bar. There's no food. There's cheese and charcuterie and olives. It's just kind of a sleeker vibe.\" Whether it be a wine tasting event, visits from local winemakers, food pop-ups, burger nights or Taco Tuesdays where Rebecca makes the tacos herself, she seems to be embracing her new role wholeheartedly. She knows her wine."
    },
    {
      "source_id": "src_hoodline_2019",
      "publication": "Hoodline",
      "title": "New Sherman Oaks wine bar Buvette opens its doors",
      "url": "https://hoodline.com/2019/03/new-sherman-oaks-wine-bar-buvette-opens-its-doors/",
      "published_at": "2019-03-01",
      "trust_level": "editorial",
      "content": "A new wine bar has opened its doors in the neighborhood. Located at 15005 Ventura Blvd. in Sherman Oaks, the newcomer is called Buvette. This spot serves up reds, whites and sparkling rosé by the glass or bottle. Your drink selection is sure to pair well with the charcuterie and cheese board, which includes Gouda from Holland, prosciutto from Italy and salami from California. Try out the newest wine bar in Sherman Oaks."
    }
  ]
}