{
  "place_slug": "buvons-natural-wine-bar-shop",
  "sources": [
    {
      "source_id": "src_longbeachize_2025",
      "publication": "Longbeachize",
      "title": "Long Beach's Buvons officially opens French-meets-Californian restaurant space",
      "url": "https://longbeachize.com/articles/long-beachs-buvons-officially-opens-french-meets-californian-restaurant-space/",
      "published_at": "2025-03-08",
      "trust_level": "editorial",
      "content": "After a month of experimenting in the kitchen (while also hosting a stellar coffee popup), Buvons Wine Bar, the restaurant expansion from the neighboring Buvons Wine Shop, has opened under the watchful eye of owner and chef Alicia Kemper. With a sleek, French-meets-Californian menu that beautifully highlights the seasonal and vegetal, it is a reflection of a Long Beach small business owner with the resilience to move forward.\n\nHouse-made ricotta with various things from the garden at Buvons Wine Bar. There are seared scallops with celery root steamed with butter in a rondeaux before being drizzled with a yuzu-butter combination made from the scallop drippings in the pan. Seasonal cheese boards. Whole artichokes with \"seasonal dippins,\" the current ones being dijonnaise, a warm lemon butter, and an herb cashew dip. Classic mussels in a white wine broth. A play on carbonara featuring smoked eels. It's a California bistro expressing its French side's finest.\n\nThe selection at Buvons boasts of one of the city's best natural selections. Curated from the neighboring shop that has become a staple in the Zaferia district, Buvons Wine Bar's wine selection offers one of the finest arrays of natural wines in the city—from the funky to the more proper. \"Our house champagne comes from Jacques Lassaigne,\" said Luna Sallusti, Director of service and events. \"The Vignes des Montgueux—and we have this bottle because of the seven-year relationship Alicia has personally built with Jacques.\" It is but one example of a nearly 20-bottle list that spans whites, reds, roses, and oranges.\n\nTo watch Alicia, on one end, and Luna, on the other, is to see the pair come to life: Adding a food component to Buvons feels like \"the natural next step—it's the culmination of Alicia's 18 years in both the culinary and wine worlds,\" Luna said. And with that, Alicia echoes: \"By curating both our wine and food programs, I'm merging my passion for French natural wine with simple, thoughtful cuisine that complements it.\" And like Alicia building her relationship with wine makers and food lovers and Luna coming into the picture to offer her own expertise, Alicia's story is also about resilience. It is something definitively worth telling.\n\nLike many small business owners, Alicia has faced many uphill battles: Opening a natural wine bar might have brought in the younger drinkers—despite one's opinions on natural wine, one thing is clear: it helped introduce wine to Gen Z, which is a win no matter how it is diced—but an increase in drinking awareness amongst younger people paired with everyone spending less money has proven frustrating if not outright taxing. \"The past few months have been a real test and, admittedly, there were some moments when I genuinely thought about walking away. But then this space,\" Alicia said, gesturing to the adjacent space just south of Buvons, \"was meant for more. I have always believed that. But I also needed something that makes it my own. So I began by hand-sanding the benches.\" This isn't the only detail of the space that is hers. She painted the walls herself."
    },
    {
      "source_id": "src_lbbusinessjournal_2023",
      "publication": "Long Beach Business Journal",
      "title": "Buvons offers a vibrant venue to explore natural French wine in the Zaferia District",
      "url": "https://lbbusinessjournal.com/business/news/buvons-offers-a-vibrant-venue-to-explore-natural-french-wine-in-the-zaferia-district/",
      "published_at": "2023-02-04",
      "trust_level": "editorial",
      "content": "From The Hawk down to Alex's Bar, a stretch of the bustling Anaheim corridor has become home to some of the best watering holes to catch a live show or a glimpse of Long Beach subculture. Those familiar with the Zaferia District may have done a double take when Buvons Natural Wine Bar + Shop first opened a year ago. Aesthetically, the storefront resembles a place you might expect to see along Retro Row across town, or more on the nose, L.A.'s Silver Lake neighborhood. Just around the corner from Bamboo Club on Loma Avenue, Buvons offers something new: A vibrant, chic retreat with a spacious patio and plenty of intimate indoor seating to enjoy natural French wine paired with charcuterie boards and other hors d'oeuvres.\n\nDelbarry relocated from France to Long Beach to assist her old friend, Kemper, the soft-spoken visionary behind crafting Buvons and its sleek, art-minded atmosphere. \"We always kind of said, 'One day we work together,'\" Delbarry said while assembling a charcuterie board. \"We have a good relationship so it's easy. It's like we know what to do.\" Kemper, who started working in restaurants at the age of 14, said she's always had an affinity for small, family-owned vineyards and the story behind them. \"These are all small production, like families are making them or a husband and wife or a woman or you know just a guy and there's a lot that goes into making them, it's not like a big factory or mass-produced wine—there's a story behind all of them,\" Kemper said. For Kemper, French wine represents \"purity and authenticity and elegance.\"\n\nFor many, Buvons is still an unturned stone. While the Anaheim corridor has become an evening destination for those in pursuit of a craft cocktail or a night of merry-making, it lacks foot traffic comparable to somewhere like Belmont Shore, where each business is likely to attract passersby. \"Every day we have a customer that comes in and they're like, 'Oh we live down the street, we have not heard of the shop.' How is this possible?\" Delbarry laughs. Kemper moved to the Rose Park neighborhood after signing the lease on 1147 Loma Ave. From hosting regular DJ nights to wine classes, Kemper says she's been working to connect with people in her new home under the roof of her new business in Long Beach. \"After living in L.A. for more than 10 years, Long Beach is so much more community-driven,\" she said."
    },
    {
      "source_id": "src_decanter_2024",
      "publication": "Decanter",
      "title": "Los Angeles wine bars: A Decanter guide",
      "url": "https://www.decanter.com/wine-travel/los-angeles-wine-bars-a-decanter-guide-524362/",
      "published_at": "2024-06-04",
      "trust_level": "editorial",
      "content": "Founded in December 2021 by Alicia Kemper, Buvons focuses on small-production, natural and low-intervention wines. Kemper pours mainly French producers from the regions of Champagne, Jura, Burgundy, Loire and Savoie with a small selection of ciders and beers. Buvons attracts a mix of locals as well as wine drinkers willing to trek across town and traffic in search of her rare and allocated bottles. An outdoor garden and patio shared with sister project Mangette lets hungry patrons pair French café fare with crisp mountain whites made from Altesse and Jacquère."
    },
    {
      "source_id": "src_lbpost_2023",
      "publication": "Long Beach Post (Hi-Lo)",
      "title": "Buvons wine bar partners with Chef Philip Pretty of Heritage for special pop-up Aug. 10",
      "url": "https://lbpost.com/hi-lo/food/heritage-reservations-buvons-pop-up-philip-pretty/",
      "published_at": "2023-08-07",
      "trust_level": "editorial",
      "content": "Although Heritage reservations have been booked out for weeks, there's a chance to taste Chef Philip Pretty's Michelin-star-winning food at Buvons next Thursday, Aug. 10. Alicia Kemper, owner and wine director at Buvons Natural Wine Bar + Shop, and Pretty have known one another for a decade. Three months ago, Kemper did the wine pairings at Heritage for Pretty's tasting menu dinner, and now he's heading to Buvons. The pop-up will be in the garden, starting at 7 p.m. and going until Pretty sells out, but you'll want to come early and grab a spot as it'll be busy and there will be no reservations so it's first come, first serve.\n\nThe menu will include oysters topped with a Yuzu Kosho mignonette. Yuzu Kosho is a Japanese condiment made up of juice and zest from the yuzu citrus fruit with fermented chilis. A mignonette is a sauce that you've probably seen with oyster platters traditionally made with red wine vinegar and diced shallots. A Kanpachi crudo (raw Kanpachi, a yellowtail fish) with cucumber apple relish and cultured cream, a smoked wild salmon and its roe, and poached jumbo prawns with chili crisp and cilantro will also be available. Buvons will be offering a wine pairing for the menu, as well as by-the-glass purchases and a huge selection of bottles. There will be nonalcoholic options and beer as well. The shop has multiple pop-ups and collaborations in addition to the one with Pretty. On Fridays, the shop brings in a live local vinyl DJ or jazz artists. Saturdays have guest winemakers or a local business, and Sundays offer food collaborations with chefs."
    }
  ]
}