{
  "place_slug": "cafe-triste",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Cafe Triste - Review - Chinatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/cafe-triste-los-angeles",
      "published_at": "2023-12-14",
      "trust_level": "editorial",
      "content": "The perks of going to Cafe Triste are twofold: you get to drink eclectic natural wines, and you get to do it at neon-lit Mandarin Plaza in Chinatown. This bar from the team behind Psychic Wines has quickly become the \"it\" spot for 20-somethings, wine drinkers, and anyone who can pull off spray-painted jeans. On weekends, the sidewalk out front is a packed, see-and-be-seen scenario where people stand around with glasses of gamay till midnight.\n\nIf you'd rather grab a table, sit inside their moody, low-lit dining room, and look around at the paintings on the walls. You'll probably see a few people who regularly get paid to look bored in Eckhaus Latta ads doing the same thing. Whether you're a self-certified expert or don't quite know how liquid can be described as \"chewy,\" the staff will help you find something exciting and affordable on their condensed wine list.\n\nAs for the food, Cafe Triste mostly serves snack-sized items, and you may find that aggravating until you try a few—they'll remind you why you still bother with small plates. The rotating menu leans into the kind of stuff you'd expect to find on a gourmet charcuterie board, and there's usually some kind of tartare on the menu. Get it. It might arrive in a pool of deep-green olive oil, or it might come topped with thinly sliced cucumber that, somehow, you're excited to eat. Pair that with some gouda and a bottle of Pinot Gris, and this place becomes one of the best spots to hang out in Chinatown, full stop.\n\nHiding under slices of cucumber is the antidote to the boring crudos currently haunting LA menus: The sheet of raw tuna has a kick of spice from green harissa, mellowed out by a bed of buttery olive oil. Use the free table bread to mop up any remaining sauce.\n\nCafe Triste changes their cheese selection often (and lists them all on a mirror above the bar). But your server will pair whatever's in stock that week with the wine on your table, which might mean a plate of comte to pair with your riesling or funky blue cheese to cut through the acidity of your grenache.\n\nNothing too wild happening here. Just some ribbons of cured meat to have on the table alongside the bread and cheese. At $14, it's not quite worth it.\n\nThis is the kind of lovely dinner party dish you'd expect to eat at Gwenyth Paltrow's pied-à-terre. And we mean that in a good way. The combination of tart plum and refreshing pear juice dances around in your mouth long after the last bite.\n\nThis is a party grab bag of dish: shelling beans, creamy farmer's cheese, tomatoes, and chopped bell peppers, covered in a few fistfuls of fresh herbs.\n\nWith this dish alone, the pastry chef at Cafe Triste could open a brand new baking business that we'd support on a weekly basis. It's mildly sweet, slightly sticky, and covered with a soft whipped cream so fresh it melts down the plate within minutes of arrival."
    },
    {
      "source_id": "src_timeout_la_2023",
      "publication": "Time Out LA",
      "title": "Cafe Triste | Bars in Chinatown, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/cafe-triste",
      "published_at": "2023-04-04",
      "trust_level": "editorial",
      "content": "From the team behind Silverlake's Psychic Wines, Cafe Triste is an equally buzzy sister wine bar with plenty of natural wines, beautifully plated bites and gorgeous floral arrangements."
    },
    {
      "source_id": "src_resy_2025",
      "publication": "Resy Blog",
      "title": "Cafe Triste Defines a New Generation of Cool",
      "url": "https://blog.resy.com/2025/09/cafe-triste/",
      "published_at": "2025-09-17",
      "trust_level": "editorial",
      "content": "I'm sitting at Cafe Triste on a recent night. A Parisian-style cave à manger in Chinatown. The type of place that's rare in L.A. I'm solo at the bar. Above me, the shelving is mirror-lined and packed with tchotchkes mostly hidden from diners, except when viewed from across the bar. In between sips of white Cheverny, I'm hitting \"tap to Shazam\" for every song that comes on the speakers (\"Be Mine\" by Qendresa; \"Snoopy\" by Loukeman). Around me, groups of people are wandering in, each more stylish than the last. I spot a pleather jacket. A designer handbag. Jeans made out of a patchwork of different denim swatches all stitched together.\n\nThis scene is different than the L.A. dining I'm used to. It's looser, freer; like the flow of the city is coursing directly through the dining room itself. And because of that, it feels more vibrant than many other restaurants here, with their dining rooms that insulate guests from the outside world. It's clear that Cafe Triste is at the center of something— an embodiment of East side cool, of our proclivity toward flexible, drink-adjacent dining in the wake of the pandemic, of things done a new way by a younger generation. It is here that on any given weekend night, throngs of people spill out from the dining room onto the sidewalk, and visitors from as far away as New York and Paris stop by for a round.\n\nThat's exactly what owners Quinn Kimsey-White and Zach Jarrett wanted when they opened Cafe Triste in late 2022. The pair had been running Psychic Wines in Silver Lake for some years as a bottle shop. Permitting and red tape kept the location as purely retail, rather than their dream of a wine bar. When a space presented itself in Chinatown, Kimsey-White and Jarrett jumped. As Kimsey-White told me on a recent visit: \"It allowed us to fully contextualize the wines in a way that we weren't able to in the store.\"\n\nBut that context is never overly serious or stuffy. In fact, Cafe Triste has created an environment that allows diners to \"occupy the space really freely — you can have whatever experience you want in here,\" Kimsey-White continued. That is mostly true of many other restaurants, of course, yet Triste is exactly the kind of space at which you can dress up or dress down.\n\nStill, food and wine are the heart of the operation. And the team has used their skills and taste to push Cafe Triste into the unexpected. As Kimsey-White notes, he worried that Triste occupies a space Angelenos are unaccustomed to — not quite a pure wine bar, nor fully a restaurant. It took diners a few months to figure the concept out, he explains, but once they did, \"it became clear that they were just along for the ride. At that point we decided, 'Okay, why don't we keep it fast and loose with the wine service, and try and raise the bar as far as what the kitchen is putting out?'\"\n\nWhat the kitchen is putting out is dictated by chef Hannah Chumley. And though it's a small menu, it's confident, playful, and fits whatever your mood. Looking for a small bite? Have a cheese plate or the house marinated olives. Looking for a proper dinner?\n\nWhat draws people to Cafe Triste night after night is this blend of the familiar and the unexpected. The Art Crowd alongside the parents in from out of town; the lawyers from nearby courts pressed up against the recent graduates; the soulful bowl of lentils alongside the less-expected combination of citrus wedges and shrimp. Here, you can have both, have it all. So am I cool enough to be a part of this? Who knows, but I suspect what really matters is if you can appreciate the various elements at play here, and can take in the whole of the scene for what it is: excellent, and wholly L.A."
    },
    {
      "source_id": "src_subsequence_2024",
      "publication": "Subsequence Magazine",
      "title": "Café Triste",
      "url": "https://subsequence.tv/topics_stories/cuisine/3422/",
      "published_at": "2024-02-09",
      "trust_level": "editorial",
      "content": "If you're looking for a slice of Paris in Los Angeles, look no further than Chinatown. At Café Triste, the wine flows throughout the night and the crowd spills onto the sidewalk, and it feels as much like a trendy cave in Canal St.\n\nCafé Triste is the brainchild of the team behind Silver Lake wine shop Psychic Wines, and the same personality, wine-wise, distinguishes the list. The wines are often crispy or spiky or energizing or supremely juicy or biodynamic or from dry-farmed vines or from an overlooked parcel on the edge of the Rhone―or many or all of these things―no single quality is exclusive of another. Illuminated shelving by the door holds bottles such as Sebastian Morin's slightly fizzy Beaujolais and notoriously experimental Philippe Jambon's deep-orange blend of two Chardonnay vintages. Remarkably, there is no kitchen and yet the chef can conjure seasonal dishes that change weekly. Recently, spring fava puree smeared on toast with tinned mussels and slivers of Parmigiano Reggiano; pink folds of mortadella; Little Gem lettuces in a punchy ranch dressing of crème fraiche and lots of dill."
    }
  ]
}