{
  "place_slug": "camelia",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "The Tsubaki team does French-Japanese with sophistication at Camélia - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/camelia",
      "published_at": "2025-07-15",
      "trust_level": "editorial",
      "content": "You sense it the second you see the place. This gorgeous French-Japanese bistro from the Tsubaki people knows exactly who it is, which is refreshing in a city notorious for superficiality.\n\nDishes register as French but have Japanese inflections tucked within. They can be as subtle as oysters with a ponzu mignonette or as creative as koji-marinated roasted chicken in a pool of salty, seaweed-infused cream. Whether these spins jump out to you or not, they'll leave you dreading the end of a genre-blurring meal.\n\nAnother umeshu martini? Sure—you need more time to yap with your dinner date and marvel at Camélia's juicy chicken. Just know that partaking in such cosmopolitan pleasures can get pricey. Save this Arts District bistro for a special occasion when eating well is a top priority, or any night with room in the budget for a little glamour.\n\nIf we could, we'd bounce on these buttered rolls like a trampoline. They're squishy, soft, warm, and a little nutty from the black sesame. The softened French butter on the side tastes even better if you pay extra for salty house-cured ikura."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Camélia | Restaurants in Downtown Arts District, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/camelia",
      "published_at": "2025-03-01",
      "trust_level": "editorial",
      "content": "Wood panels and handsome leather booths have given the former Church & State (and short-lived Caboco) space a distinctly polished, brasserie feel, and the eight-seat bar is already drawing in local residents pairing their wine or sake with Camélia's outstanding dry-aged burger.\n\nIn the dining room, hearty, comforting dishes like Japanese-style spaghetti bolognese and croque madame made with ham katsu and milk bread deftly skirt the lines between culinary genres. Who knew shiso and ponzu jelly could pair so well with burrata?\n\nSave room for dessert; there's an excellent pudding topped with fruit, whipped cream and crunchy buckwheat, but you'd be equally pleased with the soufflé tart or huckleberry clafoutis."
    },
    {
      "source_id": "src_latimes_2024",
      "publication": "LA Times",
      "title": "French-Japanese bistro Camélia, from Tsubaki and Ototo team, opens in Arts District",
      "url": "https://www.latimes.com/food/story/2024-07-31/carnal-highland-park-camelia-downtown-la-taco-bell-cantina-ggiata",
      "published_at": "2024-07-31",
      "trust_level": "editorial",
      "content": "James Beard Award-winning restaurateurs have opened a bistro they'd long dreamed of, combining French and Japanese flavors at Camélia in the Arts District in downtown Los Angeles.\n\nNamba and Kaplan, who met while both were working at Japanese brasserie En in New York City, had always imagined they would open a French restaurant. During the pandemic, with their restaurant and their sake bar shuttered, they began to question what could be next for them — both in seriousness and as a lark.\n\n\"I thought it was pretty likely that Tsubaki and Ototo would not survive the pandemic,\" Kaplan said. \"It was sort of like, 'Oh, I'll probably never open a restaurant ever again,' but there was something fun about fantasizing, like, 'Oh, if we ever were to do this again, what would we want to do?' [We had] a bunch of ideas, but kept coming back to this idea of a French-Japanese restaurant.\" When they learned the former home of Church & State and Caboco was available, they were daunted by its size, larger than their Echo Park spaces, but emboldened by its history.\n\nKevin Nguyen, formerly of Death & Co., developed a bar program of classic cocktails using French and Japanese spirits and flavor profiles. A Japanese whiskey highball gets a splash of French peach aperitif along with shiso; the milk punch involves shochu and matcha; and the Decibel martini, inspired by the lychee version served at a New York City bar where Kaplan worked years ago, also incorporates absinthe and umeshu. Kaplan oversees the wine and sake. Much like at Ototo, wines and sakes at Camélia are grouped not necessarily by what they're made from but by the way they drink, the stories behind them or their regionality."
    },
    {
      "source_id": "src_timeout_la_2024",
      "publication": "Time Out LA",
      "title": "L.A.'s Best New Restaurants of 2024",
      "url": "https://www.timeout.com/los-angeles/restaurants/the-10-best-new-l-a-restaurants-of-2024",
      "published_at": "2024-12-11",
      "trust_level": "editorial",
      "content": "I can't tell you how many times I've walked out of somewhere new after spending over $300 for two, only to wish I'd spent that money at a more tried-and-true upscale spot. Which is why it's such a joy to visit—and, if your budget allows, revisit—Camélia, a polished Japanese-inflected bistro in the Arts District. Opened in: July."
    }
  ]
}