{
  "place_slug": "carnitas-el-momo",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The original Carnitas El Momo is still a pork lover's dream",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/carnitas-el-momo",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "If you love tender, slow-cooked carnitas as much as we do, then there's a good chance you'll agree that no one does it better than Carnitas El Momo. This Boyle Heights truck has now expanded with a brick-and-mortar location in Monterey Park, but both spots greet you with the same smells of bubbling cauldrons of carnitas. However, instead of toil and trouble, El Momo serves slowly braised pork cooked in lard and a secret spice blend of contrasting flavors, including the deep sweetness of brown sugar that caramelizes the large chunks of meat to create all kinds of textures. Pork belly, pork shoulder, and pork skin are all on the menu, but the move is to order all three. The gelatinous, chewy skin plays perfectly with the shoulder and fatty belly that come dripping with juice. The second best thing about El Momo, besides their bubbling cauldrons of magical carnitas, is the fact that you never have to choose between their meat options because you can get all three at once. Their taco mixta is one of the best ways to do so, with the pork belly, crackly skin, and pork shoulder each bringing a special something to the tortilla. Make sure to spoon on some salsa roja for a smoky kick that'll round out the pork overload. After years of operating from a taco truck, Carnitas El Momo—home to our favorite carnitas in LA—just opened a casual counter-service restaurant in Monterey Park (look for the freshly painted pig murals on the side of the building). They've added some items to the menu, including a torta ahogada drowned in spicy chile sauce, mulitas and quesadillas with crispy cheese skirts, and a weekends-only goat birria. But even with all that newness, you should still focus on the classic Michoacan-style carnitas tacos, which are so obscenely rich they need little embellishment beyond a dab of salsa verde and some pickled jalapenos. Pick your cut (shoulder, belly, skin, burnt ends, or mixed \"Aporkalypse\" style) and watch them pile chopped bits of fat-simmered pork onto warm tortillas, then try not to drip any of those precious pig juices on your shirt."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Carnitas El Momo",
      "url": "https://www.timeout.com/los-angeles/restaurants/carnitas-el-momo",
      "published_at": "2025-05-31",
      "trust_level": "editorial",
      "content": "Since 2015, Juan \"Billy\" Acosta has drawn braised pork lovers from across Los Angeles with his tender, oh-so-juicy carnitas, originally served out of Boyle Heights trailer but now available at Carnitas El Momo's Monterey Park brick-and-mortar. The best Michoacan-style carnitas in all of Los Angeles. While you can order them by the taco ($4), the commercially made tortillas aren't the only delivery method for some of the best carnitas in the city; you can also order it by the pound, sandwiched in a cheesy mulita or tucked into a hefty torta. Choose from carne (shoulder), buche (belly) and cuero (skin), a slightly gelatinous, ultra-fatty cut, but we suggest ordering a mix of all three for best results. This is one of the hands-down best spots in town to pig out on pig."
    },
    {
      "source_id": "src_foodgps_2023",
      "publication": "Food GPS",
      "title": "Carnitas El Momo Ribs",
      "url": "https://foodgps.com/dose-of-vitamin-p-carnitas-el-momo-ribs/",
      "published_at": "2023-12-16",
      "trust_level": "editorial",
      "content": "Momo hails from Salamanca, Guanajuato, where his father, Felix, started serving Sunday carnitas out of his Mercado Tomasa Esteves butcher shop. He's personally been cooking pig parts in a copper cazo for 53 years. Momo's meat is brown since he infuses the molten manteca with either brown sugar or Coca-Cola, traditional flavor agents. Still, the meat stays tender, especially the tongue and ribs. Steaming corn tortillas and accompanying condiments are fairly straight forward: spicy salsa roja, less spicy and even tangier salsa verde, minced onions and cilantro, and still tangier vegetables like jalapeno, onion and carrot en escabeche. These weekend carnitas are well worth seeking, even if you can't typically find offal on-board the truck or stand. Hours: Saturday and Sunday, 9 a.m. – 3 p.m. The truck also runs on Friday nights at the corner of Soto Street & Fairmount Street in Boyle Heights. The stand operates at the corner of S. Avalon Boulevard & E. 61 Street."
    }
  ]
}