{
  "place_slug": "carnitas-los-gabrieles",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "LA's best carnitas come from Los Gabrieles - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/carnitas-los-gabrieles",
      "published_at": "2025-11-25",
      "trust_level": "editorial",
      "content": "Los Gabrieles is a street stand in Downtown's Piñata District that makes LA's best carnitas.\n\nWander through Downtown's Piñata District and you might walk away with a year's supply of Pulparindos and a mug that says, \"I LOVE MY TOXIC GIRLFRIEND.\" But the best thing money can buy on this stretch of Olympic Boulevard is inside Los Gabrieles' bubbling cauldron. This women-owned taco stand—a rare sight in LA's dude-dominated taquero scene—makes the best carnitas in Los Angeles.\n\nAnd if you somehow manage to miss the giant red sign from the street, the smell of caramelized pork will wash over you like a wave at the beach. The vat of melted fat that Los Gabrieles fries its Michoacan-style carnitas in is infused with so many aromatics that it's murkier than the La Brea Tar Pits, yet every bronzed cut pulled from the hot lard glistens like a piggy pearl. Skin, snout, ribs, and braised shoulder are all mercilessly chopped with a cleaver and tossed on the hot plancha to crisp, while large corn tortillas are pressed to order to act as swaddling blankets for fried pork.\n\nIn a matter of minutes, you're handed a plate of piled-high tacos, which you can brighten with the limes, pickled onions, and salsa verde placed on every table. It's a quick, straightforward moment of carnitas-induced bliss, but show up early if you want the prized cuts like ears and snout.\n\nOpen from 8:30 am to 4pm, we've found that Los Gabrieles tend to sell out of everything except their mixta (a.k.a., a hodgepodge of various bits) by 1pm. Don't let that disappoint you, though, because their taco mixta is still...\n\nFor something submerged in hot fat for hours, Los Gabriele's carnitas are rich but surprisingly not heavy. You can taste the salt and warm spices seasoning the pork, and the fatty bits shine with a spritz of lime and splatter of salsa verde.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_theinfatuation_2022",
      "publication": "The Infatuation",
      "title": "The 25 Best Tacos In Los Angeles, Ranked",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-tacos-in-los-angeles",
      "published_at": "2022-01-21",
      "trust_level": "editorial",
      "content": "Downtown's Piñata District is home to many treasures—bulk-sized fireworks, twenty-pound bags of Duvalín, pots large enough to double as hot tubs—but nothing comes close to a fresh batch of carnitas from Los Gabrieles. With one cauldron, a few tarps, and a handful of tables, this sidewalk operation prepares the best Michoacan-style fried porks in LA. Every cut of pig pulled from the murky, aromatic bath of hot lard emerges rich and juicy but never heavy, before being mercilessly chopped to bits and piled onto a fresh corn tortilla. The carnitas here are so well seasoned, we're happy eating porky chunks like popcorn, but they're even better brightened with a lime squeeze and some tart salsa verde."
    }
  ]
}