{
  "place_slug": "coniseafood",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Coni'Seafood - Review - Inglewood",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/coniseafood",
      "published_at": "2024-09-10",
      "trust_level": "editorial",
      "content": "Located in south Inglewood, Coni'Seafood might take a bit of a drive to get to. But if you're ready to have your mind blown by some of the best Mexican seafood in Los Angeles, get in your car now and go.\n\nCome here on a lazy Saturday afternoon when you're tired of your same old brunch spot or during a \"sick\" day when you're actually just showing your friend around town before dropping them off at the airport.\n\nMexican seafood might not be the first thing you start craving every night, but after one visit to Coni'Seafood, you realize quickly how much you've been missing.\n\nThis baby comes free with chips the second you sit down and it is no joke. Made with serrano chiles, it's got a kick that will linger - and you want that while eating seafood. This is definitely one of the best house salsas in LA, and that statement should not be taken lightly.\n\nLight and simple with just a little cheese, these guys are phenomenal and worth the drive alone.\n\nA mountain of raw diced shrimp mixed with lemon juice, cucumber, cilantro, tomato, and onion. It's simple, but the quality of the shrimp itself makes it a must-order for the table.\n\nYou'll see quickly that Coni'Seafood has all sorts of cooked shrimp dishes that vary only by their seasonings. While it's hard to go wrong with any of them, our move is the mojo de ajo, which is essentially just butter and garlic. It's a nice break from the other, more citrusy dishes.\n\nThis is Coni'Seafood's piece de resistance and rightfully so. There's a reason you've probably never heard of snook before (let alone seen it on a menu), and that's because (according to our waiter), it's extremely difficult to make. Good news: the Coni'Seafood crew has figured it out. It's salty, flaky perfection and the triple-spicy guacamole served on the side is outrageous.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for.\n\nEl Compadre is an old-school Mexican restaurant in Hollywood that's one of the best and most consistent parties in town."
    },
    {
      "source_id": "src_theinfatuation_2024_mariscos",
      "publication": "The Infatuation",
      "title": "The Best Mariscos Restaurants in LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-mariscos-restaurants-in-la",
      "published_at": "2024-10-14",
      "trust_level": "editorial",
      "content": "If someone were to plan a bus tour of LA mariscos spots (sign us up), Coni'Seafood would be a mandatory stop. This Inglewood establishment is rightfully famous—the family behind it has been serving some of the best Nayarit-style seafood in town for decades. As soon as you arrive, order the signature whole snook (it takes a solid half-hour to prepare) marinated in a salty, umami-rich sauce and grilled to perfection."
    },
    {
      "source_id": "src_theinfatuation_2021_tostadas",
      "publication": "The Infatuation",
      "title": "The Best Seafood Tostadas In LA",
      "url": "https://fast.theinfatuation.com/los-angeles/guides/best-seafood-ceviche-tostadas-los-angeles",
      "published_at": "2021-07-20",
      "trust_level": "editorial",
      "content": "Coni'Seafood in Inglewood (with a second location in Del Rey) is a neighborhood institution that's been serving Nayarit-style seafood since 1987. This mariscos spot is particularly famous for its whole grilled snook that comes generously marinated in their salty house sauce, as well as with warm tortillas and caramelized onions served on the side. But our favorite thing here is their mighty tostaditos platter. It consists of five mini tostadas generously smeared with savory marlin paté before getting topped with shrimp and octopus ceviche. The marlin's deep smokiness is perfectly cut by the ceviche's citrus, and the whole dish is frankly like a gourmet version of those StarKist tuna salad crackers you may have been sent to school with as a kid. The only downside is that they're more like \"bites,\" and you're only given five, so share at your own discretion."
    },
    {
      "source_id": "src_timeout_2024",
      "publication": "Time Out LA",
      "title": "Coni'Seafood Marina del Rey",
      "url": "https://www.timeout.com/los-angeles/restaurants/coniseafood-culver-city",
      "published_at": "2025-09-09",
      "trust_level": "editorial",
      "content": "Anything east of LAX doesn't exactly scream seafood, but Coni'Seafood's Cossio family turned Inglewood into an oceanic dining destination before expanding the operation to Marina Del Rey—where it's still holding its own, even right by the water. The lean menu of Nayarit-cuisine hits includes popular smoked marlin tacos, more than a dozen shrimp dishes, from raw to deep-fried, and more elaborate specialties such as the beloved (and so-photogenic) pescado zarandeado—butterflied snook fish that's marinated in soy sauce and grilled to savory perfection over charcoal. The chicharrones de pescado involve crispy, pan-fried tilapia chunks with tangy soy and lemon sauce, while another standout dish stars sweet langoustines—bathed in garlic, chilies and lemon juice—and, if you're lucky, prized roe. My favorite shrimp preparation on the menu is the camerones borrachos: a medium-spicy tequila sauce peppered with garlic, cilantro and crushed pepper chilies."
    },
    {
      "source_id": "src_timeout_2024_bestseafood",
      "publication": "Time Out LA",
      "title": "24 Best Seafood Restaurants in Los Angeles For Oysters and More",
      "url": "https://www.timeout.com/los-angeles/restaurants/best-seafood-restaurants-in-los-angeles",
      "published_at": "2024-11-15",
      "trust_level": "editorial",
      "content": "The vast expanse east of LAX doesn't exactly scream \"seafood destination,\" but Coni'Seafood turned Inglewood into an oceanic dining hotspot—and from there, it was L.A. seafood domination, baby. Such is the power of this Nayarit-style fish specialist (with a second Westside location near Culver City) that offers a tight menu of smoked marlin tacos, more than a dozen shrimp dishes from raw to deep-fried, and more elaborate house specialties like pescado zarandeado: butterflied snook fish that's marinated in soy sauce and grilled to savory perfection over charcoal. Chicharrones de pescado involves crispy, pan-fried tilapia chunks with tangy soy and lemon sauce, while another standout dish stars sweet langoustines—bathed in garlic, chilies and lemon juice—and, if you're lucky, prized roe."
    },
    {
      "source_id": "src_foodgps_2023",
      "publication": "Food GPS",
      "title": "Coni'Seafood: Showcasing Mexican Seafood in Inglewood",
      "url": "https://foodgps.com/coni-seafood-inglewood/",
      "published_at": "2023-11-17",
      "trust_level": "editorial",
      "content": "Coni'Seafood is an Inglewood restaurant from Nayarit native Connie Cossio. Sinaloa born chef Sergio Penuelas serves dishes from both states. The Cossio family saga seemingly has more twists and turns than a Southern Gothic novel, and it's probably best to leave plot analysis to my friend Bill Esparza of Street Gourmet LA, who turned me on to the cooking of Sinaloa born chef Sergio Penuelas in the first place. I enjoyed his cooking at Mariscos Chente, and he later left to join Nayarit native Connie Cossio at her father Vincente's former Inglewood home, which dates to 1991. In 2012, she changed the name to Coni'Seafood and upgraded the decor, but the food's just as good. The dining room features mottled grey walls, decorative metal fish and dividers that resemble aquariums, complete with smooth black stones, starfish and seashells. A big back patio touts a tapered roof and mural touting Mariscos Estilo Nayarit. The thick corn tortilla chips didn't need refurbishing, and they still come with a molcajete of spicy salsa, a green slurry of sweet-tart jalapeno and lemon juice.\n\nConi'Seafood has several raw seafood preparations, perhaps none better than Aguachile ($12). Penuelas marinates shrimp in lemon and lime juice and slathers them in spicy, jalapeño-centric green sauce. Red onion and sliced cucumber provide textural contrast. Sometimes, the shrimp are firmer than others. The firmer, the better. Note the antenna on the bug-eyed shrimp, which resemble long strands of saffron. Langostinos ($20) consist of \"baby lobsters\" that Penuelas splits and serves with a savory, spice-tinged sauce crafted from garlic, red pepper, lemon juice, and langoustine debris. Pull the sweet meat from the shells and spoon sauce over vegetable-studded white rice. The Coni'Seafood piece de resistance is undoubtedly Pescado Zarandeado ($22 por kilo), a butterflied and chargrilled snook that's seasoned with salt and marinated in a \"house sauce\" that includes soy sauce spices and mayo. There are Mexican restaurants with larger menus in Los Angeles, in more contemporary settings, but that's kind of the charm of Coni'Seafood: quality and focus, minus the fuss."
    },
    {
      "source_id": "src_foodgps_2023_langostinos",
      "publication": "Food GPS",
      "title": "Coni'Seafood Langostinos",
      "url": "https://foodgps.com/food-of-the-week-coni-seafood-langostinos/",
      "published_at": "2023-12-15",
      "trust_level": "editorial",
      "content": "Coni'Seafood, owner Connie Cossio and chef Sergio Penuelas prove they've got more than just pescado zarandeado with landmark langostinos in Inglewood. One of the distinguishing dishes at Coni'Seafood is the pescado zarandeado, a massive butterflied snook that's marinated and grilled. Most tables attempt to tame Sinaloa-born chef Sergio Penuelas' flaky sea beast. However, there are many fish (and shellfish) in the sea, and Connie Cossio's seafood-centric restaurant in Inglewood celebrates more than just snook. For instance, Chef Penuelas has also managed to master Langostinos ($20). The menu calls these creatures \"baby lobsters,\" and that's basically the case. Chef Penuelas splits the orange shells and plates the antennae-clad, curly-tailed creatures in a pool of savory, spice-tinged sauce crafted from garlic, red pepper, lemon juice, langoustine debris, and the occasional lango roe. The sweet meat, which pulls easily from the shell, pairs well with heaping spoonfuls of sauce and a dome of vegetable flecked white rice, which accompanies the meal."
    }
  ]
}