{
  "place_slug": "coucou",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Coucou - Review - Venice - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/coucou",
      "published_at": "2025-04-16",
      "trust_level": "editorial",
      "content": "You might've met Coucou in its previous life as Chez Tex, a barebones wine bar that served simple classics like roast chicken and a solid cheeseburger. Under its new name, this Venice spot hasn't changed much. It's owned by the same people, the exposed brick remains intact, and the warm staff turns the sparse room into a lively, rosé-guzzling scene on Main Street. The ambiance (and great drinks) makes it a buzzy dinner option for when being \"out and about\" is the night's top priority—except the food here is pretty solid, too.\n\nThere's been a big shift in this restaurant's personality, though: whereas Chez Tex was vaguely French, Coucou fully leans in with a bistro-fied menu and art-covered walls that belong in a Parisian apartment. But much like a backpacker who spends a month in France and comes back pronouncing \"croissant\" with an accent, this restaurant can't shake its Americanisms.\n\nCoucou sets up a handful of tables on the sidewalk, but to soak up this wine bar's bon vivant energy, you'll want to get a table inside (the bar is open for walk-ins, but plan to wait). Once you're in, whatever plans you had for a chilled Westside date night will get turned up a few notches with an electro-pop soundtrack, great martinis, and good-enough food.\n\nIf you listed off the qualities of a great bar snack, it would sound like this dish. There's a nice salty bite from the olives, the fried batter is super light and crackly, and they give you a nice, funky preserved lemon aioli for dipping.\n\nThese fried balls are delicious, but so rich with goat cheese they'll glue your tongue to the roof of your mouth (don't try to have a conversation while eating them). The honey drizzled over the top and cured olive spread on the side make for a nice sweet-salty combo.\n\nRating: Pretty Good: You'll likely be satisfied by a meal here, especially for a specific situation. These are handy back-up restaurants and beloved local spots."
    },
    {
      "source_id": "src_theinfatuation_2025_weho",
      "publication": "The Infatuation",
      "title": "Coucou Weho - Review - West Hollywood - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/coucou-west-hollywood",
      "published_at": "2025-07-23",
      "trust_level": "editorial",
      "content": "Despite the numerous comedy theaters and live music venues in West Hollywood, good spots for drinks and snacks before seeing a show are limited. Coucou fills that void. This French-ish bistro—the original location is in Venice—has a breezy, indoor-outdoor space that's well-suited for downing martinis and watching the sunset. And while you could come here for a full meal, we recommend snacking on well-done small plates like fried olives, shrimp cocktail, and beef tartare instead. From there, take the party elsewhere: The Troubadour, Dan Tana's, and all the bars on Santa Monica Boulevard are within stumbling, er, strolling distance.\n\nUnrated: This is a restaurant we want to re-visit before rating, or it's a coffee shop, bar, or dessert shop. We only rate spots where you can eat a full meal."
    },
    {
      "source_id": "src_timeout_2024",
      "publication": "Time Out LA",
      "title": "Coucou West Hollywood | Restaurants in West Hollywood, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/coucou-west-hollywood",
      "published_at": "2024-06-22",
      "trust_level": "editorial",
      "content": "If not for the charming, well-heated patio and decent hors d'oeuvres, we wouldn't necessarily give this new West Hollywood bistro our stamp of approval. That being said, the second location of this Venice cocktail joint fills a solid niche within the upscale neighborhood—a stylish date night spot with excellent drinks, decent, not-too-expensive bar bites and weekend brunch service. It all makes for an easy slide from drinks into dinner at Coucou, where Bouchon Vegas alum Jacob Wetherington offers a cheese-covered \"l'haute\" dog, a vegan-friendly French dip made with king oyster mushrooms and a straightforward steak tartare that gets the job done. Our suggestion? Skip the mains, go all in on appetizers and order Coucou's popular soft-serve for dessert—it comes with a delicious housemade chocolate magic shell."
    },
    {
      "source_id": "src_timeout_2023",
      "publication": "Time Out LA",
      "title": "Coucou | Bars in Venice, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/coucou",
      "published_at": "2023-04-04",
      "trust_level": "editorial",
      "content": "A brand-new all-glass bar and an overhauled dinner menu have given the former Chez Tex space a touch of modern French sophistication, but it's the cocktails and aperitifs that make this Venice Beach cocktail bar—billed by the owners as a Westside counterpart to Eagle Rock's Capri Club—a compelling drinking, not dining, destination. The reinterpreted bar bites, including an enormous \"l'haute dog\" made with Pead & Barnetts sausage and caviar service, make for decent booze-adjacent eats, but they're not worth going out of the way for. Instead, head here for polished French standards like kir royale and refined house specialties that add unique twists to the classics. Just note this isn't a late-night watering hole: On weekends, the bar closes at a fairly early 10:30pm."
    }
  ]
}