{
  "place_slug": "destroyer",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Destroyer is a classic LA brunch spot with unexpected twists - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/destroyer",
      "published_at": "2025-11-07",
      "trust_level": "editorial",
      "content": "Destroyer is a cafe in Culver City with very good, never-boring brunch food. There's a pocket of Culver City filled with white office buildings, reflective glass, and people who drink Soylent. At first glance, Destroyer fits right into this corporate rendition of Pleasantville. The iconic daytime spot (from the team behind Vespertine) looks like the lobby cafe of a tech campus, with a patio that's perfect for hosting a team sync. And like its sister restaurant, Destroyer is serving some of the most creative food in the city—just inside what might be one of the most boring backdrops imaginable. At its core, Destroyer is the epitome of the classic, easygoing LA brunch spot. The patio stays peaceful, full of unbothered people sipping on lattes, with the only real background noise being fork scrapes and laptop fans, and nothing much to look at beyond a row of Teslas outside. Destroyer's bold personality comes from the food. Sure, it's delicious, but also surprisingly comforting considering how fine dining-y the plating is. The menu lists the usual suspects, like \"waffle\" or \"french toast\", but what shows up looks nothing like what you'd expect. French toast turns out to be a giant glossy slab of sourdough with a custardy center. Some of the more experimental dishes, like the too-rich beef tartare covered by a mountain of potato chips, are more fun to talk about with your table mates than eat. But that balance of weird and familiar is what makes Destroyer special. It's serving food with an element of surprise, while still feeling as laid-back as a weekday brunch place should. This entire thing is one massive slab of toasted sourdough. The bread is nicely buttered on the with a custardy center, and you're responsible for constructing each bite using the sides of fig, fig jam, crème fraîche, and maple syrup. You might lose steam halfway through, so plan to share when you want something sweet. The waffle is actually the least memorable part of this dish. It's chewy and doesn't have much sweet potato flavor. But the little piles of prosciutto, braised kale, and shredded gruyère turn the dish into more of a comforting casserole. We've had smoked fish at brunch many times, but never like this. It comes as a dill-heavy yogurt parfait topped with onion granola. It's one of the most creative (and unusual) things here, but the intense briny flavor is overwhelming after a few bites. Truly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Destroyer | Restaurants in Culver City, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/destroyer",
      "published_at": "2025-03-11",
      "trust_level": "editorial",
      "content": "No detail goes unaccounted for at Destroyer, where otherworldly presentation and high-quality ingredients combine for the most aesthetically pleasing (and delicious) brunch menu in town. Helmed by Jordan Kahn, the same critically acclaimed chef behind still-closed Vespertine, the pricey, counter service-style daytime café never fails to draw a crowd on late weekend mornings, so be prepared to wait for a seat to eat your strikingly plated food—and to jockey for the limited street parking in the area. Those who have the time and patience, however, will be treated to the joys of unearthing a bite of beef tartare from underneath a tangle of microgreens or digging into Destroyer's luscious avocado confit—a fine dining-esque experience without the sky-high prices."
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Destroyer – Culver City - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/culver-city/restaurant/destroyer",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "The architecturally intriguing Hayden Tract district is the perfect backdrop for Jordan Kahn's adventurous Destroyer, located just across the street from sister restaurant, Vespertine. The minimalist interior keeps your attention on the food, where each plate is a complex composition of flavors that are bound to delight and surprise. Begin with such harmonious starters as avocado confit, a half avocado dusted with their onion ash and served with confit tomatoes and dressed arugula that is simple but impressive. Koshikari rice porridge delivers depth and a riot of textures, while the milk chocolate crémeux finished with almond streusel, praline and a dusting of frozen cucumber cream is a striking closer."
    }
  ]
}