{
  "place_slug": "el-chucho",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "El Chucho - Review - Mar Vista - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/el-chucho-mar-vista-los-angeles",
      "published_at": "2023-07-13",
      "trust_level": "editorial",
      "content": "Drinking Great Wine\n\nAmidst the protected bike lanes, baby strollers, and other telltale signs of gentrification on the stretch of Venice Blvd between Mar Vista and Venice, El Chucho stands out as being pretty cool. The space (formerly La Potranca) had been a neighborhood dive for years, serving cheap beer and screening soccer games for Spanish speakers looking to stop somewhere before heading home from work. The new owners have kept the pool table, soccer games, crass posters, and cheap beer. And they've also added natural wine and vinyl DJ sets.\n\nEl Chucho is a total scene on weekends (in case you need to wait in a line to feel something). On weeknights, it's a tame spot for a catch up.\n\nUnrated: This is a restaurant we want to re-visit before rating, or it's a coffee shop, bar, or dessert shop. We only rate spots where you can eat a full meal.\n\nOffhand Wine Bar is the only natural wine place in Santa Monica where you can groove to vinyl DJ sets. Bar Bandini is an Echo Park wine and beer bar that's actually not a snooze. Cafe Triste is a wine bar that doubles as a clubhouse for people who \"know the DJ.\" It's the perfect place to kick off a night in Chinatown.\n\nArden grew up in LA and now lives in New York, but please don't ask her which is the better food city."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "The 15 Best Wine Bars In Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-wine-bars-la",
      "published_at": "2025-07-16",
      "trust_level": "editorial",
      "content": "El Chucho · 12821 Venice Blvd, Mar Vista, Los Angeles 90066 · $$$$ Wine Bar\n\nAmid the protected bike lanes, baby strollers, and other telltale signs of gentrification on the stretch of Venice Blvd between Mar Vista and Venice, El Chucho stands out as being pretty cool. The space (formerly La Potranca) had been a neighborhood dive for years, serving cheap beer and screening soccer for Spanish speakers stopping somewhere before heading home from work. The new owners have kept the pool table, soccer, crass posters, and cheap beer. And they've also added natural wine, vinyl DJ sets, and given the bathroom a deep clean.\n\nEl Chucho is a total scene on weekends (in case you need to wait in a line to feel something). On weeknights, it's a tame spot for a catch-up."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The 18 Best Bars For Singles In LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/la-bars-where-you-can-actually-meet-people",
      "published_at": "2024-12-20",
      "trust_level": "editorial",
      "content": "El Chucho · 12821 Venice Blvd, Mar Vista, Los Angeles 90066 · $$$$ Wine Bar · Mar Vista · Perfect For: Drinking Great Wine\n\nEl Chucho is one of the best places on the Westside to meet people whose names you'll forget mid-conversation. A cross between a divey pool hall and a natural wine bar, this sceney spot doubles as the neighborhood clubhouse of Venice/Mar Vista, and it's usually filled with folks who really want you to know they flew to Miami for Art Basel. A solid lineup of rotating vinyl DJs spin records Thursday through Saturday nights, so you might have to wait to get inside. But there's a good chance you can infiltrate a new friend group while standing in line."
    },
    {
      "source_id": "src_theinfatuation_marvista_2023",
      "publication": "The Infatuation",
      "title": "Mar Vista - Los Angeles Neighborhood Guide",
      "url": "https://www.theinfatuation.com/los-angeles/neighborhoods/mar-vista",
      "published_at": "2023-07-13",
      "trust_level": "editorial",
      "content": "El Chucho in Mar Vista feels like a neighborhood dive, but it's actually a natural wine bar that's a total scene on weekends."
    }
  ]
}