{
  "place_slug": "el-tepeyac-cafe",
  "sources": [
    {
      "source_id": "src_laist_2018",
      "publication": "LAist",
      "title": "El Tepeyac Cafe: Pull Up a Seat at Manuel's Place",
      "url": "https://laist.com/news/food/el-tepeyac",
      "published_at": "2018-07-02",
      "trust_level": "editorial",
      "content": "There is no question that El Tepeyac Cafe, a fifty-plus-year-old Mexican establishment in Boyle Heights, is legendary. Stories swirl amongst foodies, local and otherwise, about the monumentally oversized burritos and equally over-the-top owner, Manuel. My parents tell tales about the \"poor old days\" when they would hungrily dig into one of the \"Manuel's Special\" burritos, whose four pounds of meat, rice, and beans was enough to feed two skinny kids for days on end. No visit to the East Side would be complete without a stop at El Tepeyac, where the ever-present line outside the door isn't enough to deter locals who have depended on this place for their burrito fix since time immemorial. Even Hillary Clinton herself visited back in 1998 during her \"Save America's Treasures\" campaign -- although she hardly did justice to the Special. So does El Tepeyac live up to the hype? With all of this under consideration, however, is El Tepeyac still worth a visit? Absolutely. Let me tell you why. Perched on a sunny hill-top street in Boyle Heights, right across from a bustling Catholic church (an especially cheery locale on Sundays), the restaurant has a homey atmosphere and a casual vibe that really hits the spot if you're in the mood for a lazy Sunday lunch. Service is prompt and efficient, but nothing compares to a visit from Manuel himself, who has owned and operated El Tepeyac for over fifty years. He's the reason that generations of Angelenos return to this place, gathering their children and grandchildren around a modest table to genuflect at an altar of Californian authenticity. Manuel is a wizened little man in a dishwasher's apron, with a raspy, time-worn voice that carries strongly throughout the small dining room. Your best bet at El Tepeyac is definitely to order one of the famous burritos -- there's the Hollenbeck, stewed pork with rice, beans, and guacamole resting under a shroud of soft tortilla and coated with ranchero sauce. This is not a pick-it-up-and-eat-it kind of endeavor: this is a serious fork-and-knife kind of thing. The pork is dry, to be sure, but flavorful and tender to the tooth, a sign that it's been stewed long and low. You can also get it with machaca, and some versions come stuffed with egg. The Okie burrito is similarly constructed, but doused instead with a vibrant red chile sauce. Or if you're the type who goes big or doesn't got at all: there's Manuel's Special. Four pounds of meat, cheese, guac, rice, beans, eggs, and whatever else you want thrown in there. So large it's almost laughable, but probably still good the next day. You can get any of these burritos with chicken or even in vegetarian form, but the rest of the menu is also extensive and worthwhile."
    },
    {
      "source_id": "src_laist_2025",
      "publication": "LAist",
      "title": "Stay local this Mother's Day: 9 Boyle Heights places to brunch with mama",
      "url": "https://laist.com/news/food/mothers-day-9-boyle-heights-places-to-brunch",
      "published_at": "2025-05-10",
      "trust_level": "editorial",
      "content": "This café has become synonymous with the legendary \"Manuel's Special\" — a massive five-pound burrito containing chile verde, rice, beans, guacamole and cheese, named after former owner Manuel Rojas. A true cultural landmark, El Tepeyac has been drawing locals and visitors alike since it opened in 1956 by Rojas' parents. The Evergreen Avenue mainstay is now run by Rojas' grandson, Carlos Thome, a third-generation restaurateur carrying the legacy of generous portions in a cozy environment. Bring your appetite and share the ever-popular Hollenbeck, machaca or okie burrito with mom. Address: 812 N. Evergreen Ave., Los Angeles"
    },
    {
      "source_id": "src_laist_2018_classic",
      "publication": "LAist",
      "title": "The 11 Best Classic And Quintessentially Los Angeles Dishes",
      "url": "https://laist.com/news/food/classic-dishes",
      "published_at": "2018-06-23",
      "trust_level": "editorial",
      "content": "A Boyle Heights institution not far from the Hollenbeck police station, El Tepeyac has been a go-to spot for Mexican fare since 1955. One of their signature burritos is called The Hollenbeck, named after the policemen who kept requesting additional ingredients until the burritos (packed with seared pork meat, rice, beans, guacamole and more) grew to weigh an average of five pounds each. Owner Manuel Rojas used to give shots of tequila to his patrons as they entered. Rojas passed in 2013, the shots are gone but the charm still remains. Manuel's El Tepeyac is located at 812 N. Evergreen Ave. in Boyle Heights. (323) 268-1960"
    },
    {
      "source_id": "src_laist_2018_burritos",
      "publication": "LAist",
      "title": "The Best Burritos In Los Angeles",
      "url": "https://laist.com/news/food/the-best-burritos-in-la",
      "published_at": "2018-06-27",
      "trust_level": "editorial",
      "content": "El Tepeyac has been serving up traditional Mexican food since 1955, but their big claim to fame is the Hollenbeck Burrito, made with five pounds of roast pork, rice, beans, guacamole, cheese and chile verde stuffed into a plate-sized tortilla. It's a legend in L.A., definitely meant for sharing. El Tepayac is located at 812 N Evergreen Avenue, Los Angeles, (323) 268-1960"
    },
    {
      "source_id": "src_laist_2018_map",
      "publication": "LAist",
      "title": "A Map Librarian's Gastronomic Guide To Boyle Heights",
      "url": "https://laist.com/news/food/boyle-heights-map",
      "published_at": "2018-06-23",
      "trust_level": "editorial",
      "content": "First, there is Ciro's, with its avocado salsa and flautas magnifico, and then— just a block away—there is the revered El Tepeyac (aka Manuel's), where the burrito is a genuine feast and the Manuel's Special is a feast the size of a Thanksgiving turkey. I had my first date at Manuel's and once caught a mouse in the bathroom after a few cervezas on the other side of the river. In an area of just 100,000 people, Boyle Heights likely has more great Mexican restaurants than entire regions in the United States, with variety unmatched anywhere, especially Texas. Sure, Boyle Heights has the Breed Street Shul, Evergreen Cemetery, Mariachi Plaza, Libros Schmibros, Hollenbeck Park, Self Help Graphics and history on every square foot but when I drive up the labyrinth of First Street heading east my thoughts are elsewhere…mostly in my stomach."
    },
    {
      "source_id": "src_theeastsiderla_2025",
      "publication": "The Eastsider LA",
      "title": "Good food keeps El Tepeyac at the heart of Boyle Heights",
      "url": "https://www.theeastsiderla.com/neighborhoods/boyle_heights/el-tepeyac-a-boyle-heights-classic-that-s-all-about-the-people/article_6c34fa69-1f35-463c-a072-672a7a4dc85e.html",
      "published_at": "2025-07-31",
      "trust_level": "editorial",
      "content": "El Tepeyac Café in Boyle Heights draws crowds with its massive burritos, legendary status, and decades-long legacy in LA's Mexican food scene. Mention hot dogs, and Pink's comes to mind. Bring up hamburgers, and someone will praise The Apple Pan. Discuss prime rib, and Lawry's is the destination of choice. And toss out the notion of a big burrito, a bellybuster burrito – and it's the fabled Hollenbeck Burrito at the venerable El Tepeyac Café in Boyle Heights that's the sine qua non of rice, beans, meat and salsa, wrapped in a tortilla. There are burritos out there that are big. The Hollenbeck leaves the notion of big in the dust. Eating one makes you feel like Joey Chestnut at Coney Island. The Hollenbeck – named for the nearby Hollenbeck Division of the LAPD – as famous as it is in fable and song, is not the largest burrito served at El Tepeyac. El Tepeyac is a destination for big food, and has been since it opened in 1956. There could well be a sign over the front door that reads, \"Abandon Diets All Ye Who Enter Here!\" For this is a restaurant where nothing is small – not even the combos listed under \"Smaller Plates.\" There's often a line at the takeout window in front of El Tepeyac. And there's rarely an empty table or an unoccupied seat at the counter. For El Tepeyac isn't just a place to eat big – it's the very essence of the neighborhood. It opens at six in the morning every day of the week, for those who'll be burning off the calories working with their hands and their backs all day. The food here is without surprises or puzzlements. The breakfasts – served all day – run to huevos rancheros, bacon & eggs, pancakes, chilaquiles, and a breakfast burrito. El Tepeyac is a paean to how Mexican cooking used to be in the days before restaurants started serving huitlacoche and yellowtail crudo. Along with the burritos, this is the realm of tostadas and enchiladas, of taquitos and quesadillas, of menudo and albondigas. That there's a grilled cheeseburger with fries and a chicken salad on the menu is like finding a mackerel in the Mojave. I have to wonder if anyone ever orders the veggie salad that's on the menu? The only salad needed here is guacamole. It was Manuel Rojas who defined his creation: \"It's all about the love of the people. The people make El Tepeyac.\" They did then. They always will."
    },
    {
      "source_id": "src_abc7_2024",
      "publication": "ABC7 Los Angeles",
      "title": "El Tepeyac Cafe in Boyle Heights is a staple in the community, still thriving after nearly 70 years in business",
      "url": "https://abc7.com/post/el-tepeyac-cafe-boyle-heights-is-staple-community-thriving-after-70-years-business/15137305/",
      "published_at": "2024-08-03",
      "trust_level": "editorial",
      "content": "El Tepeyac Café in Boyle Heights has been a staple in the community for nearly seven decades. Even after all these years, this gem of a restaurant remains a culinary sanctuary, beloved by locals and beyond. The eatery, located at 812 N Evergreen Ave., serves breakfast, lunch, and dinner seven days a week. This tiny Mexican restaurant is home to the monstrous Manuel Special Burrito, which is named after Manuel Rojas, who owned and operated El Tepeyac from 1956 until his passing in 2013. \"Even to this day, people will come in and say 'Aw man I wish your grandfather was still here.' He brought life to the restaurant,\" said Carlos Thome, the restaurant's current owner. El Tepeyac Café remains a culinary sanctuary for people all over SoCal and abroad. \"Nebraska, San Francisco...we have a couple that come from France to eat here. And every time they tell me, 'Oh we couldn't wait to come back and try the food and eat it again and again.' Its actually honestly mind blowing. Really, it's a blessing,\" Thome said. Whether you choose to sit down or take it to go, nearly seven decades later, you can still count on quality food and a welcoming experience. \"I think it's one of the last restaurants I feel personally that you get that family feel when you come in. People greet you, they remember your name,\" Thome said."
    },
    {
      "source_id": "src_discover_la_2026",
      "publication": "Discover Los Angeles",
      "title": "El Tepeyac Cafe",
      "url": "https://www.discoverlosangeles.com/eat-drink/el-tepeyac-cafe",
      "published_at": "",
      "trust_level": "editorial",
      "content": "Break out the knife and fork for the colossal burritos at this Mexican joint. Flour tortillas come stretched to capacity—packed with stewed meats, veggies, rice, beans and all the usual fixins. Burritos this unbelievably moist and delicious are worth the wait in the typically long line. Come hungry for the Hollenback burrito, or split the monstrous Manuel Special."
    }
  ]
}