{
  "place_slug": "elf-cafe",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Elf Cafe - Review - Echo Park - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/elf-cafe",
      "published_at": "2023-08-09",
      "trust_level": "editorial",
      "content": "Elf Cafe in Echo Park has lived many lives since opening in 2006. Known as the predecessor to Dune, this tiny, low-lit Mediterranean restaurant was originally vegetarian, then closed during the pandemic, and has since come out the other side with a menu that invites meat to the party (alongside trout, anchovies, and cheese—quite the hot clique, we must say). And after years of pivoting, Elf Cafe is the best it's ever been.\n\nWe'd send anyone to Elf Cafe just for these steaming hot skewers with a wave of warming spices. Juicy lamb comes on fluffy pita and a spread of charred vegetables like Anaheim chiles and sweet cherry tomatoes.\n\nJust because Elf Cafe is into lamb now doesn't mean it kicked vegetables to the curb. In fact, most dishes on the restaurant's Turkish, Lebanese, and Italian-influenced menu are vegetarian-friendly and stick to the \"whole foods\" mantra: roasted carrots in a garlicky herb sauce, meatless tagine, warm hummus with a baguette for smearing, and non-fried proteins to fuel that temple of a body.\n\nPicture a serene boutique that sells Japanese incense, plop a tiny kitchen and amari bar in the corner, and you get something like Elf Cafe. It smells like an oil diffuser blew up in a nice way, with the occasional whiff of juicy siš kepab pollinating the air with warming spices.\n\nKeep the new and improved Elf Cafe in mind for casual meals that are still special enough to delight someone with good wine and hummus that wasn't sourced from the depths of your fridge. (And if more wine sounds like an enticing post-hummus plan, head to Bar Bandini across the street to keep the night going.)\n\nDoes someone from Santa Monica need to come to Elf Cafe? No, but that doesn't mean it's not the little neighborhood spot everyone wishes they had nearby."
    },
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Vegetarian - Los Angeles Guide",
      "url": "https://www.theinfatuation.com/los-angeles/cuisines/vegetarian",
      "published_at": "",
      "trust_level": "editorial",
      "content": "Elf Cafe is a reliably good Mediterranean restaurant in Echo Park where vegetables and lamb kebap are the stars."
    },
    {
      "source_id": "src_timeout_2020",
      "publication": "Time Out LA",
      "title": "Elf Cafe | Restaurants in Echo Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/elf-cafe",
      "published_at": "2020-12-23",
      "trust_level": "editorial",
      "content": "This Echo Park haunt is a date night go-to for Eastside vegetarians and omnivores alike who fall for the Middle-Eastern and Mediterranean menu that changes with the season."
    }
  ]
}