{
  "place_slug": "endorffeine",
  "sources": [
    {
      "source_id": "src_sprudge_2016",
      "publication": "Sprudge",
      "title": "Sleek Minimalism At LA's Endorffeine Coffee Bar",
      "url": "https://sprudge.com/endorffeine-90449.html",
      "published_at": "",
      "trust_level": "editorial",
      "content": "Amid the coffee buyouts of late, it seems as though independent cafe frontrunners are gradually being absorbed into bigger industrial operations. We are not here to discuss whether that's for the best, but whether there is a resistance movement. If there is, it is surely embodied in Jack Benchakul's Endorffeine Coffee Bar in Chinatown, Los Angeles. The one-man show inhabits a muted box with an atmosphere notable for its beguiling lack of decorations and under-designed interior. Though the shop is small and minimalistic, it shines in the calm atmosphere and personable interactions customers can enjoy with Benchakul himself.\n\nEndorffeine is only one of the many new restaurants and food retailers that have permanently \"popped up\" inside the Far East Plaza Building: Chego!, Pok Pok Phat Thai, Ramen Champ, and Scoops Ice Cream are all within a few steps.\n\nBenchakul then began what would become an expansive tour of the burgeoning Los Angeles coffee scene. He applied to several places (including Starbucks and Intelligentsia) that, despite his technical and culinary background, tuned him away or never returned his call. Bobby Roshan of Café Demitasse brought him on board as he opened the first Demitasse in Little Tokyo. Benchakul managed this location for a time and assisted Roshan in opening the Santa Monica location. He then met up with Cognoscenti founder Yeekai Lim, beginning another formative friendship. Benchakul spent a year serving coffee under the Cognoscenti moniker from a pop-up cart at the Good Girl Dinette in Highland Park (which serves organic-homestyle Vietnamese classics from chef Diep Tran). From there Jack (and Yeekai) moved the Cognoscenti Modbar Cart into Scoops Ice Cream in Chinatown's Far East Plaza. After no more than a year in this location, he opted to venture on his own and made a split from Cognoscenti and Lim, moving into his own storefront next to Scoops Ice Cream. After a short construction hiatus, Benchakul opened up shop where he is now, under the name Endorffeine Coffee Bar.\n\n\"I was drawn by the similarity to Thai street vendors,\" says Benchakul. \"Each of them will sell maybe one or two things; maybe there's one that just does a particular rice noodle soup, then there's a vendor next to him that just does dry noodles, pork satay on skewers. People will come from all over Bangkok because they really execute.\" He decided to open in the current plaza location with an emphasis on doing just one thing well. With that attitude, Benchakul strives to serve—every time—a repeatable, fantastic drink. That means every drink coming out of the shop is made by Benchakul.\n\nEndorffeine Coffee Bar is located at 727 North Broadway #127, Los Angeles. Visit their official website and follow them on Instagram."
    },
    {
      "source_id": "src_sprudge_2017",
      "publication": "Sprudge",
      "title": "Endorffeine 9: An Intimate Evening Coffee Service In Los Angeles",
      "url": "https://sprudge.com/endorffeine-2-112103.html",
      "published_at": "",
      "trust_level": "editorial",
      "content": "Jack Benchakul opened his coffee shop Endorffeine in Chinatown's Far East Plaza last year, after transitioning out of a career as a biochemist. The plaza is bustling with food and drink options, including big names like Andy Ricker's Pok Pok and Roy Choi's Chego. So it makes sense that Benchakul would want to keep his coffee shop open into the evening.\n\n\"I knew that, once created, Endorffeine would serve two functions—coffee bar by day, and intimate food service at night,\" he says. But instead of just extending his hours, he's come up with a creative idea: to offer a reserved-seating, coffee-oriented dessert-and-cocktail nighttime course.\n\nCalled simply \"9\"—a reference to the number of available seats—the evening program features a seasonally driven menu that seems simple, but is actually intricate both in the coffee cocktails and the desserts.\n\nJust like in the daytime, when Benchakul is the only one making the coffee drinks, at 9 he is cook and bartender, making and assembling all the food and cocktails. He says he learned about food during his time working at a pharmaceutical company. \"During my career as a biochemist in San Francisco, I attended culinary school in the evening and on the weekends. Later, I staged at Miette patisserie and at Rubicon restaurant in my spare time.\"\n\nThe three courses at 9 are each paired with a cocktail. For the fall menu, the program starts with an Indian black tea soup and black sesame-date dumplings, teamed with a sparkling coffee blossom gin drink. The flavors are mild, and the interesting textures and mellow sweetness act as a nice introduction to the courses. Up next is smoked-persimmon khao tom mut with fried mung beans, paired with a sparkling cascara lager. This course brings out the seasonal aspect of the menu and is a bit more savory than the first. The last course is the most playful and unusual: pandanus–aquafaba meringue and a tamarind-tofu mousse paired with a Thai chili sake. The meringue is the most unexpected—it's almost like a sweet, airy cracker that melts in your mouth.\n\nBenchakul utilizes various imported and hard-to-find ingredients to make the experience what it is. \"Andy [Ricker, of Pok Pok] has always been generous whenever he returns from a trip to Thailand; he's my de facto coffee blossom supplier. I've also been fortunate to have wonderful regulars who chronically gift unique edible—and drinkable—items to me.\"\n\n\"Beginning in 2017, I will launch a Monday evening cocktail-plus-savory-edibles menu,\" he says. \"Teas and coffees, in all forms, will continue to play a prominent role in the cocktails.\" Stay tuned.\n\nEndorffeine is located at 727 North Broadway #127, Los Angeles. Visit their official website and follow them on Facebook, Twitter, and Instagram."
    },
    {
      "source_id": "src_timeout_2017",
      "publication": "Time Out LA",
      "title": "Endorffeine",
      "url": "https://www.timeout.com/los-angeles/restaurants/endorffeine",
      "published_at": "2017-02-02",
      "trust_level": "editorial",
      "content": "Endorffeine fuels Far East Plaza with coffee from Heart Roasters, offering a number of caffeinated options in a sleek, minimalist setting. The café is known for its vanilla pandan coffee, as well as a palm sugar-whiskey iced latte. But their most ambitious concept is \"9,\" an intimate dessert experience that takes place at Endorffeine on a semi-regular basis (sign up for their newsletter to hear about the next event). Cocktails accompany each of the three dessert courses, enjoyed by just nine people who were lucky enough to snag a seat."
    }
  ]
}