{
  "place_slug": "evil-twin-la",
  "sources": [
    {
      "source_id": "src_infatuation_2023",
      "publication": "The Infatuation",
      "title": "Evil Twin - Review - Culver City",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/evil-twin",
      "published_at": "2023-11-22",
      "trust_level": "editorial",
      "content": "Evil Twin is a dark natural wine bar in Culver City with a short (very good) French menu. Evil Twin is the alter ego of Hotcakes Bakes, a bright Culver City bakery that sells cute, tiny cupcakes. But once the day's cake orders wind down, the room next door opens up as a dark natural wine bar with a short but enticing French menu. Think fresh crab meat salads with a tart pistachio vinaigrette, savory rye crepes with smoky iberico chorizo, and a meaty hunk of sturgeon tightly wrapped in prosciutto like a gift box at Macy's. Note that Evil Twin isn't cheap (that's a $39 piece of sturgeon), but it's one of few wine bars on the Westside doing something interesting. Also, their stringlit back patio is lovely and has live music every Wednesday."
    },
    {
      "source_id": "src_culver_city_observer_2023",
      "publication": "Culver City Observer",
      "title": "Recently Opened Natural Wine Bar Brings French Twist to Culver City",
      "url": "https://www.culvercityobserver.com/story/2023/02/16/dining/recently-opened-natural-wine-bar-brings-french-twist-to-culver-city/12162.html",
      "published_at": "2023-02-16",
      "trust_level": "editorial",
      "content": "Nestled on the corner of Washington Blvd & Centinela Avenue sharing an expanded space with widely-recognized and respected sister concept, Hotcakes Bakes, Evil Twin is Culver City's new neighborhood go-to for natural wines, small plates, comedy shows, and a furthered sense of community. Evil Twin opened its doors to locals, pouring natural wines, craft beers, and French-inspired dishes alongside sister-concept Hotcakes Bakes, offering a curated, international collection of bottles paired with an imaginative, French-influenced menu. Spearheaded by Dylan Weiss and co-founded by Elfie Astier, the mother-son duo has undertaken a joint pursuit of passion projects and entrepreneurship within a shared space. Dylan's decision to pursue a life working in the world of wine was heavily inspired by his mother - a celebrated entrepreneur with 30+ years in the hospitality industry - and his cousin - a Parisian high-profile, restaurant wine program director. Evil Twin's internationally influenced and locally sourced food menu reflects Weiss' French roots and Los Angeles upbringing, with highlights including Pâté de Campagne (traditional duck pate & a baguette), Lamb Chops (tender lamb with chimichurri on a crispy arugula salad), Mussels (mussels in a garlic butter wine sauce, shallots, & tomatoes), Fried 'Cali-Flower' (crispy fried cauliflower + spicy yum yum sauce & housemade ranch) and more. In addition to these savory dishes, the team behind Evil Twin is working to create collaborative dessert offerings to share flavors of their heritage and serve as perfect pairings for Evil Twin's wine selections. Evil Twin's thoughtfully curated natural wine program offers a colorful list of wines from all over the world-France, Italy, and California-made by small and independent producers. Guests can expect varietals in the form of a 'pet nat' by disruptive winemakers from Sonoma, a juicy chilled Beaujolais from Burgundy, a crisp French Vouvray made of 100% Chenin Blanc from 90-year-old vines, and an oenophile's dream. The antithesis of the vibrant and colorful daytime cafe and bakery that is Hotcakes Bakes, Evil Twin's quaint space is dimly lit and enclosed by dark walls, shelves of beautifully and artistically labeled wine, and intimate table and banquette arrangements. Guests can expect a reliable and adventurous glass of wine and imaginative bites and events, i.e. bi-weekly comedy nights, wine club meetings, and more."
    }
  ]
}