{
  "place_slug": "flask-field",
  "sources": [
    {
      "source_id": "src_row_dtla_2020",
      "publication": "ROW DTLA",
      "title": "Miriam Yoo Of Flask & Field Is In High Spirits",
      "url": "https://www.rowdtla.com/news/miriam-yoo-of-flask-and-field-is-in-high-spirits",
      "published_at": "2020-12-11",
      "trust_level": "editorial",
      "content": "Miriam Yoo, the founder and owner of Flask & Field, a local wine and spirits shop at ROW DTLA, might be the only optimist left. As the pandemic ravages brick-and-mortar businesses across the country, exacerbating a decades-long decline in retail with the rise of online shopping, small businesses like hers are closing in droves. But instead of succumbing to despair or giving up and cutting her losses, Yoo—once a successful entertainment lawyer—pivoted. \"We were probably open for a year and a half before the pandemic hit. In the beginning there was this tone of 'save small businesses!' But you know the tone sort of evolved throughout. Now it's 'save yourself.' It is tricky being a retail business, and I don't sell essential goods,\" Yoo explained. Even without that \"essential\" label, Yoo guided her local shop through countless challenges and a systematic reinvention of their business model. With \"99.9% of (the) business\" coming from in-person shoppers before March, Flask & Field needed to overhaul its online storefront. But despite Yoo's lack of prior experience in the retail or wine worlds, her store took the new opportunity in stride."
    },
    {
      "source_id": "src_ladowntown_news_2020",
      "publication": "LA Downtown News",
      "title": "Miriam Yoo of Flask & Field is in high spirits",
      "url": "http://www.ladowntownnews.com/business/miriam-yoo-of-flask-field-is-in-high-spirits/article_ea93b966-38c3-11eb-87c6-4b61fbf7f64d.html",
      "published_at": "2020-12-11",
      "trust_level": "editorial",
      "content": "Miriam Yoo switched her business Flask & Field to an online and social media-driven business style in response to COVID-19. With \"99.9% of (the) business\" coming from in-person shoppers before March, Flask & Field needed to overhaul its online storefront. But despite Yoo's lack of prior experience in the retail or wine worlds, her store took the new opportunity in stride. \"It was certainly a clunky transition. We went from zero online sales to 100% of our business. Now we're in whatever business we need to be in to survive. I was going to do whatever I had to do to survive,\" Yoo said of Flask & Field's online success. \"But being able to accept (the pandemic) fully has enabled us to be present with what needs to happen to be successful every day.\" So, after taking it day by day, Flask & Field now offers a comprehensive online storefront; contracts with major Hollywood law and entertainment firms for remote gifting programs; and even recently set up a small COVID-safe booth at ROW DTLA to rekindle a physical connection with its customers."
    },
    {
      "source_id": "src_thea_metropolis_2020",
      "publication": "THEA at Metropolis",
      "title": "A Wine Lovers Guide to DTLA",
      "url": "https://theadtla.com/a-wine-lovers-guide-to-dtla/",
      "published_at": "2020-10-20",
      "trust_level": "editorial",
      "content": "Flask & Field Row DTLA 767 S Alameda St. Ste 180 Los Angeles, CA 90021 · Flask & Field is a modern destination for the discovery of wine, spirits, art and design. They are now offering Virtual Tastings for a fun way to connect with friends and family near and far, while learning something new. The kits offer a variety of options and price points so you and your crew can choose your own adventure: classic wine tasting, natty wine tasting, cocktail making or non-alcoholic cocktail making. You can do it on your own using their guided tasting notes or you can book a Flask & Field host to virtually guide you through it all. Free delivery for orders $125 and more."
    },
    {
      "source_id": "src_row_dtla_2021",
      "publication": "ROW DTLA",
      "title": "ROW DTLA's Girl Gang",
      "url": "https://rowdtla.com/news/row-dtlas-girl-gang/",
      "published_at": "2021-03-01",
      "trust_level": "editorial",
      "content": "Miriam Yoo's past as an entertainment attorney explains her foray into wine at her shop, Flask & Field. Every bottle isn't just curated; it's thoroughly vetted. Flask & Field is your stop for bespoke home and kitchen items that look as good as the wine you'll select tastes. Stop in and see what it means to break the legal limit for cool."
    },
    {
      "source_id": "src_voyage_la_2021",
      "publication": "Voyage LA Magazine",
      "title": "Meet Miriam Yoo of Flask & Field",
      "url": "https://voyagela.com/interview/meet-miriam-yoo-of-flask-field/",
      "published_at": "2021-11-17",
      "trust_level": "editorial",
      "content": "Today we'd like to introduce you to Miriam Yoo. Hi Miriam, so excited to have you with us today. What can you tell us about your story? I have always been a lover of wine, spirits and lifestyle goods. I'm a good drinker and a good shopper so combining the two has always been in the cards for me – I just didn't know it! I practiced law for nine years in the entertainment industry and met many of my lifelong friends along the way. I knew I needed to do something more creative, where I had more control over my future and my day-to-day sanity. Owning and operating a retail shop has been the most challenging and rewarding endeavor I have ever taken on. The pandemic has really leveled the playing field and forced business owners to think outside the box and dig deep. Never a dull moment! For our readers who might not be as familiar what can you tell them about the brand? We are a small, minority-owned business that specializes in natural wines, craft spirits, and bespoke gift sets. We also have a wine club where 5% goes directly to social justice initiatives and organizations. We love being of service to our clients and customers and helping them find fun products that encourage enjoyment in daily life, not just special occasions."
    }
  ]
}