{
  "place_slug": "ggiata-delicatessen",
  "sources": [
    {
      "source_id": "src_theinfatuation_2022",
      "publication": "The Infatuation",
      "title": "Ggiata Delicatessen - Review - East Hollywood",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/ggiata-delicatessen",
      "published_at": "2022-01-14",
      "trust_level": "editorial",
      "content": "Opening in 2020, Ggiata is one of the newer sandwich shops in town, and yet, the reason we love it so much is just how old school the menu feels. You'll spot sandwiches filled with things like crispy chicken cutlets drenched in spicy vodka sauce, meatball parmesan, and tangy grilled balsamic chicken with roasted red peppers. Though there are a few traditional cold cut options on the menu, most of Ggiata's sandwiches feel more like entrees on bread - and that's a great attribute in our books, particularly when they taste as good as they do here.\n\nGgiata's bright space at Melrose and Western is mostly a to-go operation - there's no inside seating to speak of - but if you're too hungry to wait until you get back home or to the office, check out the tiny counter along the back wall outside. No one's going to mistake this part of East Hollywood for Italy, but there's something intrinsically European about standing around an alley with a sandwich, sipping orange San Pellegrino, and stretching your midday siesta as far as it'll go.\n\nIf this is your first time to Ggiata, The Spicy P is a must-order. The moist chicken cutlet has a perfectly-crusted, crispy exterior, but the star of the show is without question their house-made spicy vodka sauce smothered on top. It's sweet, creamy, and slightly acidic, and slowly seeps into the charred seeded baguette as you eat.\n\nWe first ordered this sandwich simply because of its name, but will continue to order it, because it is, in fact, a masterpiece. Stacked with prosciutto, marinated eggplant, tomato confit, roasted red peppers, stracciatella, arugula, and red wine vinaigrette, it's a balancing act between its sweet, savory, and acidic elements - all of which complement each other perfectly. This is our favorite sandwich at Ggiata.\n\nIt's understandable if you come here only craving a sandwich, but if you leave without some arancini in your bag, you've done it wrong. These white wine risotto balls have a perfectly-fried crunchiness on the outside that gives way to a gooey, fontina-filled center. They're the ideal dipping snack during lunch - particularly considering you're dipping them into a side of Ggiata's spicy vodka sauce.\n\nIf a place like Ggiata can't nail a classic Italian sub, it should probably reconsider its business model. Luckily, that's of no concern here. This ham, salami, capicola, muenster cheese, and vinaigrette-topped sandwich isn't doing anything wildly different, but that's exactly why it works.\n\nSay it with us: I will not leave Ggiata without getting a dessert. OK, say it again. Now head to the daily dessert case and have at it. Whether it's a perfectly moist Limoncello olive oil cake or a box of sweet, nutty rainbow cookies, you're not walking out of Ggiata with only sandwiches in your bag - or stomach."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Ggiata Delicatessen West Hollywood - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/ggiata-west-hollywood",
      "published_at": "2025-11-05",
      "trust_level": "editorial",
      "content": "When Ggiata opened in East Hollywood in 2021, it wasn't long before we named it one of our favorite places in the city to grab a sandwich. Now the East Coast-inspired sandwich shop has moved west, opening a second store in the heart of West Hollywood. The layout's pretty similar to the original—a small, order-at-the-counter space suitable for a quick lunch—but the menu here is a little larger. You'll find classics like the prosciutto-stuffed Masterpiece and the Spicy P alongside additions like the Rocky, a fancy chopped cheese with pepperoncini, or The Burr, which is essentially their take on tuna salad. Don't forget to raid their dessert case, too. The limoncello olive cake and rainbow cookies are the best you'll find in town."
    },
    {
      "source_id": "src_timeout_la_2022",
      "publication": "Time Out LA",
      "title": "Ggiata Delicatessen - Restaurants in Hollywood, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/ggiata-delicatessen",
      "published_at": "2022-05-18",
      "trust_level": "editorial",
      "content": "Open since 2020, this Italian deli-style newcomer in Hollywood has made waves with their chicken parm sub, also known as the Spicy P, and a ciabatta sandwich known as the Masterpiece, which comes loaded with prosciutto di parma, marinated eggplant, tomato confit, roasted red peppers and stracciatella cheese. Available only for delivery and to-go, Ggiata's premium priced ($14–$16) sandwiches are the stuff dreams are made of, and they offer an excellent vegan portobello mushroom and nut-based ricotta cheese sandwich known as the Madeline."
    },
    {
      "source_id": "src_theinfatuation_2020",
      "publication": "The Infatuation",
      "title": "Jon Hamm Joins Ggiata For Charity Sandwich Collab",
      "url": "https://www.theinfatuation.com/los-angeles/features/jon-hamm-sandwich-ggiata-los-angeles",
      "published_at": "2020-08-24",
      "trust_level": "editorial",
      "content": "Ggiata is a Pico-Union deli that opened earlier this year, gaining a ton of popularity for their takes on Italian-American classics. For every sandwich sold, Hamm and Ggiata will donate a meal to the frontline workers at MLK Hospital in Compton."
    },
    {
      "source_id": "src_theinfatuation_2025_tiktok",
      "publication": "The Infatuation",
      "title": "A Guide To LA Restaurants Going Viral On TikTok Right Now",
      "url": "https://www.theinfatuation.com/los-angeles/guides/la-tiktok-restaurants",
      "published_at": "2025-12-03",
      "trust_level": "editorial",
      "content": "We've been fans of Ggiata's gussied-up Italian sandwiches for years, but this new-school deli chain recently dipped into the wrap game with its Perfect Chicken Caesar Wrap that promptly went viral. The reception has been divisive—not just online, but in our own office, too. We all agree this salad-stuffed bundle is great in theory, but less so in practice. The warm, chopped chicken cutlet wilts the romaine lettuce if it sits too long, the dressing tastes closer to ranch than ceasar (though it's still delicious), and we're on the fence whether big crunchy croutons inside a toasted flour tortilla is carb-on-carb overkill. That said, this is still a satisfying lunch, especially after you drizzle on the extra dressing you're given."
    }
  ]
}