{
  "place_slug": "go-get-em-tiger",
  "sources": [
    {
      "source_id": "src_sprudge_2018",
      "publication": "Sprudge",
      "title": "In The Los Angeles Arts District, Go Get Em Tiger Feels Right At Home",
      "url": "https://sprudge.com/in-the-los-angeles-arts-district-go-get-em-tiger-feels-right-at-home-139157.html",
      "published_at": "2018",
      "trust_level": "editorial",
      "content": "In The Los Angeles Arts District, Go Get Em Tiger Feels Right At Home\n\nThat's the word of Kyle Glanville, co-founder and co-entrepreneur at Go Get Em Tiger, an independent Los Angeles roaster-retail cafe brand. I'm speaking to him today from inside GGET's newest cafe, a 400-square-foot space in the heart of LA's teeming Arts District. We're just a few blocks from where, all the way back in 2011, Handsome Coffee (RIP) planted a flag for specialty coffee in this neighborhood at 582 Mateo. (It is now a Blue Bottle.) The vibe here at Go Get Em feels industrial and hip—there is a Shinola retail store next door, natch—but shot through with an approach to clean space and line art that evokes the company's first cafe space in LA, over on Larchmont. The two cafes are about six miles apart, but the aesthetic difference between neighborhoods cannot be overstated.\n\nThis Arts District location opened in late 2018, and it marks just the latest growth iteration for a part of Los Angeles that's become synonymous with generational change. In the last 15 years, this neighborhood has experienced a renaissance, moving from abandoned buildings, through artist lofts, to a more bourgeois crowd with the money for luxury lofts and curated boutiques. But the undercurrent remains friendly and a little bohemian—there's a reason why Hollywood films so many New York City scenes on these blocks—and the staff reflects back the same vibe. Though by no means the only coffee shop in the area (there are three other shops serving coffee within spitting distance), GGET has already drawn their regulars and is consistently busy. \"The most gratifying experience is when you can be early to a neighborhood that is coming into itself,\" Glanville says, and you can see it happening before your very eyes through the cafe's windows onto 3rd.\n\nGo Get Em Tiger is located at 827 E 3rd St, Los Angeles. Visit their official website and follow them on Facebook, Twitter, and Instagram."
    },
    {
      "source_id": "src_sprudge_2020",
      "publication": "Sprudge",
      "title": "Momofuku & Le Comptoir Alum Launches Lunch At Go Get Em Tiger",
      "url": "https://sprudge.com/go-get-em-tiger-lunch-los-angeles-53626.html",
      "published_at": "2020-09-07",
      "trust_level": "editorial",
      "content": "Momofuku & Le Comptoir Alum Launches Lunch At Go Get Em Tiger\n\nChang, whose CV also includes Momofuku Ssam Bar, has most recently been found making killer Thai dishes at Grand Central Market in downtown Los Angeles, housed in the same teeming complex as Mssrs. Glanville & Babinski's other coffee bar, G&B Coffee. There at Sticky Rice, Mr. Chang's relationship with the staff of G&B coffee was built over shared lunch breaks and plates of BBQ chicken, bowls of curry, and of course, the restaurant's signature sticky rice. Now Mr. Chang stands behind the counter at GGET, slathering romesco on baguettes layered with romanesco, roasted spring onions, pickled grapes, and turnip greens. He dresses his kale caesar salads with a thick, creamy dressing made of anchovies and topped with tiny croutons, and garnishes his avocado toast with tiny tomatoes, slices of radish, and pieces of flat leaf parsley, before seasoning each piece with fresh lemon juice and sea salt. The opening menu at Go Get Em Tiger also includes a seasonal sweet potato soup served alongside.\n\nGo Get Em Tiger is located at 230 N Larchmont Blvd in Los Angeles. Hours daily."
    },
    {
      "source_id": "src_timeout_la_2016",
      "publication": "Time Out LA",
      "title": "Go Get Em Tiger - Larchmont Village",
      "url": "https://www.timeout.com/los-angeles/restaurants/go-get-em-tiger",
      "published_at": "2016-07-01",
      "trust_level": "editorial",
      "content": "Go Get Em Tiger\n\nMid-City's Larchmont Blvd gets schooled in all things roasted and brewed at Go Get Em Tiger, a growing coffee empire from varsity team Kyle Glanville and Charles Babinski. Here, ice cream cases are replaced with a long, standing bar where coffee nerds and newbies can get their caffeine fix. (Those looking for a frozen treat, can request the milkshake mixed with Strauss vanilla ice cream and an eye-opening four shots of espresso.)\n\nThere's an all-star line-up of coffee—expect four to six rotating varieties at a time—from San Francisco (Ritual), Vancouver (Forty Ninth Parallel) and PDX (Heart Roasters). Take a seat at one of the low-slung wooden stools or tabletops by the bar for toast and jam (courtesy Saving the Season) to go with that pour-over. Our number one pick? The almond macadamia nut latte."
    },
    {
      "source_id": "src_timeout_la_2016",
      "publication": "Time Out LA",
      "title": "Go Get Em Tiger - Los Feliz",
      "url": "https://www.timeout.com/los-angeles/restaurants/go-get-em-tiger-1",
      "published_at": "2016-09-17",
      "trust_level": "editorial",
      "content": "Go Get Em Tiger - Los Feliz\n\nThe popular Larchmont coffee shop has expanded to a stunning space in Los Feliz, where a bright, wood-paneled shop opens up to an airy patio. The food is just as great as the coffee—baked pancakes with crème fraîche and preserves, adobo grain bowl, soft scrambled eggs and house-made granola are a great place to start."
    },
    {
      "source_id": "src_timeout_la_2018",
      "publication": "Time Out LA",
      "title": "Go Get Em Tiger - Highland Park",
      "url": "https://www.timeout.com/los-angeles/restaurants/go-get-em-tiger-2",
      "published_at": "2018-09-22",
      "trust_level": "editorial",
      "content": "Go Get Em Tiger - Highland Park\n\nThis ultra-hip coffee shop just found an equally-cool neighborhood for its third location. With roots already planted in Larchmont Village and Los Feliz, Go Get Em Tiger expanded east, taking up residence in Highland Park."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Go Get Em Tiger - Review - Los Feliz",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/go-get-em-tiger-los-feliz",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "Go Get Em Tiger - Review - Los Feliz\n\nGo Get Em Tiger's Larchmont location is everything you'd expect from the third-wave coffee chain - great caffeine, very busy."
    }
  ]
}