{
  "place_slug": "gucci-osteria-da-massimo-bottura",
  "sources": [
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "Gucci Osteria da Massimo Bottura – Beverly Hills - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/en/california/beverly-hills/restaurant/gucci-osteria-da-massimo-bottura-1190961",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Gucci Osteria da Massimo Bottura in Beverly Hills earns Two Michelin Stars according to recent Michelin Guide designation. Chef Massimo Bottura has put the talented Mattia Agazzi in charge of this kitchen housed within the Gucci boutique on Rodeo Drive, and the results are very impressive indeed. This is cooking that is at once whimsical and grounded. Seafood salad arrives perfectly warm and tender, dressed with lemon, olive oil and shaved radish; while risotto is camouflaged as pizza with tomato, stracciatella and burnt caper dust evoking the taste of a charred crust. Thumb-sized tortellini, filled with the classic mortadella, veal and prosciutto mixture, sits pretty in a glossy pool of Parmigiano Reggiano-enriched sauce. The meal ends with a concise choice of desserts, including the colorfully named \"A Bunch of Flowers,\" with a scoop of chamomile ice cream on green apple sauce with candied lemon peel."
    },
    {
      "source_id": "src_michelin_guide_2023",
      "publication": "Michelin Guide",
      "title": "Checking In with Gucci Osteria Beverly Hills' Mattia Agazzi",
      "url": "https://guide.michelin.com/us/en/article/features/gucci-osteria-beverly-hills-michelin-star-massimo-bottura-mattia-agazzi-guide-restaurants",
      "published_at": "2023-05-22",
      "trust_level": "editorial",
      "content": "Chef Massimo Bottura's Gucci Osteria (a MICHELIN Guide One Star) offers elegance, refinement, and innovation. Located on top of Gucci's Rodeo Drive flagship, Gucci Osteria is accessed via the street itself. Gucci Osteria has been open since 2020. In that time, it has earned a MICHELIN star, and while the famed chef Massimo Bottura spearheaded the project, the young star Mattia Agazzi runs the kitchen. The entirety of Gucci Osteria Beverly Hills is dependent on seasonality, and even some of the more permanent menu items change ever so slightly based on what's available at the farmer's market. All of the restaurant's dishes are served atop Gucci's Richard Ginori Porcelain, which helps to elevate the experience of the dish itself. The Pastry Chef, Tamara Rigo, has a signature dessert called \"Oops, I Broke The Meringue,\" which was designed to be camouflaged into the plate on which it is served."
    },
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Osteria Gucci - Review - Beverly Hills - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/osteria-gucci",
      "published_at": "2023-07-06",
      "trust_level": "editorial",
      "content": "Gucci Osteria is a breezy Italian rooftop in Beverly Hills that's pricey, gaudily branded, but overall enjoyable. Located above the Gucci flagship store on Rodeo Drive, this breezy Italian rooftop offers an over-the-top experience that makes you feel like the most pampered pup in Beverly Hills. The service is fantastic, the palm tree-lined views are straight out of a movie, and elaborate plated dishes remind you that in fashion, looks do matter. Chef Massimo Bottura helped create Gucci Osteria's menu, which features a few of his signature dishes from Italy, like tortellini, plus some exclusive dishes created by the LA restaurant's chef. For the most part, the food is more memorable for its stunning presentation than bold flavors. There are few dishes that deliver both, however, like the grilled artichokes with a runny farm egg and shaved truffle. There's also a Gucci-themed burger that sounds gimmicky but is surprisingly tasty. Dinner is a prix-fixe menu that starts at a steep $190 per person, but if you prefer to order a la carte, go for lunch instead."
    },
    {
      "source_id": "src_timeout_la_2020",
      "publication": "Time Out LA",
      "title": "Here's a peek inside Gucci Osteria, Rodeo Drive's new rooftop restaurant from Massimo Bottura",
      "url": "https://www.timeout.com/los-angeles/news/heres-a-peek-inside-gucci-osteria-rodeo-drives-new-rooftop-trattoria-from-massimo-bottura-021120",
      "published_at": "2020-02-12",
      "trust_level": "editorial",
      "content": "High fashion meets haute cuisine when Gucci opens its first—and only—Gucci Osteria in the U.S., with a little help from one of the world's most acclaimed chefs. Starting Monday, February 17, you can perch atop the iconic Rodeo Drive in the fashion house's new Italian gem, a breezy alfresco 50-seat number from three-Michelin-starred chef Massimo Bottura, and dine on pizza-inspired risotto, delicate tortellini in parmigiano reggiano cream, and even a few dishes inspired by Los Angeles. In addition to Bottura's signature tortellini, you can expect a number of the original Gucci Osteria hits and more than a bit of Italian sourcing: the Emilia burger, made with ingredients sourced from the Emilia-Romagna region in Northern Italy; a creamy and ever-changing \"Noah's Ark\" pâté drizzled with balsamic from Bottura's own provenance; spaghetti with cacciucco; a refreshing insalata di mare towering with scallop and baby octopus; margherita pizza as risotto; a ricotta so light and airy it's a wonder that the cheese hasn't been whipped into its form."
    }
  ]
}