{
  "place_slug": "hermons",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Hermon's is a sharp take on the classic neighborhood bar and grill",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/hermons",
      "published_at": "2025-09-29",
      "trust_level": "editorial",
      "content": "Hermon's is a polished neighborhood bar and steakhouse in Highland Park with a menu that's heavy on meat, cream, and nostalgia.\n\nWe've been referring to Hermon's as \"hipster Hillstone\" when suggesting it to our friends with short attention spans, and if you admire America's most polished chain restaurant as much as we do, you'll know that's a high compliment. This updated take on the all-american neighborhood bar and grill comes from the Rasarumah folks, and sits inside a restored church banquet hall in a part of town that's right next to Highland Park but not quite part of it (anyone who lives in the surrounding neighborhood of Hermon will be happy to correct you).\n\nThere's a big U-shaped bar up front that's set aside for walk-ins (ideal for the $10 martini Happy Hour), but most of the dining room is made up of large leather booths, which are already packed. The space feels like somewhere the love interests in a Hallmark holiday movie would hit it off during a festive group meal.\n\nLikewise, the chophouse menu is built for indulgent dinners, and once your crew puts in a round of martinis (all but mandatory here), follow up with the gooey pull-apart garlic bread, potato fritters with a fluffy knob of cream cheese, and a lasagna-coded take on pasta vongole that tastes like a cheesy clam pizza. The small but mighty bar burger and fried coconut prawns are good bets, too. Get the baked alaska for dessert. Yes, you read that right. Baked alaskas are back.\n\nReservations are released two weeks in advance at midnight. Hermon's 18-seat bar is set aside for walk-ins, but you might need to arrive right before opening (5pm) to guarantee a seat."
    },
    {
      "source_id": "src_variety_2025",
      "publication": "Variety",
      "title": "Hermon's Restaurant: Sophisticated Bistro Opens in Northeast Los Angeles",
      "url": "https://variety.com/2025/scene/news/hermons-restaurant-northeast-los-angeles-last-word-1236608020/",
      "published_at": "2025-12-13",
      "trust_level": "editorial",
      "content": "Hermon's is the latest restaurant from Last Word Hospitality, offering a grown-up bistro experience in Northeast Los Angeles.\n\nLast year, the Last Word hospitality team was all set to open Chez Renée in the Malibu spot that formerly housed La La Cabana and Giorgio's. But fate had other ideas, and the historic former sheriff's station on Pacific Coast Highway burned in the Palisades-Malibu fire in January. Now co-founders Holly Fox and Adam Weisblatt are paying tribute to that concept at their new restaurant Hermon's, with the Ode to Chez cheeseburger, a decadent patty topped with soubise fondue and bordelaise onions on a sesame milk bun. It's just one of the elevated but approachable dishes on the menu of the first serious restaurant ever to open in the tiny neighborhood of Hermon in Northeast Los Angeles.\n\nTucked along the Arroyo Parkway between South Pasadena, Highland Park and Montecito Heights, it's a mostly residential area that was crying out for a place to get a well-made cocktail and a plate of steak frites. Last Word operates several of the area's hottest restaurants, including Portuguese wine bar Barra Santos in Glassell Park, Queen St. Raw Bar & Grill in Eagle Rock and Found Oyster in East Hollywood. Weisblatt lives in nearby South Pasadena, and had his eye on the former church banquet hall along Monterey Road for several years. While the fire was a harsh setback, it paved the way for Hermon's, which locals are already welcoming as an addition to the sometimes overly-trendy NELA dining scene.\n\nHermon's is almost resolutely anti-trendy: It stakes its claim as a grown-up restaurant, with large half-circle booths, an appealing u-shaped bar and a selection of eclectic art lining the walls. The mission-style dark wood furnishings and tiled bar almost look like they've been since Musso & Frank set the city's dining style and ostriches and lions roamed the nearby movie studios and tourist attractions.\n\nDespite its vintage feel, chef David Kolender's American bistro-style menu is full of creative touches that situate the restaurant firmly in the modern era. Even the marinated olives zing with orange, fennel and chili flakes, while scallop crudo and panzanella salad also showcase citrus flavors. Steak frites is a classic rendition with perfectly-done fries and a horseradish mayo. While the menu is still growing, mains also include a nightly pasta dish, whole grilled branzino and mushroom bourguignon.\n\nHowever you order, you will want to start with the garlic bread for the table — a whole round spelt loaf is doused in garlic butter and sure to be instantly devoured. Pair it with a Tiny Tini – the perfect petite cocktail for light drinkers, at just $9; a walnut old-fashioned or the fruit daiquiri of the day."
    },
    {
      "source_id": "src_laist_2025",
      "publication": "LAist",
      "title": "Northeast LA's Hermon gets a new gathering place",
      "url": "https://laist.com/news/food/northeast-las-hermon-gets-a-new-gathering-place",
      "published_at": "2025-12-13",
      "trust_level": "editorial",
      "content": "If you've never heard of the Northeast Los Angeles neighborhood tucked between Highland Park and El Sereno, you're not alone. Unless you live there or regularly navigate the Arroyo Seco, Hermon tends to fly under the radar. While its hip neighbors have seen wave after wave of restaurant openings, this 3,500-resident community has remained untouched.\n\nUntil now. Opened Dec. 3, Hermon's sits on the main stretch of Monterey Road, the latest venture from Last Word Hospitality — the restaurant group behind Found Oyster and Rasarumah. Founded in 2014 by Holly Fox and Adam Weisblatt, the group partners with chefs and hospitality professionals, helping them become restaurant owners.\n\nThe neighborhood of Hermon was founded in 1903 by a Free Methodist Church group and named after the biblical Mount Hermon. Annexed into Los Angeles in 1912, Hermon has grown quietly as a primarily residential area. But it remains one of Northeast LA's last underserved neighborhoods, with limited amenities and stores. There's a take-out spot at the Fresco Community Market shopping center, as well as a sit-down Thai restaurant in the same strip mall.\n\nThe new 89-seat restaurant occupies a former banquet hall that belonged to the Free Methodist Church, with Art Deco bones in a decidedly Craftsman neighborhood. The all-booth dining room features a U-shaped bar, handmade California tilework, hickory floors and vintage artwork spanning centuries. Fox spent five years pursuing the building, drawn to its corner location and architectural details. The landlord initially resisted, citing risk, but came around after detailed presentations and tours of Barra Santos and Queen's. The next stop was the Hermon Neighborhood Council. Fox's team pitched in the space itself, emphasizing architectural restoration. The clincher? The name. \"The first thing she said to me was, 'The smartest thing you've done is name it Hermon,'\" Fox recalled of the council president's reaction. \"'You saw a community and you said, \"Let's build a reflection of who they are.\"'\" Inside Hermon's: a softly lit, wood-lined dining room that nods to classic L.A.\n\nThe Ode to Chez cheeseburger ($24) — originally created for a Malibu project lost in the Palisades fires — features soubise fondue studded with green peppercorns, bordelaise onions, Dijon and a sesame milk bun developed with Kolender's former team at Tartine. Skip the $6 fries and opt instead for the loaded potato fritters ($16), topped with cream cheese, bacon and parmesan. It's the kind of indulgence that doesn't leave you weighed down.\n\nSince the opening, Kolender says the response has been overwhelming. \"We've had people who live down the street here two, three times already,\" he said. \"We know them by name.\" For Fox, it's unprecedented. \"I have never opened a restaurant with this much support,\" she said. \"It's an unbelievable feeling.\"\n\nThe opening fulfills a long-standing community goal. In 2018, when the Hermon Neighborhood Council asked residents what they wanted to see more of in the neighborhood, the answer was clear: walkable retail and amenities, including restaurants and cafes. The story illustrates Last Word Hospitality's intentional approach to developing \"in-between\" neighborhoods rather than adding to already-saturated dining corridors. Opening with a happy hour was non-negotiable for Fox — a signal from day one that Hermon's is built for locals. Running daily until 6 p.m., there are $10 martinis and food specials priced between $6-8 that include garlic bread, marinated olives and loaded potato fritters."
    },
    {
      "source_id": "src_eater_la_2025",
      "publication": "Eater LA",
      "title": "Hermon's Featured in Restaurant Openings & Best Dishes",
      "url": "https://la.eater.com/coming-attractions/292285/anticipated-los-angeles-restaurant-openings-fall-2025",
      "published_at": "2025-12-08",
      "trust_level": "editorial",
      "content": "An 89-seat American and bar-food spot from Last Word Hospitality with chef DK Kolender, this Hermon restaurant takes over a former church banquet hall with booth seating and a U-shaped bar, antique light fixtures, and hickory floors, while the menu hits comfort notes like coconut shrimp, loaded potato fritters, house-made pastas, coal-fired meat and fish, and the Ode to Chez Burger with peppercorn sauce and cheddar soubise.\n\nJust opened last week in the Hermon neighborhood of Northeast Los Angeles, Hermon's is worth a visit for many reasons: to witness the vibrancy of the Hermon community that has really shown up for this opening; take in the festive design of the space; enjoy a tiny martini; and most of all, indulge in the loaded potato fritters. Four potato pave cubes arrive with a generous dollop of whipped cream cheese that cradles bacon and chives; the entire thing gets topped with a snowstorm of shaved Parmesan. Though deeply savory and rich, the fluffy consistency of the cream cheese and delicate layers of potato somehow don't feel assaulting or heavy. I'd be delighted to return to a bar seat at Hermon's and just order this with a tiny 'tini to go with it."
    }
  ]
}