{
  "place_slug": "holbox",
  "sources": [
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "Holbox – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/holbox",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Holbox – a One Star: High quality cooking restaurant in the 2025 MICHELIN Guide USA.\n\nIts namesake is a Caribbean island just off the coast of the Yucatán Peninsula, but this beloved counter, located inside the Mercado La Paloma, is a distinctively Angelino phenomenon. Chef Gilbert Cetina, who previously cooked with his father at neighboring stall Chichen Itza, draws from Mexican coastal cuisines in dishes whose simplicity belies remarkable flavor. Spectacular quality seafood of unassailable freshness leaves an impression, whether in electrifyingly vibrant aguachiles and ceviches, excellent tacos served on house-made heirloom corn tortillas, or skillfully grilled lobster—a panoply of exceptional house salsas gilds the lily. The frequently changing menu offers no shortage of delights, and a tasting menu, offered by reservation only on Thursdays and Fridays, is hotly sought-after."
    },
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Holbox's vibrant mariscos remind us why eating in LA is magical",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/holbox",
      "published_at": "2025-03-20",
      "trust_level": "editorial",
      "content": "Holbox doesn't need a PR team, viral TikToks or, frankly, this restaurant review to stay relevant. It's got uni-topped tostadas and plush scallop ceviches to do that. For years, this mariscos stall in Mercado La Paloma has been preparing coastal Mexican dishes with razor-sharp precision, relying on chiles, citrus, and ocean brine to transform pristine local seafood into tiny miracles cradled in tortillas or scooped up with chips. And for years, we've sprinted back to Holbox like kids chasing an ice cream truck, ready to hurl our money in exchange for whatever daily catch is on ice behind the counter. Even today, when hour-long lines spill into the parking lot on weekends, every casually refined meal here is a reminder of what makes eating in LA feel so special.\n\nBut the difference here is the subtle touches that make Mexican seafood staples feel luxe. The wild raw shrimp in Holbox's aguachile sit in a pool of tart, vibrant-green sauce stung with serrano, with the shrimp's deep-fried heads peeking up from the bowl like synchronized swimmers. A fine-tuned, peanut-laced salsa macha adds spice and richness to a taco dorado with queso chihuahua and smoked kanpachi. Everything, from the salsas to tortillas to the grilled fish, comes together intuitively and elegantly. And the best part is you get courtside seats to watch it happen. At Holbox, the most coveted seats are at the bar, where you'll watch whole fish charred get in grill baskets, and cooks carefully assemble tostadas while you dab your salsa-covered hands with paper napkins. Even after a semi-recent expansion, getting one of the dozen or so counter seats is still competitive for walk-ups, but you can also reserve one during their twice-weekly tasting menu dinners—an eight-course experience.\n\nOr maybe it's just the pleasure of living somewhere where you can show up in a baseball cap and jeans to toss back briny blood clams glammed up with pico de gallo for a fairly reasonable price. Because when seafood this magnificent is presented simply, and all the ingredients are singing kumbaya on the same plate, there's nothing else to add. A place like Holbox speaks for itself.\n\nHolbox's twice-weekly tasting menu includes eight seafood courses and costs $130 per person, which is a reasonable price for what you're getting. The first half consists of raw dishes from the á la carte menu (don't be shy about asking for their house salsas to add some heat), while the second half covers cooked dishes unique to the tasting menu, like abalone tamales with a plantain and abalone-infused mole or poached spiny lobster paired with a fis[h]"
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Holbox | Restaurants in South LA, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/holbox",
      "published_at": "2025-03-01",
      "trust_level": "editorial",
      "content": "This Michelin-starred, no-frills food stall in South L.A. offers one of L.A.'s best Mexican seafood experiences—all at a fairly reasonable price. Housed inside food hall Mercado La Paloma, Gilberto Cetina Jr.'s Yucatecan-style mariscos counter is a profound revelation for those who enjoy spice, citrus and smoke. The approachable deep-fried fish tacos and well-made coctel mixto, of course, bring in the daytime crowds, but more upmarket dishes like the smoked kanpachi tostadas and freshly shucked oysters more than hold their ground against other seafood heavyweights."
    },
    {
      "source_id": "src_resy_2024",
      "publication": "Resy",
      "title": "Six Essential Dishes at Holbox in Los Angeles",
      "url": "https://blog.resy.com/2024/12/holbox-menu/",
      "published_at": "2025-02-05",
      "trust_level": "editorial",
      "content": "Holbox is a modestly sized Mexican seafood counter inside Mercado La Paloma, a food court and community hub in South L.A. It's also the Los Angeles dining experience I most enthusiastically recommend to visitors and locals alike.\n\nHolbox has similarly been upping its game when it comes to masa. In 2023, former Chichén Itzá employee Fátima Juárez took over Holbox's masa program, sourcing heirloom Mexican corn varieties and nixtamalizing them in-house for her stunning handmade tortillas and tostadas. (Earlier this year, she opened Komal Molino in a stall across from Holbox — more on that in a minute.) No matter if you sit down to a $17 lunch special (which gets you ceviche mixto plus two tacos), or the eight-course tasting menu dinners Cetina holds on Thursdays and Fridays, every dish is a showstopper. Here, Cetina walks us through the unbridled magic of Holbox through the lens of six dishes.\n\n\"The taco de pulpo has been on the menu since day one. It's an iconic dish from Yucatán, and it's one of the few recipes we do at Holbox that I learned from my dad. Normally, the octopus is cut into large chunks and mixed into a looser sofrito, but our version is like an octopus Bolognese.\"\n\n\"We do a few tostadas that aren't super traditional, like the kanpachi and uni tostada, and the smoked kanpachi tostada. Normally, a tostada is just ceviche, straight up. These two were inspired by seeing places like La Guerrerense in Ensenada do creative takes on mariscos, and trying their fish pâté, almeja, and different combinations of seafood. We wanted a strong ceviche fish base on which to showcase beautiful Santa Barbara sea urchin, and the Omega Blue Baja California kanpachi worked really well for this.\""
    }
  ]
}