{
  "place_slug": "honey-hi",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Honey Hi - Review - Echo Park - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/honey-hi",
      "published_at": "2023-02-09",
      "trust_level": "editorial",
      "content": "It would be easy to dismiss Honey Hi, a daytime spot in Echo Park, as another restaurant taking advantage of the fact that people care about wellness now. One of the owners is a nutritionist, the menu is gluten- and refined sugar-free, and they serve a banana toast topped with something called chayawanaprash. But it turns out Honey Hi is just a regular neighborhood cafe, with better-than-average neighborhood cafe food, and the side perk that most of what you're eating is good for you. The menu is surprisingly big, and not just made up of fancy toasts. Of course, there's an avocado toast, but this one has thin slices of radishes and pickled shallots on top. Everything here tastes both fresh and flavorful, and won't leave you feeling awful in an hour because all you ate for lunch was fried things smothered in fake cheese. The space is stripped back, but feels calm - kind of like you're on your way to better health simply because you showed up. You order at the counter (where they'll tell you that chayawanaprash is an ayurvedic jam), take a number, and get one of the tables lining each side of the room, or one of the small ones on the sidewalk. Maybe you'll also grab something out of the cold case filled with all the internet's favorite health-adjacent things, like gluten-free bread, probiotic coconut yogurt, Topo Chico, LaCroix, and too many flavors of kombucha to count. In an ideal world, eating healthy wouldn't involve cutting out food groups based on their color or consulting a shaman about your iron intake. It would mean more places like Honey Hi, where you can hang out all day having food that actually tastes like food. Even if you still don't know what an adaptogen is. This version is better than most avocado toasts. You will have to sacrifice your usual cheese for ancho & chipotle cashew crema, but that's about the only indication that this very good breakfast sandwich is any different from any other fancy breakfast sandwich. An excellent, Middle Eastern-ish lamb burger. When you're here with someone who is very skeptical of anything having to do with healthy things, order this. Pretty Good: You'll likely be satisfied by a meal here, especially for a specific situation. These are handy back-up restaurants and beloved local spots."
    },
    {
      "source_id": "src_timeout_la_2016",
      "publication": "Time Out LA",
      "title": "Honey Hi | Restaurants in Echo Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/honey-hi",
      "published_at": "2016-10-11",
      "trust_level": "editorial",
      "content": "The name may sound cute-sy (it's also a Fleetwood Mac song), but Honey Hi is serious about making flavorful, healthy dishes for the Echo Park crowd. The minimalist shop features a deli case and a fridge full of locally made goods—kimchi, kombucha and vegan cheese to start. Grain bowls dominate the menu: That One Bowl is a colorful mix of quinoa, pesto kale, watermelon radish, roasted pumpkin seeds and a turmeric poached egg, while the Miso Bowl is a little more hearty, with jade rice, cabbage, carrots, shredded chicken, ginger chickpea miso and spiced almonds. A selection of tartines abound—be sure to try the freshly made chia jam with tahini, bee pollen and torn mint. And before you leave, a chocolate chip cookie—gluten-free and oh-so-gooey—is in order."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The Best Gluten-Free Restaurants In LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-gluten-free-restaurants-los-angeles",
      "published_at": "2024-10-17",
      "trust_level": "editorial",
      "content": "A trip to the fully-GF Honey Hi for colorful smoothies and seasonal grain bowls is such a refreshing experience you might consider leaving town to go start a hemp farm in Ojai. If you're on a GF diet and craving pancakes and bread, this is the place. Our must-order is the Moroccan-spiced Lambwich, a perfect combination of a lamb-beef patty and halloumi with an acidic punch. The laid-back atmosphere with quick in-and-out traffic makes it great for solo diners, and you can entertain yourself by perking up to the '90s alt playlist."
    }
  ]
}