{
  "place_slug": "hotel-covell",
  "sources": [
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "15 Best Hotels in Los Angeles for 2025",
      "url": "https://www.timeout.com/los-angeles/hotels/best-hotels-in-los-angeles",
      "published_at": "2025-10-13",
      "trust_level": "editorial",
      "content": "Situated above local Los Feliz/East Hollywood favorite Bar Covell (and owned by the bar's founder, Dustin Lancaster), Hotel Covell offers nine well-appointed rooms, each meticulously curated with reading nooks and record players, clawfoot tubs and statement furniture, and adorable Smeg refrigerators stocked with locally sourced offerings.\n\nHotel Covell does the boutique hotel thing to an immaculate standard. It opened in 2015 with five suites (the other four were added in 2018), and there's a kind of bonkers story behind it. Each room is based on a different moment in the life story of a fictional author called George Covell, from his childhood in Oklahoma to his days in New York and Paris. Thankfully, it's all done with a light-touch; nothing is overblown or hammy. Room accessories are high end too; there are Smeg fridges, Le Labo toiletries, indulgent bed linens from local company Parachute. When you're not unwinding in this artsy pad, you'll find you're right at the nexus of East Hollywood, Los Feliz and Thai Town; Griffith Park is right up the road, too. Time Out tip: The beautiful Barnsdall Park is a couple of minutes walk away, and is home to Hollyhock House—a Frank Lloyd Wright masterpiece which mere mortals can tour."
    },
    {
      "source_id": "src_timeout_2017",
      "publication": "Time Out LA",
      "title": "Hotel Covell",
      "url": "https://www.timeout.com/los-angeles/hotels/hotel-covell",
      "published_at": "2017-10-10",
      "trust_level": "editorial",
      "content": "An impeccably designed boutique hotel in the hip, walkable neighborhood of Los Feliz, next door to delicious breakfast tacos and a casual wine bar.\n\nSituated above local-favorite Bar Covell (and owned by the bar's founder, Dustin Lancaster), Hotel Covell offers nine well-appointed rooms, each meticulously curated with reading nooks and record players, clawfoot tubs and statement furniture, and adorable Smeg refrigerators stocked with locally sourced offerings. There isn't a pool or gym, but amenities come in other forms: an attentive concierge, an intimate rooftop deck, room service from Home State and Bar Covell (not to mention a bottle of wine from the downstairs bar upon arrival), and miraculously soundproof rooms that make Hollywood Boulevard seem miles away.\n\nTime Out tip: All Hotel Covell guests receive 10 percent off at a handful of Eastside establishments; just present your room key when it's time to pay."
    },
    {
      "source_id": "src_cyties_2020",
      "publication": "CYTIES",
      "title": "Hotel Covell",
      "url": "https://cyties.com/los-angeles-stay/hotel-covell/",
      "published_at": "2020-12-07",
      "trust_level": "editorial",
      "content": "Boutique hotel that draws decorative inspiration from a fictional male traveler. Whether it's sunbathing on the deck or having a glass of wine at their bar, Hotel Covell is true LA hospitality.\n\nGeorge Covell was born and raised in Oklahoma City but something else called to him – the bright lights of Hollywood. So, he packed up his truck and headed to Los Angeles. That first move inspired George to see the world and he would go on to have adventures in New York, Paris, Morocco, and Japan. He'd even one day have a daughter, Isabel, and she'd be as worldly as he. But the thing about George Covell is… he's not real. George is a fictional character that the folks at Hotel Covell made up and the reason why will make you want to stay in this boutique property on your next trip to Los Angeles. Back in 2010, Covell, a cool trendy wine bar in Los Feliz opened its doors. Five years later, the owners of Covell opened a boutique hotel above the bar. When designing their hip and trendy hotel, they came up with a crazy idea – to design the rooms based on different chapters of the life of George Covell, a fictional man that we can all relate to – from a small city boy to a man of the world. There are only nine suites at Hotel Covell and each are designed with a different destination in mind, however, you can generally find custom-modern pieces intertwined with vintage items like vinyl record players or lamps from the 50s. There are even four suites based on the life of George's daughter Isabel, a French-American with a bad ass love for the 80s. In addition to the cool décor, travelers will discover top quality amenities like kitchenettes with Smeg refrigerators and Malin + Goetz toiletries in the walk-in showers.\n\nA stay at Hotel Covell is meant to feel like a home away from home. The concierge, though not available 24/7, can arrange laundry or massages in room. They even go so far as to greet you at the door, provide a tour of your room, and valet your car in the free parking lot. And when you need to get out of your room, know that there's a small private sun deck, perfect to get a bit of work done on your laptop or catch those beautiful LA rays during the summer. Hotel Covell isn't your typical hotel and it's not looking to be. It's that place that attracts men in search of something bigger and better, something more personal and exciting, something that dives headfirst into the LA scene – just like George Covell did.\n\nHead down to Bar Covell, the hotels own rustic wine-bar with a stellar list of vino. After a morning of too much imbibe, stroll down the street to Homestate, the best breakfast tacos in LA."
    },
    {
      "source_id": "src_selectedbyrg_2025",
      "publication": "Selected by RG",
      "title": "Boutique hotel in vibrant Los Feliz, L.A. where a fictional character inspires unique design",
      "url": "https://www.selectedbyrg.com/blog/covell",
      "published_at": "2025-06-30",
      "trust_level": "editorial",
      "content": "Where Los Feliz, Silver Lake and Hollywood meet, there is a unique boutique hotel that has been on my wish list for a long time. I am so happy to finally get the opportunity to stay at Hotel Covell. And sometimes when you have been waiting for something for a long time, reality doesn't always match the expectations. But don't worry, that was not the case here.\n\nThe Covell opened back in 2015 at the same time as this area really started to show up on people's radar. Back then there were only 5 suites and in 2018 they expanded and added an additional 4. The unique thing with this hotel is that it is created around a fictional character, George Covell. Each suite is a chapter from the book about his life. We stayed in the Oklahoma Room which represents the first part of his life. From Oklahoma he move on to New York, Paris as he grows older. I must say that I really appreciate the theme and how it comes alive in the design.\n\nWelcome to Hotel Covell! I am heading upstairs to our room after having checked in. Our room was situated at the end of this outdoor corridor, facing the building next door. Our room actually had two doors, one from the outdoor corridor and one from the indoor. Love this dark paneling and how it runs high up on the wall towards the ceiling. Our spacious, bright room with a proper king size bed and bed linen from LA brand, Parachute.\n\nOur room called Oklahoma is the first chapter in the fictive character George Covell's life. It draws inspiration from his youth when he was growing up in the American Midwest. Of course there is a turntable in the room. I wouldn't mind having this kitchen in our apartment back home. I am a sucker for country style kitchens like this one with a farmhouse style sink, white paneling and exposed shelving.\n\nI often highlight hotels that offer a welcome drink. At the Covell we got this handwritten note and an entire bottle of wine to enjoy in our cozy room. Amazing! I love when there is an attention to details. Like the note pad with a pretend shopping list. Our room truly evoked a \"home-away-from-home\" feeling. One of my favorite design features in our room was the use of two different shapes and colors of tiles in the bathroom. Le Labo products is a sign of a hotel that takes quality seriously.\n\nThe sun is setting over LA and the Covell. There is a sun deck on the roof, perfect place to hang out, relaxing with a drink in the evening sun. Right next door there is a coffee place that should not be missed. It is called Go Get 'Em Tiger. They don't only serve great coffee but also some great treats. I never say no to banana bread.\n\nLove Mexican food! This is Tu Madre, a great hole-in-the-wall place just up the street from the hotel. Night time in LA and time to return to the comfort of our Midwestern sanctuary. Morning has broken (very early due to jet lag) and enjoying the first coffee of the day at Urth Café, which is a favorite when in LA.\n\nA hotel with a unique back story, a hipster look & feel that is surrounded by great bars, cafés and restaurants. If you want your hotel to feel like a home away from home, the Covell is your hotel when coming to L.A."
    }
  ]
}