{
  "place_slug": "hotel-june-west-la",
  "sources": [
    {
      "source_id": "src_the_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Caravan Swim Club - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/caravan-swim-club",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "Caravan Swim Club is a breezy, poolside spot at Westchester's Hotel June where you can drink delicious cocktails in a cabana, but don't expect a stand-out meal from its Baja-inspired menu. Apart from it being a convenient stop after landing at LAX and a chill place to have a drink, not much else makes this a distinctive destination. The menu is a mix of Mexican, Tex-Mex, and American dishes, all of which are listed at hotel prices (i.e., $25 for three shrimp tacos). Our biggest issue with the food at Caravan, however, is the overall lack of flavor. The cauliflower nachos are coated in a coconut turmeric cashew queso that tastes like unseasoned boiled cauliflower and those (expensive) shrimp tacos are fried in a bland beer batter. There are a few redeeming dishes on the menu, but for the most part, eating here felt like playing a game called, \"do you taste anything, or is it just me?\"\n\nCaravan Swim Club is a place best left for daytime occasions, and maybe ones that involve poolside drinks and socializing rather than high expectations for a meal. For what it lacks in flavor, this spot makes up for with solid music curation, comfortable seating, good cocktails, and a great list of mezcal and tequila. We'll happily order a few rounds by the pool and call it day.\n\nThe refreshing vodka cocktail is as bold as its name. The honey balances out the booze, but lemon, grapefruit, and a splash of bitters keep it from getting too sweet. Made with prickly pear gin, chile liqueur, and raspberries, this sweet, tangy, slightly smoky cocktail is what we want in a poolside beverage. We love its trippy pink-purple color, too. This shareable quesadilla is one of the more flavorful items we tried. The Oaxacan cheese is salty, the flour tortilla is sturdy, the squash blossoms are tender and delicate—and there's a smoky-hot salsa roja that brings everything together."
    },
    {
      "source_id": "src_digs_net_2021",
      "publication": "Digs.net",
      "title": "Hotel June & The Spirit of Southern California",
      "url": "https://digs.net/hotel-june-the-spirit-of-southern-california/",
      "published_at": "2021-03-22",
      "trust_level": "editorial",
      "content": "Located along Pacific Coast Highway, on the west side of Los Angeles in Westchester, Hotel June reflects the soul of the city. On one hand, the hotel honors its architectural past—something that immediately caught the attention of the team of Venice-based Studio Collective, which spent three years working on the renovation—and on the other, it unveils its new dynamic face with an authentic California feel, especially inside.\n\nLead designer Chris Sheffield, designers Yasha Sangam and Tahlia Heffernan, and principals Christian Schulz, Adam Goldstein, and Leslie Kale—all from Studio Collective—reimagined the vertical 14-story concrete structure initially conceived by famed L.A. architect Welton Becket in the mid-to-late-1950s.\n\n\"The buildings' facades have a slight brutalist look and feel, due to the deep window sills and eaves expressed around the punched window openings, adding texture to the exterior but also a fortress-like quality at the same time,\" Christian Schulz describes.\n\nProviding unparalleled views from mid-upper floors out toward the ocean, Downtown Los Angeles, and the surrounding mountains, Hotel June comprises 250 rooms decorated with a calming, neutral palette, reflective of the natural materials used by Studio Collective. Stained white oak and sisal help to create a relaxed feel, as if the hotel were a beach house, and also highlight the California sunlight. The very pale blue paint applied from the floor up to around the 60-inch mark on all the rooms' walls, and the pale blue bathroom tile are nods to the tones of the nearby Pacific Ocean. More playful pops of color, such as deep green, mustard yellow, orange, and terracotta, among others, and motifs were used in the lobby, restaurant, and poolside exterior areas through the furnishings and artworks.\n\nHotel June is nestled in a historic building designed by Welton Beckett. Inside, the decoration is an ode to Southern California. \"Their use of bold colors and geometric patterns, along with commonplace materials such as plywood and perforated metal, combined with organic textures and the technique of blurring the lines between inside and out, helped propel the mid-century movement. We employed these methods ourselves throughout the property.\"\n\nMeanwhile, pieces by local artists adorn the different spaces: a mural by Alex Proba beyond the reception and several painted installations by Stephen Carballo, aka The Los Angeles River, and Otis Alum. \"Upon hearing news of the renovation, we were fortunate that the original architect's grand-daughter Alexandra Becket (a Los Angeles textile artist) reached out to us about doing a potential collaboration,\" Christian Schulz remembers.\n\nThis detail, and every other, from the music to the aroma, helps shape the perfect atmosphere and experience at Hotel June. For Studio Collective, the objective consisted of \"designing a hotel that would always feel comfortable, approachable and aspirational.\" This they've certainly achieved."
    },
    {
      "source_id": "src_timeout_la_2022",
      "publication": "Time Out LA",
      "title": "June Screening Series",
      "url": "https://www.timeout.com/los-angeles/movies/june-screening-series",
      "published_at": "2022-10-13",
      "trust_level": "editorial",
      "content": "No, this screening series isn't limited to a single month: It's hosted at the Westside's Hotel June. Each Tuesday night, you can catch a different film by the pool with cocktails shareable plates available for purchase. Each ticket includes a complimentary margarita."
    }
  ]
}