{
  "place_slug": "howlin-rays",
  "sources": [
    {
      "source_id": "src_theinfatuation_2022",
      "publication": "The Infatuation",
      "title": "Howlin' Ray's - Review - Chinatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/howlin-rays",
      "published_at": "2022-01-14",
      "trust_level": "editorial",
      "content": "In a city as big as LA, restaurants tend to get divided into two categories: restaurants you go to, and restaurants you hear about. Restaurants you go to are the easy ones - they're the places you enjoy that are usually located within your bubble. Restaurants you hear about are those often difficult, far-flung places your annoying coworkers rave about, but deep down you know it'll take a miracle (and a very free Saturday) for you to ever experience. Howlin' Ray's is that place you've definitely heard about. The Nashville hot chicken joint started out as a food truck a few years back, but now has a permanent setup inside Chinatown's Far East Plaza. And while the brick and mortar location might be more convenient than a roving truck, if you've been to Chinatown lately, you know it's still not the easiest place to navigate (or find parking). Plus, with operating hours best described as scattered (11am-4pm, closed Mondays and Tuesdays), unless you work downtown, chances are you haven't been able to swing by yet.\n\nSo what gives? Is Howlin' Ray's destined to just be a place you always hear about? It better not. Because there comes a point while waiting in (the probably very long) line - right when you can finally glance into their small, modern digs and see everyone working their asses off - that it hits you. Who gives a sh*t about the hassle? Sure this place might be popular, but they know exactly what they're doing. And as you get closer, hearing all the line cooks shouting \"Yes, chef!\" like minions to the fried chicken lord, you realize this is something you'll happily give up a Saturday for.\n\nOnce you finally get to the register, figure out your spice levels (godspeed to anyone who tries anything over \"hot\"), find a seat at the counter, and take your first bite, it's confirmed: Howlin' Ray's is definitely amazing. Your mouth is scorched (and will be for the afternoon), but you don't care. You're positive that's some of the best chicken you've ever had, and it's worth some pain. You can go all-in on some dark and white pieces, grab a whole bird with a couple friends, or stack it all between two buns - it doesn't matter how you do it. Howlin' Ray's hot chicken is tremendous across the board. So don't let that annoying coworker have all the glory. Make Howlin' Ray's a place you get to. Immediately.\n\nAnyone who's ever eaten chicken before knows dark (wings, thigh, etc.) is the obvious way to go. $8 might seem steep for a few pieces, but you'll survive. That is unless you order anything over \"hot\" - this is the kind of spicy you need to take seriously. We won't judge if you stick to the \"country style\" or \"mild,\" because we want you to enjoy the best chicken in LA comfortably. Be safe out there.\n\nThough zero parts milkshake, these guys are straight-up addiction fuel. Old-school crinkle cut (the best cut) and tossed in a very mild spice. MORE MORE MORE. Look, no one drives to Chinatown to eat vegetables at a fried chicken joint, but the point here is if you do, they're going to be way better than you think. And for a place that boasts about the quality of their ingredients elsewhere on the menu, take this as a very good sign."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Howlin' Ray's Pasadena - Review - Pasadena - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/howlin-rays-pasadena",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "When Howlin' Ray's opened its first brick-and-mortar space in 2015, it sparked LA's borderline insatiable love for hot chicken. And though a million competitors have opened in the years since, there hasn't been one yet that's done it better than Howlin' Ray's. Braving the infamous long lines and chaotic parking situation at their tiny shopping plaza location in Chinatown was simply part of the admission price for eating chicken this good. Fortunately, the latest Howlin's Ray's outpost in Pasadena is a major upgrade. Although the lines haven't gotten any shorter, it offers a far more comfortable dining experience while still delivering the same outstanding deep-fried, cayenne-coated poultry as the original.\n\nFor starters, the spacious full-service location on South Arroyo Parkway has plenty of seating inside and out. There's a huge lot around the back (plus tons of metered spots on the street) which makes parking a breeze. Wait times can be hours-long on weekends, but the friendly staff usually find a way to make you feel like a regular—whether it's complimenting your shoe game or offering samples so you can see how high your spice tolerance goes. They'll even send you updated wait times (which are also posted hourly on the restaurant's IG story) if you shoot them a text. Even if you're morally opposed to standing in long lines like we are, these nice little features make waiting at Howlin' Ray's feel less like a circus and more like being at a well-run Trader Joe's that strictly sells chicken.\n\nIf it's your first time at Howlin' Ray's, order the sando. The chile-crusted chicken breast contrasts beautifully with the buttery-soft brioche bun, while the crunchy pickles, peppery slaw, and creamy comeback sauce keep the whole package from becoming too dry. The six heat levels at Howlin' Ray's range from non-existent to totally disturbing, and for the most part, we prefer to land right in the middle. The medium level has the perfect punch of spice—anything hotter will overwhelm your senses and bring you to tears. We're also huge fans of the Mario Fries, a secret menu item named after one of the restaurant's original employees that is essentially Howlin's Ray's take on animal fries.\n\nThere's still no better place to sweat, swell, and maybe even cry over hot chicken than at Howlin' Ray's, and that's even more true in Pasadena. From the first bite of the extra crispy skin to the final paprika-dusted french fry, a meal here is like going on a great theme park ride as much as it is eating at a restaurant. Not only is Howlin's Ray's at the top of the hot chicken movement in LA, they've found a way to become even better as time progresses. We're not particularly religious, but if there's any proof that a higher power exists and wants us to be happy, it would be the classic Howlin' Ray's sando on a toasted brioche bun. It is the absolute gold standard for hot chicken sandwiches in LA—we suggest ordering it at the medium heat level for the ideal balance of spice and flavor."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Howlin' Ray's | Restaurants in Chinatown, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/howlin-rays",
      "published_at": "2025-04-26",
      "trust_level": "editorial",
      "content": "Johnny Zone spent his early career working with the likes of Thomas Keller and Gordon Ramsay, but he's more famous these days for being the chef who started L.A.'s Nashville hot chicken craze. Fried up and served by a dedicated, high-energy crew that keeps morale high when lines get long (and boy, do they get long), Howlin's hot chicken is just as great as when we first waited hours to get our hands on it years ago. A newer Pasadena location offers more ample seating, plus beer and wine for on-site diners, but the Far East Plaza original still accepts walk-in orders and even offers local delivery. Choose between white or dark meat, or maybe a sandwich in whatever level of heat you can handle, from Country to Howlin'. For a truly decadent bite, order the Jojo-style sando, which puts boneless chicken breast, melted cheddar, butter and maple syrup between two waffles."
    },
    {
      "source_id": "src_theinfatuation_2016",
      "publication": "The Infatuation",
      "title": "Los Angeles's Best New Restaurants of 2016",
      "url": "https://www.theinfatuation.com/los-angeles/guides/los-angeles-best-new-restaurants-of-2016",
      "published_at": "2016-12-05",
      "trust_level": "editorial",
      "content": "Howlin' Ray's did spend the last few years roaming around the Eastside as a food truck, but this year they went full brick-and-mortar in Chinatown's Far East Plaza, and we might never be the same. So what's all the fuss about? Nashville hot chicken. The kind of hot that will stay will you throughout the day, into the night, and somehow still make you wake up and crave it the next morning. Lines are admittedly long all day at this order-at-the-counter spot, but no matter how long the wait might be - stick it out. Howlin' Ray's will not disappoint you."
    },
    {
      "source_id": "src_consuming_la_2019",
      "publication": "Consuming LA",
      "title": "10 Best Fried Chicken Joints in LA",
      "url": "https://www.consumingla.com/2019/01/17/best-fried-chicken-los-angeles/",
      "published_at": "2019-01-17",
      "trust_level": "editorial",
      "content": "#3 Howlin' Ray's (727 N Broadway #128, Los Angeles in Chinatown/Downtown). Located amid the souvenir shops and Chinese herb merchants in the Far East Plaza in Chinatown, Howlin' Rays serves Nashville-style Hot Chicken. This place is so popular — and so incredibly good — that the wait in line can often take two hours or more. I don't love waiting in lines, but this place is definitely worth it."
    }
  ]
}