{
  "place_slug": "jame-enoteca",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Jame Enoteca - Review - El Segundo - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/jame-enoteca",
      "published_at": "2023-06-14",
      "trust_level": "editorial",
      "content": "Jame Enoteca is a small strip mall Italian spot in El Segundo with fantastic handmade pasta. It goes without saying that you should prepare your body and mind for a lot of pasta. It's the largest section on the menu, plus there are always a few daily specials on the whiteboard. That said, you don't go to Jame for a few drive-worthy pastas and then head back to your down comforter. You come Jame to load up on appetizers, salads, giant pork shanks, and then the drive-worthy pasta (all which hover around $16). Ordering a full-scale Italian feast is the only way to do this place correctly. The meatballs are rich and crispy, the prosciutto comes with a softball-sized heap of stracciatella in the middle, and if there's a better kale salad in the city of Los Angeles, we don't know it. Even if you don't have any room left for dessert, order the key lime pie to-go. There are worse things in the world than coming home from work to a piece of homemade pie in your freezer.\n\nEating pasta alone at home tends to be a reliable plan B. You're exhausted from work, there's a half-full box of penne in your pantry, and you have enough olive oil to give it a decent drizzle. Eating pasta at a restaurant in LA, however, tends to be the opposite. Sure, we have some solid neighborhood standbys, but the vast majority of our best Italian restaurants require long-standing reservations and a certain level of comfort with paying $29 for a bowl of pasta. But every once in a while, we find a place that splits the difference between these two scenarios - a restaurant that serves beef cheek scaprinocc with a 12-year balsamico in a setup that feels like you're still at home. Jame Enoteca is that kind of restaurant. If it wasn't for the clear signage, you might mistake this place in a downtown El Segundo strip mall for a fast-casual soup chain.\n\nThe tiny space is bright and welcoming, but the white subway-tiled walls and giant, maybe-stock images of people eating pasta make it feel like an order-at-the-counter lunch spot that also has locations in Burbank and Simi Valley. Let us be clear though - this is a huge reason why we like it here. As soon as you open the menu and see things like pesto mandili, fresh prosciutto, and a giant crispy branzino, you're going to be pretty excited about the fact that you're in a strip mall and the chef just came out wearing sneakers and boardshorts.\n\nIf you take three friends to Jame and ask which pasta is their favorite, you'll probably get three different answers. For us, the winner is the mandilli - pillowy handkerchief pasta in a nutty pesto sauce. Stuffed with braised cheek and drenched in a pool of brown sage sauce, this pasta is rich. It's packed with flavor, and the individual dumplings make it easy to track who at the table is hogging. It's around this time when your heart rate will slow and breathing becomes a chore. Power through it. Covered in a lambrusco-mustard glaze, this is a perfectly cooked piece of meat and we would sacrifice ordering another pasta to make sure this dish hits the table. There's nothing fancy about this key lime pie and that's exactly why we like it. It's perfectly balanced with the right amount of graham cracker crust, plus a dollop of house-made whip cream on top because sometimes life is good."
    },
    {
      "source_id": "src_timeout_la_2023",
      "publication": "Time Out LA",
      "title": "Jame | Restaurants in El Segundo, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/jame-enoteca",
      "published_at": "2023-05-11",
      "trust_level": "editorial",
      "content": "Los Angeles is no stranger to great Italian restaurants, but a hyper-seasonal one helmed by a chef who's no stranger to Michelin-starred kitchens? Well that's something a little more out of the ordinary. Jame's menu regularly rotates, but you'll always find an array of hand-rolled pastas on the menu, not to mention roasted local vegetables, meat and fish. The pasta is the undisputed star, but stop by for lunch or brunch and get rewarded with classic-Italian sandwiches and eggs galore."
    },
    {
      "source_id": "src_daily_breeze_2018",
      "publication": "Daily Breeze",
      "title": "Italian food dazzles with every bite at Jame Enoteca in El Segundo",
      "url": "https://www.dailybreeze.com/2018/09/13/italian-food-dazzles-with-every-bite-at-jame-enoteca-in-el-segundo/",
      "published_at": "2018-09-13",
      "trust_level": "editorial",
      "content": "While those of us who pursue the latest diet trend with all the fervor we give to the pursuit of a perfect slab of toro over rice, the massive return of pasta comes as something of a shock to the system (as my mother would have put it). While we were avoiding carbs on the Atkins, the South Beach and the paleo diets, carbs were plotting a return from the shadows. Which they've done, with some of the best pastas to ever grace the tables of Southern California, at pasta-intensive restaurants like Felix, Uovo (which serves nothing but!) … and most recently, the sublimely good El Segundo mini-mall pasta shop called Jame Enoteca — which, despite its name, doesn't (as of this writing) serve wine. Soon, they say. They hope.\n\nThere are seven pastas for lunch, eight for dinner, with plenty of overlap, though should you develop an obsession with the lasagna with a \"Hollywood\" ragu (which seems to mean extra meaty) it's served at dinner only. As well lasagna should be — a proper lasagna will leave you in no shape at all to return to work for the afternoon. But mostly, the pastas overlap — though they may be a bit simpler at lunch than at dinner. The bavette — a ribbon pasta that's like tagliatelle, only narrower — appears on the lunch menu with a rock shrimp ragu, and on the dinner menu with the same rock shrimp ragu, but also with a stretchy stracciatella cheese, which costs $4 extra at lunchtime. But the ricotta gnocchi, with its house-cured pastrami \"lardons,\" is at both meals.\n\nIn the back of a mini-mall that's home to a number of fast-food shops, this artisanal Italian is the best restaurant to open in the South Bay this year — a tiny space with a cheerful staff, and a manageable menu of sublime salads, and perfect pastas. It's the sort of place you want to share with your friends soon as you can."
    }
  ]
}