{
  "place_slug": "kobawoo-house",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Kobawoo House is so much more than its legendary bossam",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/kobawoo-house",
      "published_at": "2025-10-28",
      "trust_level": "editorial",
      "content": "Most people go to Kobawoo for the restaurant's famous pork belly ready to be wrapped into little bundles with cabbage and kimchi. Rightfully so—it's our favorite bossam in the city. But Kobawoo's real draw is that the restaurant feels refreshingly traditional, especially when so many buzzy, new-school restaurants have popped up (and sometimes disappeared) nearby.\n\nThe Koreatown institution has been around since the 1980s. It's still the kind of wooden-beamed restaurant that makes you want to sip on a hot cup of tea and get lost in an old picture of a Korean home on the wall.\n\nMeals aren't just for social media, they're for real socializing: friends dipping slices of pajeon in soy sauce, cousins layering bites of bossam and slurping spoonfuls of jjigae.\n\nThe exception to the \"groups are better\" rule is lunch, when Kobawoo House offers $20-ish specials for individual portions of bossam and stew. It's one of the best and most affordable ways to experience the dish, and always a great solo dining idea.\n\nKobawoo House's tight menu hasn't changed much over the years, either. Every meal starts with a bowl of purple rice and a small spread of classic banchan (including soy-braised beef) before your soups, tangy acorn noodles, and platters arrive.\n\nGlistening, slow-cooked bossam may be the obvious choice, but don't stop there. LA's less shiny stuff deserves love, too.\n\nMeet the aforementioned famous platter of thinly sliced pork belly—some fatty and chewy, others meatier—lined up like dominoes. The pork is neutral in flavor, and it's best when loaded up with some acidity and funk. So stack each slice with few strips of kimchi and a dab of salty fermented shrimp before wrapping it in a sheet of napa cabbage or radish.\n\nThere are lots of good options for stew here, but this bubbling red soup with aged kimchi, huge braised chunks of beef and pork belly, potatoes, tofu, and rice cakes is our favorite."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Kobawoo House",
      "url": "https://www.timeout.com/los-angeles/restaurants/kobawoo-house",
      "published_at": "2025-08-21",
      "trust_level": "editorial",
      "content": "For the last four decades, this family-run restaurant in Koreatown has served some of the city's finest bossam: a build-your-own sliced pork belly dish that comes served with thinly sliced pickled vegetables, including daikon radish and Napa cabbage, plus other types of flavorful kimchi.\n\nOther traditional dishes, including the seafood pancake, kimchi jjigae and stir-fried calamari are wonderful as well, though Kobawoo's claim to fame is still the family-style bossam.\n\nOn weekdays, diners can also enjoy a lunch special menu from 11am to 3pm, which includes an individual-sized bossam and soybean paste stew combo, and the vegan-friendly jangban guksoo (acorn noodles with vegetables)."
    }
  ]
}