{
  "place_slug": "kuya-lord",
  "sources": [
    {
      "source_id": "src_theinfatuation_2022",
      "publication": "The Infatuation",
      "title": "Kuya Lord - Review - East Hollywood - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/kuya-lord",
      "published_at": "2022-09-28",
      "trust_level": "editorial",
      "content": "Among the many fast-casual restaurants in LA, Kuya Lord seems like another great spot to put in your rotation. You could easily stop in for a quick chicken rice bowl and be out the door in under eight minutes. And while we're not going to deter you from doing that, you should also plan to stop and stay awhile—there's a lot more going on at this Filipino restaurant in East Hollywood than meets the eye. Because while Kuya Lord does have the efficiency of a counter service restaurant, it also offers incredible food, and the soothing, personal atmosphere of a family-run restaurant.\n\nKuya Lord originally started as a pop-up. The chef sold takeout trays out of his private residence during the pandemic, a time when DMing strangers and showing up at their house for dinner wasn't out of the ordinary. These days, it's operating out of a tiny cafe space at the corner of Melrose and Western, but the food is just as spectacular as when we named it one of our most memorable meals of 2020.\n\nWith a front counter, some scattered tables, and news clippings framed on the wall, the space is straightforward, but not without warmth. The chef periodically comes out of the kitchen to hang with the diners, sharing stories about growing up in Lucena, Quezon, or explaining how the noodle special reminds him of a specific moment from his childhood in the Philippines.\n\nThere are dozens of ways to order at Kuya Lord, but the pick-your-protein tray is the best way to sample the many highlights in one sitting. This massive platter comes with sticky garlic java rice, pickled papaya, tomato salad, and thick, chewy pancit you'll be thinking about for a long time. For the protein, we love the hearty longtapsilog, a combination of savory or sweet pork sausage, grilled beef short ribs, and two fried eggs stacked over the rice.\n\nIf there's a house specialty at Kuya Lord, it's this crescent-shaped rolled pork belly—a dish you need to order every time you visit. The meat is moist and salty, and the right amount of fatty without being too rich. What takes this dish to the next level, though, is the crispy skin, which is so crunchy you can barely hear the person across from you talk when you take a bite.\n\nOur favorite way to eat these saucy, garlicky prawns is atop one of the individual rice bowls: the thick, rich crab sauce slowly smothers the java rice, creating a garlic explosion that will stay on your lips until the next day. Be warned though, this dish can get messy. As you twist off the prawn heads, sauce will fly, so either make yourself a napkin bib or have a Tide stick handy.\n\nEven if you weren't able to get through half of your Kuya Tray, find a way to make room for this dessert. It's essentially a riff on key lime pie made with calamansi and topped with pandan whipped cream, which lends a strong, floral vanilla flavor. Unlike most dishes here, it's quite small and just enough for two to share."
    },
    {
      "source_id": "src_laist_2024",
      "publication": "LAist",
      "title": "He Was Just Named Best California Chef. Here's Why It's Also A Win For Filipino Americans",
      "url": "https://laist.com/news/food/los-angeles-chef-wins-james-beard-award-lord-kuya",
      "published_at": "2024-06-11",
      "trust_level": "editorial",
      "content": "L.A. Chef Lord Maynard Llera took home top honors Monday night — a coveted James Beard Award for Best Chef: California — for his unique heart-and-soul take on Filipino barbecue.\n\nThe Beard Awards are like the Oscars of the food world. And Llera, the owner-chef at Kuya Lord, was the only Los Angeles chef to be nominated this year, which was an accomplishment in and of itself.\n\nThe menu channels Llera's unique take on southern Filipino-style cooking. In particular, Kuya Lord is known for its lechon kwali, a twice-cooked pork belly that manages to walk the line between a crispy, crackly outside and succulent inside.\n\nWhile the win introduces Llera to the world, the recognition of his talents is long overdue. Back in 2022, L.A. Times Food critic Bill Addison called Llera \"a gripping new expressionist of Filipino cooking — a talent whose time had arrived.\"\n\nLlera started with a pandemic pop-up and leveraged it into the fast-casual concept located in the microneighborhood of the moment, Melrose Hill.\n\nHis victory — best California chef! — represents a win for Los Angeles and Southern California, and for the many Filipino Americans who call SoCal home. Moreover, Llera's win raises the profile of a cuisine that many would say has gone overlooked for far too long.\n\n\"It's just surreal,\" he said after his win Monday night. \"I came here 20 years ago from the Philippines with a dream of opening a restaurant.\""
    },
    {
      "source_id": "src_timeout_2024",
      "publication": "Time Out LA",
      "title": "L.A.'s Lord Maynard Llera of Kuya Lord earns James Beard Award for best chef in California",
      "url": "https://www.timeout.com/los-angeles/news/heres-where-you-can-try-food-from-james-beards-best-chef-in-california-061124",
      "published_at": "2024-06-11",
      "trust_level": "editorial",
      "content": "Last night, the James Beard Foundation Awards took place in Chicago, crowning U.S.-based chefs and restaurants with some of the most sought-after titles across the culinary world. This includes L.A.'s very own Lord Maynard Llera of Filipino eatery Kuya Lord—and one of the city's very best restaurants. An alumnus of Bestia and Bavel, Llera took home the prize for Best Chef: California. If you ask us, it's a well-deserved title, given the chef-driven Filipino food that he serves out of his scrappy East Hollywood restaurant.\n\nDuring the pandemic, Kuya Lord began as a pop-up, which Llera operated out of his home garage in La Cañada Flintridge. Despite the fact Kuya Lord has limited seating and a lack of convenient parking, the gastronomic guru's gourmet twists on classics—lechon, a traditional spit-roasted pork dish, served two ways and Filipino stew kare-kare, among others—quickly drew local and national acclaim after Llera opened the fast-casual storefront in 2022.\n\n\"I want to thank my wife, who came here to America to be with me and to support me since day one,\" Llera said during his acceptance speech, referring to his childhood in Lucena City in the Philippines. \"Without her, Kuya Lord wouldn't be here now … this recognition is not just a testament to my individual efforts and hard work but a reflection of the support and encouragement and collaboration from many wonderful people in my life. I am fortunate enough to have mentors, friends and family all throughout this journey.\"\n\nAlready a popular destination among locals and tourists alike, we suspect that Kuya Lord will be suddenly inundated with a mass of folks craving chef-driven, thoughtfully presented and downright tasty Filipino food. You might want to join the crowd."
    },
    {
      "source_id": "src_timeout_2022",
      "publication": "Time Out LA",
      "title": "The 14 best new L.A. restaurants of 2022",
      "url": "https://www.timeout.com/los-angeles/restaurants/best-new-restaurants-of-2022",
      "published_at": "2022-12-12",
      "trust_level": "editorial",
      "content": "In 2022, Time Out checked out over 60 brand-new restaurants across greater Los Angeles, averaging at least five visits a month. Among them, we found great date night spots, plenty of solid neighborhood joints, a couple of duds and a handful of truly great places that we think might soon rank among the city's very best.\n\nFrom La Cañada to East Hollywood, Lord Maynard Llera's former garage pop-up has quickly become one of the city's best Filipino restaurants. Plus, the Bestia alum's fast-casual shop is adding fuel to the fire of the concept of \"Melrose Hill\" as a citywide dining destination—even if parking in the area is still a major hassle.\n\nHere, Llera adds a chef's twist to Filipino classics, from the lucenachon (lechon-style porchetta) to buttery pieces of grilled yellowtail collar served with housemade chili oil. The restaurant's signature Kuya tray with lechon kawali was one of our favorite meals of 2022: a family-style spread of rice, twice-cooked pork belly, pancit chami and pickled vegetables. Though prices run somewhat high for a fast-casual meal, the quality—and flavor—of every dish makes sure a trip to Kuya Lord is worth every penny."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "The 40 best restaurants in Los Angeles you need to try in 2025",
      "url": "https://www.timeout.com/los-angeles/restaurants/best-restaurants-in-los-angeles",
      "published_at": "2025-12-01",
      "trust_level": "editorial",
      "content": "Unlike many other places in Los Angeles, this place is worth the hype. James Beard Award-winning chef Lord Maynard Llera's mouth-watering lucenachon, buttery hiramasa collar and garlicky prawns will leave pork and seafood lovers on cloud nine. Whether you're ordering off the ever-changing specials menu or sticking to the signature trays (which easily feeds two), Bestia's former sous chef knocks it out of the park with gourmet flourishes like housemade pickled veggie and flavorful palm vinegar aged by Llera himself. Though prices run somewhat high for a fast-casual meal, the quality and flavor of every dish makes sure a trip to Kuya Lord is worth every penny. Though street parking in the area can be difficult, the Bank of America lot across the street costs just $4 for two hours after 4pm on weekdays and all day on weekends. These days, Kuya Lord also offers a private dinner menu for groups of six or more for about $100 per person plus tax and gratuity."
    }
  ]
}