{
  "place_slug": "larchmont-village-wine-spirits-cheese",
  "sources": [
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Larchmont Wine and Cheese - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/larchmont-wine-and-cheese",
      "published_at": "2025-04-03",
      "trust_level": "editorial",
      "content": "Before you leave the house, look in the mirror and take one thing off. It's a famous Coco Chanel quote that, to this day, remains one of the most relevant and important self-styling tips. Humans have a knack for overdoing things - in many facets of life - when it's simplicity that continues to win out. Building a proper sandwich is no different.\n\nTo be clear, there's a place for giant, cold-cut sandwiches stacked high with layers of meat and every topping imaginable, but the fact is, they can be overkill, too. Which is why eating at Larchmont Wine & Cheese, the classic sandwich counter in Hancock Park, is such a revelation. These are simple, straightforward sandwiches where the quality, not the quantity, of ingredients does the talking. That's also why they're some of our favorite sandwiches in the city.\n\nNow, Larchmont Wine & Cheese is hardly some diamond in the rough. Come to this upscale wine shop (the sandwich counter is hiding in the back) any day of the week and you'll find a line snaking out the door and people aggressively hovering outside in hopes of snagging a table. Sandwiches are technically served from 11am-5pm, but the reality is, your window is much shorter. When a certain meat runs out, that sandwich is retired for the day - and no amount of pleading will bring it back.\n\nOnce you do secure your food, another challenge commences: Patience. You can, of course, eat your sandwich immediately and have a perfectly enjoyable lunch. But if you can control your willpower for around ten minutes, and allow the olive oil and balsamic in the sandwiches to slowly soak into the crunchy baguette bread (skip the soft ciabatta), you'll be treated to excellence.\n\nLarchmont's menu is comprised of only seven sandwiches, plus the off-menu El Conquistador, and each one follows the exact same formula - simple construction and high-quality ingredients. And because of that, there is no such thing as a bad order here, just a personal preference for what you're in the mood for that day.\n\nThat said, if we were allowed to only eat one sandwich from Larchmont ever again, we'd pick the #5 on a baguette every time. Topped with imported prosciutto, mozzarella, and arugula, it's the epitome of what makes this place so special - ingredients so fresh and fantastic that there isn't a need to cover them up with anything else.\n\nWe also love the #3, which comes with soppressata salami, manchego cheese, and a thin layer of sun-dried tomato spread. It's slightly spicy and sweet, but with a salty pop from the manchego that elevates the whole thing.\n\nIf you want to be able to brag to your coworkers that you know more than them, get the El Conquistador, which resides on the daily specials board. It features the same manchego cheese, but with chorizo, prosciutto, and pickled peppers instead. It's easily the strongest-flavored sandwich on Larchmont's menu, and yes, Brad from accounting will be very jealous.\n\nWe don't know if Coco Chanel ever made (or ate) a sandwich in her life, but she was right about one thing - less is always more, and that absolutely holds true when you're at the sandwich counter. Just be sure to take off one of your puka shell necklaces before you go.\n\nSandwich #5\nThis is a top-five sandwich in the city. It's simple (only prosciutto, mozzarella, and arugula), perfectly constructed (allow a few minutes for the olive oil and balsamic to soak into the bread), and it tastes absolutely perfect. Each ingredient is good enough to stand alone on a dish, but here they are, together in one sandwich. Get the crunchy baguette instead of the ciabatta.\n\nSandwich #3\nIt's rare when our bodies aren't craving the #5, but when that special time arises, we always go for this equally tremendous sandwich. Topped with soppressata salami, manchego cheese, and a thin layer of housemade sun-dried tomato spread, there's more going on here than other sandwiches at Larchmont, and that's not a bad thing. Crunchy baguette for life.\n\nSandwich #4\nThis turkey and gruyere-filled sandwich is a great option for anyone who isn't in the mood for heavily cured meats. We aren't going to tell you it's healthier than Larchmont's other sandwiches, but it definitely tastes healthier, and frankly, that's what's important.\n\nTuna Salad\nIf there's any sandwich that probably won't be available when you go to Larchmont, it's going to be the tuna salad. Sometimes, it sells out in the first hour. Other times, they simply didn't make it that day."
    },
    {
      "source_id": "src_infatuation_2022",
      "publication": "The Infatuation",
      "title": "The 10 Best Restaurants In Larchmont",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-restaurants-in-larchmont",
      "published_at": "2022-01-21",
      "trust_level": "editorial",
      "content": "Simply put, there are sandwiches and then there are Larchmont Wine and Cheese sandwiches. This neighborhood wine shop might merely look like a place to pick up a good bottle of pinot (it is) but there's also a not-so-well-kept secret lurking in the back: one of the best sandwich counters in the city. There are only seven sandwiches on the menu, and though the #5 with prosciutto and mozzarella (on baguette, always) is a classic, we'd make a case you should order each of them at some point. Waiting in line can be annoying at lunch, so if you're in a rush, call in your order ahead. And grab a bottle on your way out."
    },
    {
      "source_id": "src_infatuation_2019",
      "publication": "The Infatuation",
      "title": "Where To Eat When You Just Want A Sandwich",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-sandwich-shops-in-los-angeles",
      "published_at": "2019-06-10",
      "trust_level": "editorial",
      "content": "When you first walk into Larchmont Wine and Cheese, you'll wonder why you're standing in the middle of a fancy wine shop. Don't worry - you're here for the tiny sandwich counter in the back. There, you'll find simple, fantastic sandwiches that will completely change what you fantasize about during your lunch hour. Our favorite is the #5 (Italian prosciutto, arugula, mozzarella, and olive oil), but the homemade tuna salad shouldn't be missed either. Just make sure you show up early - once they sell out for the day, they're done."
    },
    {
      "source_id": "src_infatuation_2025_best_sandwiches",
      "publication": "The Infatuation",
      "title": "The 22 Best Sandwiches In LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-sandwich-shops-in-la",
      "published_at": "2025-08-28",
      "trust_level": "editorial",
      "content": "Larchmont Wine & Cheese is a classic sandwich counter where things feel simple. It's like being transported back to the '60s or finally realizing you only need one streaming service and canceling all the others. This 50-something-year-old fromagerie is the only historic landmark in Beverly Hills we don't mind visiting over and over again. There is no deli case filled with cured meats or a mile-long menu of subs. Instead, you'll find a quirky counter in a deserted warehouse in Frogtown (or Chinatown) that combines just-baked bread, fresh produce, and listener-supported public radio. Sandwiches are named after NPR hosts like the Terry Gross, which is filled with roast turkey, green chili aioli, a jalapeño/radish slaw, and pepper jack cheese. The #5 is our favorite - a baguette topped with imported prosciutto, mozzarella, and arugula, but the off-menu El Conquistador is also a great option. It's filled with chorizo, prosciutto, manchego, and a few pickled peppers—the perfect addition to any picnic, or meal to celebrate your breakup with Netflix."
    }
  ]
}