{
  "place_slug": "lasa",
  "sources": [
    {
      "source_id": "src_infatuation_2022",
      "publication": "The Infatuation",
      "title": "Lasa - Review - Chinatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/lasa",
      "published_at": "2022-08-22",
      "trust_level": "editorial",
      "content": "Some restaurants need you to know they're a big deal. You'll wait 30 minutes for your table (even though you have a reservation), they won't let you sub out the peanuts you're deathly allergic to (even though they're only sprinkled on top), and they'll take another 30 minutes to bring you your check. Lasa is not that kind of restaurant. Lasa is actually kind of big deal, but they don't need you to know that. They're just happy you came to eat here. Originally operating as a pop-up in Far East Plaza, Lasa is now a full-time restaurant run by two brothers (one in the kitchen, one in the dining room) in the same space. During the day you can drop by and grab a rice bowl from a little window outside for lunch, and the place turns full-service at night. The dining room feels a little like a first apartment furnished with a single trip to Ikea, and there are Filipino dictionaries scattered around and family portraits on the walls. Given that it's hidden in a Chinatown plaza that's much busier during the day, when everyone in the world is waiting for Howlin' Rays, Lasa might feel a little out of the way for dinner. But eating here is worth the effort. Not just because of the excellent food, but because the people at Lasa are glad you came in, want to be friends, and actually hope you'll be back. Which you probably will. Normally you might be kind of annoyed that these chicharons are only pretending to be pork (they're made of rice flour), but when they're covered in addictive scallion and mushroom powder, you'll get over that pretty quickly. Start with these. According to our new friends (everyone who works here), this is an ideal way to introduce your table to Filipino flavors. The mix of radicchio, fruit, housemade cheese, nuts, and sugar cane dressing makes this salad sweet, salty, and sour at the same time. The duck is crispy and falls off the bone at the same time, the ginger and lemongrass broth underneath is excellent, and the words duck fat chilli oil have changed us. If it's hard to restrain yourself from ordering too many savory dishes, remember you need to keep yourself in check for this ice cream. It's creamy and smooth, and comes with a crunchy black sesame milk powder that we would like to sprinkle on all ice cream, forever. Unrated: This is a restaurant we want to re-visit before rating, or it's a coffee shop, bar, or dessert shop. We only rate spots where you can eat a full meal."
    },
    {
      "source_id": "src_latimes_2016",
      "publication": "LA Times",
      "title": "Jonathan Gold 101 Best Restaurants (2016 listing)",
      "url": "https://www.foodrepublic.com/2017/10/24/jonathan-gold-101-best-restaurants-los-angeles/",
      "published_at": "2016",
      "trust_level": "editorial",
      "content": "Lasa earned a placement on LA Times food critic Jonathan Gold's 101 Best Restaurants in Los Angeles list in 2017, where it ranked alongside restaurants like Vespertine, Providence, Spago, and Bestia. In July 2016, only months after starting their residency at Unit 120, Lasa earned a rave review from Pulitzer Prize-winning food critic Jonathan Gold, who cited the restaurant's food as possessing 'a lightness that I have never seen in Filipino cooking before.'"
    },
    {
      "source_id": "src_infatuation_2019",
      "publication": "The Infatuation",
      "title": "Downtown LA Dinner Guide - Lasa",
      "url": "https://www.theinfatuation.com/los-angeles/guides/downtown-la-restaurants-dinner",
      "published_at": "2019-01-10",
      "trust_level": "editorial",
      "content": "Lasa is technically in Chinatown, but it's worth the extra couple minutes in the car (and trips around the block looking for a parking spot) for their excellent modern Filipino food."
    },
    {
      "source_id": "src_resy_2020",
      "publication": "Resy (Editorial)",
      "title": "For Off Menu Week, Lasa is diving deeper into its Filipino roots",
      "url": "https://blog.resy.com/2020/02/lasa-los-angeles-filipino/",
      "published_at": "2020-02-14",
      "trust_level": "editorial",
      "content": "Owned by brothers Chad and Chase Valencia — the chef and master of the front-of-the-house, respectively — Lasa is Filipino at heart, with all the trappings of a seasonal, on-trend California restaurant. When Chad returned to L.A., he and his brother both worked at Jessica Koslow's Sqirl. Soon they started their Lasa pop-ups, which captured the attention of esteemed eaters like Jonathan Gold and Anthony Bourdain. Chad credits both with helping introduce Filipino cuisine to Los Angeles and beyond, and he feels a personal responsibility to continue leading people to all it has to offer. Lasa is, and was, our effort of trying to pursue Filipino food, or at least our version of it. As Filipino Americans, and Angelenos specifically, we want to figure out what makes sense here in L.A., what people are into. We're always seeing what different experiences we can offer within our four walls. Tucked inside the Far East Plaza in Chinatown, its interior features palm green walls inspired by the forest and hillsides around the Philippines. Dark brown tables feel communal by nature, whether you're with two or 20 people. It's a setting that beckons a casual feast."
    },
    {
      "source_id": "src_mabuhay_2021",
      "publication": "Mabuhay (Philippine Airlines)",
      "title": "With Lasa, has LA's Filipino food movement finally arrived?",
      "url": "https://mabuhay.philippineairlines.com/lasa-restaurant-los-angeles/",
      "published_at": "2021-01-26",
      "trust_level": "editorial",
      "content": "In July 2016, only months after starting their residency at Unit 120, Lasa earned a rave review in the Los Angeles Times from Pulitzer Prize-winning food critic Jonathan Gold, who cited the restaurant's food as possessing 'a lightness that I have never seen in Filipino cooking before.' We were speechless. It felt like we were being validated for what we were doing for our city, and for our Filipino community. It felt like we mattered. Though Filipino food has long been heralded as the next it cuisine, there exists only a smattering of notable modern Filipino dining experiences across the US, like New York's Maharlika and LA's Belly & Snout. The family team at Lasa, a permanent pop-up outlet in the heart of LA's Chinatown, are serving up their version of modern Filipino food to critical acclaim. Paired with traditional Filipino ingredients, Lasa's food can be best described as Filipino-Californian – the brothers' second generation response to the food they grew up eating. Born in LA to immigrant parents from Pampanga, known as the culinary capital of the Philippines, the Valencias have always been surrounded by their motherland's food. While Lasa has temporarily closed because of Covid-19 restrictions, the Valencia brothers promise a comeback when the time is ideal."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "At Lasita, well-executed Filipino dishes come served in a bright, airy space",
      "url": "https://www.timeout.com/los-angeles/restaurants/lasita",
      "published_at": "2025-07-12",
      "trust_level": "editorial",
      "content": "A bright, airy restaurant has emerged from the cocoon of Far East Plaza favorite Lasa, this time around with a simpler menu of well-executed Filipino dishes. Emerging out the pandemic, Lasita has found its groove as a relaxed, youthful spot with excellent rotisserie options and natural wine. Initially opened in 2016 as Lasa—an elevated Filipino tasting menu concept—current owners Chase Valencia and Steff Barros Valencia have since reworked the space with a more casual menu and atmosphere. Head chef Nico de Leon oversees a menu centered around two staple dishes, chicken inasal and pork belly lechon (the latter being the standard by which most Filipino restaurants are judged)."
    }
  ]
}