{
  "place_slug": "lasita-rotisserie-natural-wine",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Lasita - Review - Chinatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/lasita",
      "published_at": "2025-06-24",
      "trust_level": "editorial",
      "content": "At Lasita, there is no such wind-up. Because from the second you walk into this Filipino spot in Chinatown—and clock the big tables of friends drinking funky orange wine together and feasting on whole chicken—you realize the party is already in full swing.\n\nThis colorful rotisserie/wine bar is technically the second iteration of Lasa, the slightly more formal Filipino concept that had occupied the same Far East Plaza space starting in 2017. It was quite popular and we included it in our Best New Restaurants of 2017, but eventually, the two brothers who run the place decided it was time to change things up.\n\nWords like \"pared down\" and \"simplified\" can sometimes feel back-handed in describing a restaurant, but when we use it in regards to Lasita, it's the opposite. Sure, the menu is smaller now (it's essentially giant platters of meat like chicken inasal and pork belly lechon, plus an array of excellent rotating sides), but in streamlining, Lasita has created an experience free from pretension.\n\nWant to order a few bottles of natural wine with friends first and put in for a branzino a half-hour later? Go right ahead. Dining solo and low on time? Your server will make sure your chicken plate comes out quickly. Maybe you're on a date that's going better than expected and neither of you want to leave. Feel free to add and revise your order at any cadence you see fit. At Lasita, the only rule is there are no rules. And those are always the best kind of parties.\n\nThis is the main event at Lasita and whether you're with friends, roommates, lovers, or by yourself, make sure it hits your table. Their version of this rotisserie dish is rubbed with lemongrass and garlic, making it sweet and citrusy, with a slight acidic bite at the end. We'd say you don't even need the vinegar-based garlic mojo or the spicy salsita made with fermented bird'seye chilies that come on the side, but you actually do.\n\nLasita has two different sisigs on its menu, and you want this one. For starters, this mushroom, onion, and birds eye chili filled platter isn't any less decadent than its pork belly brethren. Secondly, save your pork belly quotient for the lechon that's still to come.\n\nThere are approximately one thousand different beef tartares served in LA restaurants, and most of them are indistinguishable. Lasita's has no such issue. The main separation factor is the shallot confit aioli, which gives a rich, subtly sweet punch to every bite. The buttery \"Skyflakes\" crackers on the side are a fun touch, too.\n\nSpeaking of meat parade, make sure this dish is a part of it. The rolled pork belly has been brined, stuffed, and marinated with lemongrass, onions, and ginger. The aromatic sweetness balances out the richness of the meat perfectly, and the crispy skin provides just the right amount of crackle.\n\nFilled with spinach, oyster mushrooms, and thin, slightly chewy yakisoba noodles in a garlic-calamansi sauce, this dish is surprisingly light and a great way to break up the meat parade that is currently directed at your table. If you're by yourself, it's definitely substantial enough to be its own entree.\n\nCitrusy calamansi custard comes, layered on a butter graham cracker crust, topped with salted whipped cream. We don't care how bad your meat sweats are, this dessert has to hit the table.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "At Lasita, well-executed Filipino dishes come served in a bright, airy space",
      "url": "https://www.timeout.com/los-angeles/restaurants/lasita",
      "published_at": "2025-07-12",
      "trust_level": "editorial",
      "content": "A bright, airy restaurant has emerged from the cocoon of Far East Plaza favorite Lasa, this time around with a simpler menu of well-executed Filipino dishes.\n\nEmerging out the pandemic, Lasita has found its groove as a relaxed, youthful spot with excellent rotisserie options and natural wine. Initially opened in 2016 as Lasa—an elevated Filipino tasting menu concept—current owners Chase Valencia and Steff Barros Valencia have since reworked the space with a more casual menu and atmosphere. Head chef Nico de Leon oversees a menu centered around two staple dishes, chicken inasal and pork belly lechon (the latter being the standard by which most Filipino restaurants are judged). Both dishes are a showcase of why, oftentimes, simpler is just better.\n\nLeon's spectacular atchara (pickled vegetables) pair beautifully with the flavorful, moist inasal and crispy, crackly pork belly, available by the half-pound or in a combo plate. Each of Lasita's well-made dipping sauces is so delicious and distinctive, you'll likely want to order a trio.\n\nAmong the rotating, slightly uneven selection of starters, I also like the seasonal fish kinilaw, pancit canton and smoked pork longganisa (a chorizo-like sausage)—but you can't go wrong with Lasita's wedge salad, dredged in a refreshing coconut green goddess dressing.\n\nTime Out tip: Order the fruity halo-halo for dessert. Unlike most halo-halos, Lasita's version is completely vegan thanks to coconut gelato and tampico-coconut milk.\n\nThough the menu is simpler than the much-loved Lasa, there are still some delights at this Far East Plaza spot."
    }
  ]
}