{
  "place_slug": "le-comptoir",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Le Comptoir - Review - Koreatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/le-comptoir",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "On the nights when you want a dinner party atmosphere, but not all the work that comes with it, get a few seats at Le Comptoir instead. Located on 6th St in Koreatown, Le Comptoir is a tiny prix-fixe restaurant made up of one long wooden counter with eight chairs. If you've ever stumbled past its big windows on a soju-drenched night in Ktown, you probably assumed the space was some sort of testing kitchen or exclusive pop-up for people who keep track of pop-ups. Le Comptoir is neither. It's basically just a guy and his two friends cooking dinner for three hours.\n\nLE COMPTOIR'S BARE-BONES SPACE ISN'T GOING TO WIN ANY WARM AND FUZZY AWARDS, AND THEY WILL ALMOST CERTAINLY MAKE A MISTAKE RIGHT IN FRONT OF YOU - BUT THAT'S WHAT MAKES A MEAL HERE FEEL PERSONAL.\n\nSure, spending $90 for a nine-course meal (plus an optional $46 add-on wine pairing) isn't exactly most people's idea of casual dining, but given the average price point of the better prix-fixes in town, Le Comptoir's almost feels like you're getting away with something.\n\nLE COMPTOIR'S MENU CHANGES FREQUENTLY, BUT YOU CAN EXPECT TO EAT A LOT OF VEGETABLES.\n\nThey get everything from an urban farm in Long Beach, and before you mumble \"of course they do,\" know that the difference here is very apparent. In a town where eating fresh vegetables is your constitutional right, Le Comptoir's are some of the best you'll find. They aren't dressed up or hiding under congealed dressing - most dishes are just fresh vegetables, cooked extremely well.\n\nThere are meat supplements available throughout the menu for additional pricing, but aside from the ribeye at the end, you can skip them. The vegetable-based dishes are simply better.\n\nWe realize most at-home dinner parties don't involve open kitchens, assistant chefs, and things called kale stem duxelle, but Le Comptoir has proven you can have all of those things, and still feel like you're eating dinner with friends.\n\nLE COMPTOIR'S MENU CHANGES FREQUENTLY. HERE ARE SOME OF THE THINGS WE ATE:\n\nThis is essentially a creamy yam soup with sheep's milk yogurt and easily our favorite thing on the menu. You'll take one bite of it and immediately start strategizing how to get the chef to give you more. This dish is basically a showcase for the urban farm in Long Beach that the chef pulls all his produce from. It's absolutely just a plate of grilled vegetables and fruit, but it is excellent. Served in a skillet with greens, lemon, and brown butter, this adds a very savory kick to a meal that, given its very vegetable-heavy beginning, needs it.\n\nLe Comptoir's only true dessert on the menu is definitely good, but they also only give you one single donut hole, which feels like a form of torture. Give us two. Ok, three."
    },
    {
      "source_id": "src_michelin_2020",
      "publication": "Michelin Guide",
      "title": "Chef Gary Menes Finds Perfection in the Garden",
      "url": "https://guide.michelin.com/us/en/article/people/chef-gary-menes-le-comptoir-los-angeles",
      "published_at": "2020-05-04",
      "trust_level": "editorial",
      "content": "The chef of Le Comptoir in Los Angeles talks vegetables, famous French chefs, and sourdough.\n\nOn a quintessential Southern Californian evening a few years ago, Chef Gary Menes was serving a 10-course tasting menu to a small group of diners. The sixth course, typically a crescendo of meat on ambitious tasting menus like his, was, in fact, a 60-day aged Musquee de Provence — a slice of pan-seared pumpkin. Menes moved from plate to plate, shaving flutters of white mushroom over each serving. Not white truffles but a humble white mushroom. As one of those diners, that was the moment I understood exactly what Gary Menes stood for as a chef. In his words, it's about putting the vegetable on a pedestal.\n\nMenes has been preparing his vegetable-forward tasting menu since 2011 (the concept was a pop-up for three years before landing at its current address within the Hotel Normandie in Koreatown).\n\nMenes mostly plants heirloom seeds from Baker Creek in his organic urban farm. Eventually, three generations of the Menes family settled in Long Beach, California. Menes' grandparents started growing and selling vegetables not commonly found in supermarkets at the time but longed for by other immigrant communities. Menes recalls being in their garden and around dirt all the time. Though food was an interest even then, as the first-born son to immigrant parents, Menes was encouraged to be practical and to go to college. He complied, graduating with a degree in business and a minor in art history from Cal State Dominguez Hills, but the magnetic pull of the kitchen was impossible to resist. Menes intended to enroll in a culinary program after college, jumping from one school to another, but he didn't have the requisite restaurant experience. Menes was inspired after seeing the vegetarian menus at restaurants like The French Laundry.\n\nToday, Le Comptoir is temporarily closed in compliance with California's shelter-in-place mandate. Menes spends his time working in the farm and with his family (his wife is a frontline medical worker and they have four children). He's itching to get back into the kitchen but is adamant that the circumstances have to be right. Social distancing in such a petit dining room is just not an option. In the meantime, he is channeling his creative energy into a weekly sourdough bread bake. This isn't just pandemic bread-baking. A slice of Menes' expertly open-crumb sourdough has been a highlight of his tasting menu since the beginning of Le Comptoir. His starter is older than his children. As a chef known to get deeply involved with everything on his menu, from nurturing vegetables out of the earth to geeking out on single-origin coffee, it's no surprise that he uses rye, Rouge du Bordeaux, and whole wheat, which he gets from growers around California. Baking is more than a hobby but capacity is limited — Menes only makes around 12 loaves at a time, and they sell out quickly. The baking keeps him connected to cooking and to his guests. \"It's the same intense focus I would have at the restaurant,\" he said. \"It goes with my theme. Everything is impeccable.\""
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out Los Angeles",
      "title": "Review: Le Comptoir gives SoCal produce the traditional (dull) French treatment",
      "url": "https://www.timeout.com/los-angeles/restaurants/le-comptoir",
      "published_at": "2025-06-14",
      "trust_level": "editorial",
      "content": "This pricey vegetarian tasting menu in Koreatown reads as pure Michelin fodder—nothing more, nothing less.\n\nRun by French Laundry alum Gary Menes, the 10-seat chef's counter inside Hotel Normandie dates back to 2014, with previous pop-up stints in Glendale and Downtown, and was awarded a star when the Michelin Guide returned to L.A. in 2019. While this makes Le Comptoir a relatively long standing trailblazer in the realm of plant-based fine dining, a meal here—though interesting, painstakingly sourced and obviously well-made—is unfortunately nothing to write home about in terms of actual flavor. In this way, the Koreatown chef's counter is no different from the famed Napa Valley restaurant where Menes first cut his teeth professionally, part of an elegantly stagnant scene which the New York Times described as \"delicious and dull.\" Compared to that milieu, Menes, a Long Beach native, has put his own unique spin on an elaborate, tweezer-appointed tasting menu, but the core of Le Comptoir remains welded to the timeless, if slightly boring pairing of time-honored French cooking techniques and seasonal produce.\n\nTHE FOOD:\n\nGarlic and brown butter are friends, but Le Comptoir's use of both with their vegetables, pasta and proteins feels almost lazy. The repetition of butter across so many courses makes the experience feel heavy-handed and predictable. Nearly every dish felt as though it could have been plated differently to feel more inspired.\n\nTHE VIBE:\n\nA reservation-only 10 seat chef's counter inside the slightly shabby Hotel Normandie. Special occasion couples, all gussied up, dine alongside more casually dressed Michelin star-chasers, but general ambience will vary depending on the night.\n\nTHE DRINK:\n\nA $125 French wine pairing amounting to about three full glasses of wine—which raises the per-head price of dining at Le Comptoir to $300, a price point with an abundance of other options in L.A. You can also order single-origin coffee at the start of the meal for dessert.\n\nTHE VERDICT:\n\nThough plenty of diners come to Le Comptoir for the epicurean thrill of dining up close and personal with Menes or the entirely vegetarian cuisine, the current price of the standard tasting menu ($125 per head, rising to $162 with gratuity and fees) doesn't adequately justify what the diner receives in either taste or portion size. Though the chef himself doesn't currently consume meat, seasonal add-ons like Maine lobster and Berkshire Farms pork belly are available. With less expensive but equally innovative tasting menus having taken L.A. by storm, Angelenos currently have a plethora of options in the under $200 range. Unless you're vegan or vegetarian, Le Comptoir likely shouldn't make your final cut.\n\nTime Out tip: If the contents of this review or sheer price point haven't deterred you from booking a table, then you should preorder one of Menes' excellent sourdough loaves, which you can add onto your reservation."
    }
  ]
}