{
  "place_slug": "lermitage-beverly-hills",
  "sources": [
    {
      "source_id": "src_hollywoodreporter_2024",
      "publication": "The Hollywood Reporter",
      "title": "L'Ermitage Beverly Hills Gets a Major Glow-up — and Two Michelin Keys — for Its 50th Birthday",
      "url": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/lermitage-beverly-hills-new-restaurant-costa-covo-osteria-1236071679/",
      "published_at": "2024-11-26",
      "trust_level": "editorial",
      "content": "Just in time to celebrate its fiftieth birthday in 2025, L'Ermitage Beverly Hills undertook a major top and bottom renovation, reimagining and expanding its public spaces. The property opened on a residential stretch of Burton Way in 1975, originally as an apartment building before a swift conversion to an all-suite five-star hotel. Its facelift began on the ground floor, which now has a bright new look courtesy of New York-based Champalimaud Design (responsible for revamping the original Raffles Hotel in Singapore and the rural Troutbeck resort in the Hudson Valley). The ground level's original 1970s dark-neutral palette, subdued look and low ceilings were swapped for zappy orange accents and a feeling of space — all without sacrificing the building's Modernist style. On the strength of its subtly sumptuous guest rooms and superb service, L'Ermitage gained two keys on Michelin's 2024 list. The renovation of L'Ermitage's vaunted rooftop pool deck will stretch into winter. Efforts now focus on completing the rooftop, where the revamped pool is to be joined by a new restaurant, Poza, and an expansive event space. The iconic hotel's top-to-bottom renovation begins on the ground floor, with a dazzling new look and chef Todd Matthews' vibrant restaurant, Costa Covo Osteria."
    },
    {
      "source_id": "src_outthere_2025",
      "publication": "OutThere",
      "title": "L'Ermitage Beverly Hills, Los Angeles, California - Hotel review",
      "url": "https://www.outthere.travel/lermitage-beverly-hills-los-angeles-california-usa/",
      "published_at": "2025-06-30",
      "trust_level": "editorial",
      "content": "L'Ermitage Beverly Hills is a Los Angeles hotel where it's as if you've been let in on a secret. To the casual, unknowing eye, L'Ermitage Beverly Hills could easily be overlooked – and actually, that's sort of the point. It's not perched on a hill, nor does it blaze with fashion-week flair like its louder neighbours. Instead, it's the sort of hotel where you feel as if you've been let in on a secret: a place for those in the know. And tucked quietly, elegantly, just a few blocks off it all – including the designer drag of Rodeo Drive – is L'Ermitage Beverly Hills. Location-wise, L'Ermitage is the hotel equivalent of taking a breath. They've even made a special home here for L'Ermitage's infamous Chief Concierge, Christine Grimm, a distinguished member of Les Clefs d'Or, the elite global network of hotel concierges. Just off the lobby is Costa Cova Osteria. The food here was exceptional, at every meal sitting. Seasonal, locally sourced and executed with flair, dishes range from Californian to more indulgent fare with Mediterranean-leaning flourishes. Downstairs, the rooms at L'Ermitage Beverly Hills were, to put it plainly, massive. Bright, modern and blessed with balconies, they offer a rare kind of spaciousness in the city. Our suite felt wrapped in calm: golden hues, soft greys, honeyed woods and crisp white linens (personalised with our initials), with the sort of bright, flattering soundstage lighting that made us look ten years younger in the mirror. In a city of hotels that practically demand you pick a tribe and pledge allegiance (are you a Beverly Hills Hotel hound, a Four Seasons type or a Sunset Tower soul?) L'Ermitage carves a more down-to-earth, thoughtful niche as an elegant outlier. A boutique that acts like a grande dame. A five-star with its feet on the ground."
    },
    {
      "source_id": "src_thearcadiaonline_2024",
      "publication": "The Arcadia Online",
      "title": "L'Ermitage Beverly Hills Unveils Stunning Design Transformation",
      "url": "https://www.thearcadiaonline.com/lermitage-beverly-hills-unveils-stunning-design-transformation/",
      "published_at": "2024-04-18",
      "trust_level": "editorial",
      "content": "L'Ermitage is a true hidden gem, situated on a palm-lined residential boulevard, minutes from the heart of Beverly Hills. Established in 1975, it is the longest-tenured Forbes Five-Star and AAA Five Diamond all-suite hotel in the world. A firm favourite of esteemed international guests and locals alike, L'Ermitage (meaning 'the hideaway' in French) offers a discreet but elevated residential-style experience in Beverly Hills. The property is home to 116 spacious suites, all of which preserve the elegance of the hotel's original design. They come complete with walk-in wardrobes, private French balconies and oversized bathrooms, evoking a sense of old Hollywood glamour. The pet-friendly hotel is also home to a restaurant, bar, rooftop pool and wellness studios. From March 2024, to tie in with the Oscars, skincare expert Joanna Czech took up residency at L'Ermitage, her first Los Angeles Studio. She has personally crafted a bespoke menu of select facials and body treatments and her skincare products will be available for those looking to revitalise their routine. L'Ermitage Beverly Hills stands among some of the finest hotels in LA. It rather feels like a mix between a sophisticated private club and a gracious urban residence, paying homage to its history as a residential property."
    },
    {
      "source_id": "src_beverlyhillscourier_2024",
      "publication": "Beverly Hills Courier",
      "title": "City Council Approves New Rooftop Restaurant at L'Ermitage Hotel",
      "url": "https://beverlyhillscourier.com/2024/02/10/city-council-approves-new-rooftop-restaurant-at-lermitage-hotel/",
      "published_at": "2024-02-10",
      "trust_level": "editorial",
      "content": "The Beverly Hills City Council has unanimously approved L'Ermitage Beverly Hills' application for a new rooftop restaurant and expanded ground floor restaurant. While several of the city's luxury hotels currently feature rooftop restaurants, L'Ermitage is located within a residential area where such uses are not permitted and needed a zoning amendment to move forward with its dining dreams. The amendment allows the hotel to bring a kitchen, bar and full-service restaurant to its roof; extend its dining hours; and add new dining space to its ground floor. The approval comes with 33 conditions designed to mitigate noise, parking and privacy impacts to the surrounding neighborhood. L'Ermitage began the process of seeking approval for its dining expansion three years ago in an effort to maintain its competitiveness within a market of some of the world's foremost luxury hotels. These updates will allow the hotel to take full advantage of existing facilities by creating additional dining options that our clients expect, and our competitors already offer."
    },
    {
      "source_id": "src_beverlyhillscourier_2020",
      "publication": "Beverly Hills Courier",
      "title": "L'Ermitage Hotel Acquired for $100 Million",
      "url": "https://beverlyhillscourier.com/2020/08/13/lermitage-hotel-acquired-for-100-million/",
      "published_at": "2020-08-13",
      "trust_level": "editorial",
      "content": "The Viceroy L'Ermitage Beverly Hills Hotel, the luxury property seized by the United States Government as a part of an international investigation into foreign bribery and embezzlement of Malaysian state funds, has an anonymous, prospective buyer who has agreed to pay $100 million for the hotel. The hotel opened on tree-lined Burton Way in 1975, the work of brothers Severyn and Arthur Ashkenazy, Polish Jewish immigrants who came to the U.S. after World War II. The namesake of the hotel, the famed Hermitage museum in St. Petersburg, hinted at the property's dual role as a luxury hotel and high-end art gallery. But the Ashkenazys' tony hotel empire, which also included Le Bel Age and the Mondrian in West Hollywood, came crashing down in 1986, when they declared Chapter 11 bankruptcy. The L'Ermitage wound its way through multiple real estate portfolios and numerous renovations until 2010, when it was purchased by 38-year-old Malaysian financier Jho Low for $46 million."
    }
  ]
}