{
  "place_slug": "little-doms",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Little Dom's - Review - Los Feliz - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/little-doms",
      "published_at": "2023-08-23",
      "trust_level": "editorial",
      "content": "People can't seem to get enough of Little Dom's. The nearly 20-year-old restaurant in Los Feliz remains busy on a nightly basis, beloved by the hill dwellers of the neighborhood looking for a worn-in standby or a backdrop for any fun occasion. And we get it. Despite its often flat Italian American food, dinner here feels undeniably good—as if you've sunken into a bathtub of warm marinara. Ultimately, Little Dom's is too mind-numbingly comfy to care about that bowl of watery spaghetti.\n\nTrendy red sauce nostalgia partially explains Little Dom's popularity, but so does the way the restaurant makes people feel. There's a warmth running through every red booth, plate of agnolotti, and glass of nebbiolo. You can see it on the faces of couples on dates and boisterous showbiz types cracking jokes with pappardelle dangling out of their mouths. Even though the restaurant opened roughly around the same time as the launch of the iPod Classic, its interior mimics an old-timey pasta parlor.\n\nYou'll end up at Little Dom's at some point for reasons that have nothing to do with the quality of the food. (Need a casual, not-too-pricey venue for a birthday dinner? Here's one. Want to eat pancakes on a shady Los Feliz sidewalk? Right this way.) And when you're sitting in the dining room, admiring the dried pomodoro on your lover's chin, there's a good chance you won't mind the fact that eating wasn't what brought you here in the first place.\n\nThese crispy, mozzerella-filled arancini are delicious but a bit stodgy. So when you're half-way full by the time the entrees arrive, you'll know the culprit.\n\nThink Communion wafer sans Catholic guilt. This is the only pie on the whole menu, and you can add whatever toppings you see fit to its razor-thin canvas. We go for the white anchovies for a nice salt punch. Order this for the table as a snack between courses.\n\nScuff marks on the bar, handrails, and floors prove that this restaurant has been aggressively loved. Fuzzy Feels™ alone do not produce great Italian food, though, and Little Dom's red sauce classics look better than they taste. Marinara turns bland dishes into marinara-flavored bland dishes. Chicken parm registers as boring, thin pizzas disintegrate like burnt crackers in a swimming pool, and the calamari packs on the dredging as if it's a bulletproof chicken tender. But then there's the good stuff, like ooey gooey arancini and a perfectly cooked hanger steak that runs for less than $30.\n\nOverall, brunch works much better than dinner. If there was ever a time to take advantage of Little Dom's sidewalk patio, it's during the day when you can people-watch and eat fluffy ricotta pancakes, french toast soufflé, and smoked salmon pizzas (think salmon on wafers but jumbo-sized).\n\nEat this cutlet while it's hot. That's when the layer of mozzarella is soft and stretchy, and the marinara hasn't sogged the dredging yet. If only this cutlet was a little crispier around the edges, we'd be cooking with gas.\n\nWe've paid much more for steaks with this kind of smoky char on the outside and a beautiful pink center. If you eat meat, get this. It's the best dish we've eaten here.\n\nThis is the anti-tiramisu. She's not airy and light, but dense and creamy like a tub of clotted cream. One bite is enough."
    },
    {
      "source_id": "src_timeout_la_2024",
      "publication": "Time Out LA",
      "title": "Little Dom's | Restaurants in Los Feliz, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/little-doms",
      "published_at": "2024-07-15",
      "trust_level": "editorial",
      "content": "Since opening in 2008, this popular neighborhood joint—a younger sibling to the now-defunct Dominick's in West Hollywood—has stayed bustling with hipsters, young families and celebs alike. Open for breakfast, lunch and dinner, Little Dom's offers everything from scrambled eggs bruschetta to meatball sandwiches to whitefish piccata. The ricotta and blueberry pancakes are absurdly good, while the three-course Monday-night supper for $25 is a steal."
    },
    {
      "source_id": "src_theinfatuation_losfeliz_guide_2022",
      "publication": "The Infatuation",
      "title": "The 16 Best Restaurants In Los Feliz - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-restaurants-in-los-feliz",
      "published_at": "2022-01-21",
      "trust_level": "editorial",
      "content": "Little Dom's embodies the retro feel of this Eastside neighborhood in so many ways: there are vintage wooden booths, the bar belongs in a 1950s mob flick, and the menu is pure red sauce Italian with chicken parm and spaghetti with meatballs. In recent years, Little Dom's brunch has become its main attraction, thanks in part to their signature ricotta blueberry pancakes."
    }
  ]
}