{
  "place_slug": "lolo-wine-bar-restaurant",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Lolo Wine Bar - Review - East Hollywood - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/lolo-wine-bar",
      "published_at": "2024-03-09",
      "trust_level": "editorial",
      "content": "If the golden age of tabloids wasn't already in the past, you'd probably see paparazzi lurking outside Lolo. This East Hollywood hangout is the kind of pasta-and-pét-nat spot where off-duty celebs have candlelit catch-ups with friends, singles get dressed up to strut across the checkered floor, and dates lock eyes under massive monstera trees. Lolo isn't a crowded clubstaurant with hour-long waits on random weeknights, though. If you're looking for a fun place to show off a new haircut without blowing a whole paycheck, this casual wine bar/dinner spot on Sunset is a fine option.\n\nThere are two very different routes to a memorable night at Lolo: sit at the bar and clink glasses with a group of art school dropouts you'll never see again, or a group dinner at a patio table surrounded by hot people on their third glass of chablis. Both paths lead directly to Lolo's bottle shop around back, which has dozens of options in the $50 to $60 range.\n\nThe selection spans from sparkling pinot gris made in some remote French village to orange wines aged in Catalonia—the staff is helpful, but don't expect a ton of wine guidance. Most people just spring for their two-pack bottles bundle—it's a great value if you're planning on getting a little rowdy.\n\nThe least exciting part of a night at Lolo will probably be the food. The menu of Italian-leaning, broadly European dishes is the stuff of many bistros across Hollywood. There is, of course, cacio e pepe and tuna tartare, as well as a plate of prawns charred in all the right places and doused in garlic and lemon. The juicy bar steak is a solid choice if you want to leave feeling full, without spending triple-digits on a small plate soirée. But that all feels sort of beside the point. You're ultimately here to eavesdrop on Rachel Sennott and Kristen Stewart during a Wednesday night wine down.\n\nThe desserts at Lolo are pretty disappointing overall. This one is fine if the table wants something to share, but we'd advise you to pay up and walk a block north for taro cakes at Bhan Kanom or Thai gelato at Kanomwaan instead."
    },
    {
      "source_id": "src_timeout_2024",
      "publication": "Time Out LA",
      "title": "Lolo Wine Bar | Bars in East Hollywood, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/lolo-wine-bar",
      "published_at": "2024-02-20",
      "trust_level": "editorial",
      "content": "With limited seating and absolutely no reservations, Lolo Wine Bar in East Hollywood is a hard sell for anyone trying to corral a group of friends who live across the city. For neighborhood locals, those willing to show up early and people who don't mind having to wait, this gold-tinged natural wine bar with a small, chic checkered floor patio and excellent food menu is yours for the taking.\n\nLolo's house-made pastas, market-fresh vegetables and other small plates rise beyond the standard wine bar charcuterie fare, all while paired with an extensive list of wine bottles and a few choice wines by the glass. They also operate a wine shop (pickup only), including 6-bottle and 12-bottle variety packs for the regular at-home drinker."
    }
  ]
}