{
  "place_slug": "los-cinco-puntos",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Los Cinco Puntos - Review - Boyle Heights - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/los-cinco-puntos",
      "published_at": "2023-11-15",
      "trust_level": "editorial",
      "content": "When someone learns that you live in Los Angeles, you will inevitably get asked one of two questions: \"Have you seen any celebrities?\" and \"What's your favorite taco place?\" The latter can get tricky—will you choose Sonoratown and their imported tortillas? The experimental creations at Taco Maria? Drippy red goat stew, courtesy of Tacos Y Birria La Unica? Or, arguably LA's most iconic dish, the golden, shrimp-stuffed tacos de camaron from Mariscos Jalisco? It's rare that Los Cincos Puntos ever makes the cut. But we're here to tell you: it should.\n\nNamed after its location at the pinnacle of five East LA streets, this family-run carníceria and dried goods market in Boyle Heights has been around since 1967, and was the starting point for the Chicano Moratorium march in protest of the Vietnam War. Step inside and you'll hear the loud smack-smack of butchers at work and old men haggling down the price of chilis.\n\nBaseball trophies that look like they have stories to tell sit above the soda machines. A plastic swordfish hangs in the kitchen and lotto tickets are available for purchase. Piñatas sway in the wind. Are you allowed to take a swing, if it's your birthday? At Los Cincos Puntos, you want to believe the answer is yes.\n\nUnless you're in the market for canela cinnamon sticks or trying your luck at SuperLotto Plus, head to the counter. The menu can feel overwhelming—filled with tortas and sopes, flautas and tamales, quesadillas, hamburgers, and party-sized enchiladas trays—so, start with the tacos. From carne asada to chewy tripa, each one is served on Los Cinco Puntos' signature tortillas, thick and heavenly pillows that could double as Serta mattresses. Are they the best in the city? Yes, a thousand times, yes. We would say the world, but as our editor reminded us, that's \"outside our jurisdiction.\"\n\nAt the back of the market next to sizzling hot griddles, you'll witness chefs creating the tortillas a mano: grabbing fistfuls of masa, giving them a quick pat pat pat, and sending them to the skillet. The process is hypnotic, like watching angels whip up clouds. Served fresh, each tortilla is the perfect contrast to Los Cinco Puntos' luxurious, salty meats.\n\nCarnitas are the specialty, a braised and simmered pork that's left soft and in thicker chunks than what you'll find at other places. But our favorite is the chicharrón: crackling pork rinds, oozing with oil, paired with a good tortilla and a mound of salsa. It's a taco balanced by science—with the sliced nopales and big ol' dollop of guacamole, there's heat. There's acid. There's creaminess, salt, and a distinct crack as you bite into it. This is the taco to order, the \"it girl\" at Los Cinco Puntos.\n\nAre we saying \"come to Los Cinco Puntos just for the cheeseburger?\" No. But when traveling with someone whose only food groups are burgers, dino nuggets, and french fries, this is the ideal add-on."
    },
    {
      "source_id": "src_timeout_la_2024",
      "publication": "Time Out LA",
      "title": "Los Cinco Puntos | Restaurants in Boyle Heights, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/los-cinco-puntos",
      "published_at": "2024-05-15",
      "trust_level": "editorial",
      "content": "For the last five decades and counting, this family-run Boyle Heights institution has churned out juicy carnitas, ultra-crispy chicharrón and other standards all piled into thick, housemade corn tortillas. The long carnicería also sells spices, imported chilies and their tortillas by the dozen, but the reason this place stays crowded most days of the week is the affordably priced, delicious food.\n\nIn addition to tacos, Los Cinco Puntos serves cheeseburgers, tortas, burritos, quesadillas, enchiladas and sopes, but we suggest starting off with a few tacos if it's your first time. Each taco runs in the $3 to $4 range, but you probably won't need more than two or three for a satisfying lunch or early dinner (the market closes at 6pm). Ask for one of everything from the fully loaded salsa bar, which stocks pickled nopales, chunky guacamole, pico de gallo, salsa verde and salsa rojo.\n\nOrder your food to go or take your plate to one of the high-tops or the handful of patio tables stationed outside—you'll want to try the tacos from Los Cinco Puntos while they're hot and fresh."
    }
  ]
}