{
  "place_slug": "mae-malai-thai-house-of-noodles",
  "sources": [
    {
      "source_id": "src_michelin_2024",
      "publication": "Michelin Guide",
      "title": "Mae Malai Thai House of Noodles – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/mae-malai-thai-house-of-noodles",
      "published_at": "2024-08-06",
      "trust_level": "editorial",
      "content": "Los Angeles Restaurants · Mae Malai Thai House of Noodles · 17 · 5445 Hollywood Blvd., Unit A, Los Angeles, CA, 90027, USA · $ · Thai · Eat like a local · Favorite · Visited · Notes · Find bookable restaurants near me · 5445 Hollywood Blvd., Unit A, Los Angeles, CA, 90027, USA · $ · Thai · Eat like a local. Bib Gourmand: good quality, good value cooking. Just a short walk from their original food stall, this restaurant's strip mall digs are simple but it's a comfortable, welcoming spot with a tempting menu to boot. As the name suggests, their specialty is noodles, particularly boat noodles with a thick, intense broth and your choice of pork or beef, noodle type, and spice level. Fret not if you can't decide, as the bowls are small and ordering two or more varieties might just be the perfect compromise. Don't skip out on their stir-fried dishes, such as the boldly spiced chili holy basil with ground pork, bell peppers, and green beans. For dessert, choose from coconut ice cream or kanom tuay, a two-layer custard featuring a green layer infused with fresh pandan leaf, and a white layer with coconut."
    },
    {
      "source_id": "src_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Mae Malai Thai House of Noodles - Review - Thai Town - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/mae-malai-thai-house-of-noodles",
      "published_at": "2024-03-13",
      "trust_level": "editorial",
      "content": "Mae Malai originally started as a street vendor in Thai Town, which, at times, was less than convenient—a night might involve circling the block for a meter, fishing out a forgotten $10 bill from the glove compartment, or speed walking to the nearest ATM because we forgot to get cash (again). It was a pain in the butt, but we never cared because their incredible boat noodles were worth it.\n\nWithout getting too nostalgic over a bowl of soup, we're happy to say Mae Malai's brick-and-mortar is not only as good as their street stand, but even better. Their home is now a barebones strip mall space just a block away, equipped with card readers and ample parking (thank goodness). And, like the kitchen space, the menu has expanded, too. You can walk in for a casual lunch or dinner that entails shrimp-filled omelets, housemade lemongrass-y Northern Thai sausage, and a \"poached and dipped beef\" dish that's essentially a spicy, funky offal salad with liver, tripe, and plenty of lime juice.\n\nStill, you're probably coming here for the boat noodles, which are some of the best in the city. For $9, you're served a small cup of chewy rice noodles, juicy pork-beef meatballs, and crackly pork rinds, all swimming in an incredibly sharp-spicy-sour broth. If you like intense, in-your-face flavors that light up taste buds you didn't know you had, you'll want seconds. Ordering is customizable, from noodle shape to spice level. We won't assume your heat tolerance, but if you order \"Thai spicy,\" the friendly staff will try to talk you out of it. Make of that what you will, but even medium spicy is enough to make us glisten like we're wearing a trash bag in a sauna.\n\nAs special as the sensation of slurping this delicious, murky broth on the sidewalk was, Mae Malai is much more accessible now. It's also never too busy, which makes it a great option for group walk-ins or just a quick, delicious, and reasonably-priced meal.\n\nBoat Noodles\nHave you experienced adulthood if you've never filed taxes? No. Have you experienced Mae Malai if you don't order this dish? Again, no. Ordering these noodles is non-negotiable, but you do have the freedom to tweak a few details, like a choice of pork or beef, noodle width, and spice level. The dark, sour-spicy broth is so punchy it jolts the sides of your mouth. There's a slight offal funk going on, too, but it's balanced with fish sauce and sweet basil. Just know that when we say this soup is spicy, we mean it— levels range from mild (spicy) to Thai spicy (heart palpitations), so trust your gut.\n\nNorthern Thai Sausage\nThese plump sausages are fatty lemongrass bombs, and we love them. They're glossy on the outside with a snappy casing and juicy inside with a subtle fermented funk. Order them as a pre-noodle table snack. If the boat noodles seem too intense, get these instead."
    },
    {
      "source_id": "src_timeout_2024",
      "publication": "Time Out LA",
      "title": "Mae Malai Thai House of Noodles | Restaurants in Thai Town, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/mae-malai-thai-house-of-noodles",
      "published_at": "2024-03-27",
      "trust_level": "editorial",
      "content": "After starting off as a Thai Town weekend pop-up, Malai Data's amazing boat noodle soup has found a permanent home just five minutes' walk from its original location. Step into the bare-bones space for $9 bowls of the best boat noodle soup we've ever had. Bits of carefully prepared green onions, pork cracklings, bean sprouts, meatballs and your choice of mixed pork or beef offal arrive in each traditionally small bowl—so order two, or even three, if you're feeling extra hungry. There's also larger $15 bowls of tom yum noodle soup and an expanded menu that includes pad thai, krapow and housemade Isaan-style sour sausage. For dessert, order the kanom tuay; the delicate steamed pandan-coconut custards are the perfect way to cap off an affordable meal here."
    },
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "The 25 Best Thai Restaurants In Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-thai-food-los-angeles",
      "published_at": "2025-11-20",
      "trust_level": "editorial",
      "content": "Since transitioning from street vendor to brick-and-mortar, Mae Malai serves a much bigger menu featuring crispy shrimp omelets, pad thai, and housemade Northern Thai sausage full of fragrant lemongrass."
    }
  ]
}