{
  "place_slug": "mala-class",
  "sources": [
    {
      "source_id": "src_timeout_2024",
      "publication": "Time Out LA",
      "title": "Mala Class",
      "url": "https://www.timeout.com/los-angeles/restaurants/mala-class",
      "published_at": "2024-09-18",
      "trust_level": "editorial",
      "content": "The quintessential Sichuan flavors of numbing and spicy are just right at Mala Class, a tiny, brightly colored red-and-green Highland Park eatery that opened at the end of June. Five years in the making, the fast-casual York Boulevard restaurant is led by front-of-house partner Kevin Liang and chef Michael Yang. The pair first met while working at Han Dynasty, a tri-state Sichuan specialist that my NYC counterpart named one of the city's best Chinese restaurants. Similar to their former employer, Mala Class aims to tap into the popularity of the southwestern Chinese province's fiery cuisine and make it accessible to a wider audience.\n\nUnlike more traditional Sichuan restaurants in the San Gabriel Valley serving dishes like cumin lamb, pepper fish and la zi ji (a.k.a. mala chicken), the vegan-friendly menu offers a reasonably priced, contemporary take that hits all the right notes, even for someone well-acquainted with the region's cuisine.\n\nSichuan-born Yang—who's also worked at Bistro Na's in Temple City—takes obvious care in the kitchen. Finer details like noodle texture and the crispiness of deep-fried items like tofu and chicken wings elevate the fast-casual menu from good to great. I particularly enjoyed Mala Class's phenomenal take on dan dan mian. The subtle sesame sauce, optional ground pork and spicy chili oil are tossed tableside with chewy, slightly springy noodles. The vegan-friendly dish is ubiquitous in L.A.'s Chinese restaurants and most renditions tend to feel rote and wholly unremarkable, but the first-rate version at Mala Class offers a more complex, nuanced blend of flavors.\n\nOther dishes like spicy beef noodle soup and mala chicken wings elicit only mild twinges of numbing, but if you'd like even more buzz on your tongue the restaurant is happy to accommodate flavor modifications in either direction.\n\nA selection of mostly fried appetizers includes craveworthy mushroom fries, pepper-rubbed tofu, and cucumber and bean curd salad. Those in search of milder, more familiar fare will enjoy the cold sesame noodles and garlic sauce shrimp; while I consider them the weakest items on the menu, both in terms of spice level and overall quality, they're both still tasty enough to order when you're not looking for a full-blown party in your mouth. In the future, Liang and Yang plan to debut rotating menu specials, but for now they've focused on basics, including a standout mapo tofu made with leeks. It's easily my favorite version in Los Angeles—and I've tried almost everywhere else in town you could possibly imagine. Since my first visit to Alhambra's Chengdu Taste, the culinary pioneer that opened over a decade ago, I've yet to find a modern Sichuan-style restaurant that has captivated my interest more than Mala Class.\n\nFor now, you'll need to venture to Northeast L.A. to try this fast-casual Chinese restaurant, but Liang and Yang have aspirations to turn Mala Class into a thriving multi-location chain. If the pair can thread the needle on continued quality and consistency, I can easily imagine Mala Class becoming as beloved a local chain as, say, Dino's Famous Chicken or Sugarfish. It's worth planning a visit to Highland Park for some of the most delicious, interesting and reasonably priced Sichuan cuisine L.A. has seen in a long, long time.\n\nThe vibe: Bright and modern, with a mixed crowd of neighborhood locals and citywide heat-seekers.\n\nThe food: A tightly curated menu of modern Sichuan cuisine. Highlights include the dan dan noodles, mapo tofu and cumin-dusted mushroom fries.\n\nThe drink: Non-alcoholic canned options only—Coke, Sprite, Apple Sidra and Wan Lao Ji, a sweetened Chinese herbal tea."
    },
    {
      "source_id": "src_timeout_2024_feature",
      "publication": "Time Out LA",
      "title": "The heat's on at Mala Class, L.A.'s buzziest new Chinese restaurant",
      "url": "https://www.timeout.com/los-angeles/news/the-heats-on-at-mala-class-l-a-s-buzziest-new-chinese-restaurant-091824",
      "published_at": "2024-09-19",
      "trust_level": "editorial",
      "content": "For several months, Highland Park area residents speculated about what would take over 5816 York Boulevard. A yoga practice, perhaps? Once signage for \"Mala Class\" appeared, some wondered if the former Salvadoran restaurant might transform into an arts and crafts studio. (In addition to the feminine version of \"bad\" in Spanish, mala also translates to \"garland\" in Hindi and Urdu. It can also refer to the prayer beads used in Hinduism and other South Asian religions.) It wasn't until the end of June that co-owners Kevin Liang and Michael Yang opened their brightly colored fast-casual Chinese restaurant, clarifying the name's intended meaning.\n\nMálà, as the term is accented in standard pinyin, refers to the unique numbing, spicy flavor profile most commonly associated with Sichuan, the southwestern Chinese province known for its bold, pungent cuisine full of garlic, chilies and peppercorns.\n\nLike Liang and Yang's previous employer, Han Dynasty, Mala Class positions itself as an approachable gateway into Sichuan cuisine in an area with minimal competition. (While Highland Park does have Joy and Mason's Dumplings, both offer different styles of Chinese cuisine.) What the pair hope for in the long run, however, is to be able to maintain the menu's current level of quality and consistency, even when Yang is no longer the day-to-day chef working in the back. Their restaurant's tree branch-like logo signifies the duo's North Star: eventually, they want to open other locations.\n\nThe food at Mala Class might possess an artisanal level of culinary excellence, but Liang and Yang are ultimately businessmen. The co-owners quietly take pride in their three-month-old restaurant's bouncy noodles and clever appetizers.\n\nFor two and a half years, the pandemic put those plans on hold. Initially, both co-owners helped keep their parents' businesses afloat, then found other jobs in the restaurant industry; Liang at Pasadena's Bone Kettle, Yang at Bistro Na's. They scouted for the right location, painstakingly developed the opening menu and, of course, ate at many of L.A.'s Chinese restaurants and hot pot joints in the name of research and development. Their self-funded Highland Park restaurant, which they signed the lease for in May 2022, has been five years in the making.\n\nMala Class earned five stars from us. For more details on food, drink and service, read our full review."
    },
    {
      "source_id": "src_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Mala Class - Review - Highland Park - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/mala-class",
      "published_at": "2024-10-15",
      "trust_level": "editorial",
      "content": "Mala Class in Highland Park is a cute spot to take a date, even if everyone here is doing the same thing. This tiny Sichuan restaurant is walk-in only, so expect to wait for a table when date night is in full swing (or, if you're the restless type, walk to Barcade down the street for a drink).\n\nMala Class's plant-filled dining space is compact, and so is its menu. The lackluster mapo tofu can be skipped, but everything else is wonderfully spicy—not so spicy, however, that your date will feel like they're on a Hot Ones episode. Chewy, nearly translucent pork dumplings in a dual sauce of sweet aromatic soy and crimson chili oil are more nuanced than blow-your-head-off, and the dan dan noodles heaped with minced chili pork are some of the best (and hottest) we've had in recent memory. All of Mala Class's nine or so dishes are under $20 and come out quickly, which makes lingering in the charming spot with a few rounds of dumplings all too easy.\n\nOrder this. This bowl of chewy noodles is the spiciest dish we've tried on this short menu and we loved the heat. The minced pork sauce is loaded with garlic and mala spice, tossed tableside to coat every strand.\n\nDisappointing. The menu describes this Sichuan classic as \"numbing, saucy, and spicy,\" but all we taste is something close to black pepper in the thick sauce. Sadly, no numbing or spice to be found."
    },
    {
      "source_id": "src_infatuation_guide_2025",
      "publication": "The Infatuation",
      "title": "The 16 Best Restaurants In Highland Park - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/highland-park-best-restaurants",
      "published_at": "2025-03-10",
      "trust_level": "editorial",
      "content": "Mala Class is a cute spot to take a date, even if everyone here is doing the same thing. This tiny Sichuan restaurant is walk-in only, so expect to wait for a table when date night is in full swing. And if you can handle some pre-dinner small talk (and eating noodles in tight quarters), you'll be rewarded with a small selection of fragrant Sichuan dishes. The bean curd and cucumber salad is dressed with a punchy housemade black vinegar, the plump pork dumplings have a dual sauce of chili oil and aromatic-infused soy, and the dan dan noodles with minced pork is one of the city's best (and spiciest). All of Mala Class's nine or so dishes are under $20 and come out quickly, which makes lingering in this charming plant-filled space with a few crowds of dumplings all too easy."
    }
  ]
}