{
  "place_slug": "manzke",
  "sources": [
    {
      "source_id": "src_timeout_la_2024",
      "publication": "Time Out LA",
      "title": "Manzke Restaurant is L.A. fine dining at its absolute best",
      "url": "https://www.timeout.com/los-angeles/restaurants/manzke",
      "published_at": "2024-03-03",
      "trust_level": "editorial",
      "content": "From start to finish, Walter and Margarita Manzke's new tasting menu restaurant upstairs from Bicyclette encapsulates the best of Los Angeles fine dining.\n\nWhat, exactly, does L.A. taste like to you? Some might extol the virtues of a glorious street taco, the first bite into a luscious SGV dumpling or even a Double-Double fresh off the plane from LAX. For now, and perhaps forevermore, my honest, unfiltered answer would be the bluefin tuna tostada with salsa fresca at Manzke.\n\nThat the newly opened tasting menu concept above Bicyclette—which Time Out crowned the city's best new restaurant of 2021—is excellent comes as no surprise, but the extent to which the eponymously named eatery raises the bar would astound even the most grizzled veterans of the L.A. fine dining scene, and arguably the global one as well.\n\nThe eponymously named Manzke encapsulates the best of L.A. fine dining. From start to finish, Walter and Margarita Manzke's French technique-driven tasting menu leaves no stone unturned. Consisting of a dozen or so French-leaning seafood-centric courses (the unforgettable tuna tostada among them), the $225 tasting menu available, all things considered, is absolutely worth it for anyone wanting to ball out for a special occasion. Those who can afford to shell out will experience the purest expression of Walter and Margarita Manzke's decades of culinary mastery.\n\nUnlike many other similarly priced L.A. spots, an experience at the couple's newest restaurant calls to mind the French expression bon rapport qualité-prix, a phrase that literally translates to \"good quality-price ratio.\" In addition to all the trappings of sophistication such high prices normally command, every major aspect—sheer variety, flavor, presentation and pure wow factor—of Manzke's ample tasting menu delivers, for a dazzling, gourmand-style meal that might just call for loosening your belt.\n\nIn lieu of a traditional amuse bouche, a meal at Manzke begins with a light tipple of imported pear cider or other unique aperitif. From there, in a manner not dissimilar to the couple's beloved Republique, Walter Manzke deftly integrates simple, best-in-class ingredients with fancy cooking techniques, albeit with a much heavier French emphasis.\n\nWhen a meal ranges from mantou topped with Hokkaido sea urchin to an abalone-and-cauliflower royale awash in black truffle shavings (yes, they ask you when to stop), there's a lot of ground to cover on the highlights of an absolutely life-changing meal. In the case of the tostada with salsa fresca—a playful, bite-sized tuna cracker atop a cup of clear broth–the fresh pico de gallo distilled to its pure essence literally almost brought tears to my eyes.\n\nAmid the predominance of French technique and extravagant ingredients, dishes honing in on key L.A. flavors stand out the most at Manzke, edible emblems of the city brought to life.\n\nEpicurean matters aside, Manzke's refined interior reads as elegant, if slightly austere, with the same shades of blue cloaking the building inside and out and plenty of burnished wood. The airy, former Picca space feels completely transformed with expensive touches, from a gigantic Persian rug to plush black leather banquettes. A heaping mound of French butter under a bell jar serves as the dining room's centerpiece; a similar one can be found on the sideboard on the smaller, more secluded mezzanine level upstairs.\n\nEvery member of Manzke's staff is attentive, from the rare L.A. coat check to the parting, gift-wrapped pastry for the next morning—making this ultra-expensive meal, well, ultra worth it in every way. Longtime fans of Margarita's pastry program will delight in the cornucopia of dessert and mignardises presented at the end of a meal at Manzke—five different confectionaries, including a delightful basket of orange madeleines, made their way to my table along with a soothing mint tea. Of course, the actual dessert, a mango-topped passionfruit custard, stole the show."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Manzke",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/manzke",
      "published_at": "2025-01-09",
      "trust_level": "editorial",
      "content": "Manzke, a fine dining spot in Beverlywood from the owners of Republique and Bicyclette, isn't groundbreaking but offers a well-executed meal.\n\nManzke, a beautiful tasting menu restaurant from the team who gave us Republique and Bicyclette, isn't that kind of place. There is no mind-boggling reimagining of fine dining going on here, just well-executed dishes filled with luxury ingredients served in a private and peaceful atmosphere. If that kind of experience—at $260 per person before tax and tip—sounds attractive to you, then Manzke is a place to seek out.\n\nEntering through Manzke's double doors and into its second story dining room, you're hit by the stateliness of it all. This is an old, split-level space on Pico Blvd. just south of Beverly Hills, with Bicyclette occupying the ground floor. The high energy bistro below might share the same chef, but its contrast with Manzke is stark—the upstairs space is much quieter, with an original design aesthetic and a certain gravitas that sets it apart.\n\nThe dining room is lined with navy leather tufted banquettes, rich mahogany dining tables, and ornate Persian rugs. The dark herringbone ceiling hovers like a dramatic art installation. It's the kind of room that transforms you from an exhausted Angeleno who forgot to pick up toilet paper today into a noble dignitary dining in fashion. Once you're seated however, the energy shifts from extraordinary to sort of ordinary, despite service that is warm and overall very knowledgeable.\n\nThis is going to sound ridiculous, but the tables at Manzke are too far apart. It's a minor detail that has a sizable impact. In a space this epic, you want to feel like a prime guest at an exclusive gathering, rubbing shoulders with ambassadors and people who collect portrait busts. Instead, you're more or less stuck in a corner, craning your neck to see if the party is happening on the other side of the room. We're all for privacy while we eat, but it's unusual when a space is so awkwardly arranged that it becomes a point of conversation (which is a shame, because everyone should really be talking about food).\n\nManzke's menu, which mainly takes inspiration from California, France, and East Asia, features around 11 courses. You'll eat standout dishes like Santa Barbara red abalone topped with Hokkaido uni and a dashi beurre blanc, European white asparagus in a potato and leek velouté studded with caviar, and a sweet and savory Thai corn curry we'd drink from a Camelbak if they let us. Some dishes are less memorable—an already buttery brioche roll served with (excellent) Le Meunier butter was simply too rich and a hamachi aguachile lacked salt and acidity—but overall, most things that land will be met with a round of \"mm, that's lovely\" and other things people mutter at fancy restaurants.\n\nManzke's sole dining option is a multi-course tasting menu with dishes that change seasonally. On our last visit, we ate things like potato chips with roe-topped labneh, Dover sole with a black truffle and cream sauce, wagyu ribeye cap with red wine jus, and roasted green tea creme bruleé. Whatever you're served the night you visit, know that the majority of the courses will probably involve someone pouring sauce over your food tableside. This could include a decadent beurre blanc over red abalone and Hokkaido uni, or a sweet corn curry slowly surrounding a clump of Dungeness crab.\n\nFor anyone who's dined at Republique or Bicyclette, you know that high quality wine is a given. Manzke is no exception. If price isn't an object, there's a $165 or $295 wine pairing, or you can just pick something from the more limited by-the-glass list. There's also a menu of cocktails made with vintage spirits that features sidecars, martinis, and prices that'll make your heart rate spike. A $65 negroni made with gin from the 1970s? Yes, it's real and it's very good.\n\nManzke isn't blazing any new territory, but it does prove that a restaurant doesn't need some maximalist explosion of showmanship to justify its high price point. A refined and mostly delicious menu can be noteworthy, too, and if you have the money to spend—and don't mind the extra open space—this is a great place to experience just that."
    }
  ]
}