{
  "place_slug": "marouch-restaurant",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Marouch - Review - East Hollywood - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/marouch",
      "published_at": "2024-03-15",
      "trust_level": "editorial",
      "content": "Marouch is an iconic Armenian/Lebanese restaurant in East Hollywood that does amazing things with mezze. Even if you just moved to LA, you're probably aware of the sheer quantity of \"Mediterranean-leaning\" restaurants in this city—Levantine, Provençal, the ever-generic \"coastal,\" etc. The popularity makes sense; Mediterranean cuisine is centered around \"locally sourced\" ingredients and is broadly considered \"light\"— catchphrases that make Angelenos rest easy in bed at night. But now that edamame hummus has suddenly become a menu mainstay, we've reached the oversaturation point. Which is why a meal at Marouch is more rewarding than ever. The classic Lebanese-Armenian restaurant in East Hollywood has long been one of LA's essential dining experiences, and even after all these years, their incredible, meze-filled menu still sets the bar for every new Mediterranean restaurant in town.\n\nThe first thing you'll notice when walking into Marouch's strip mall space is its grandiosity. Marouch's menu is fairly lengthy, but can easily be split into two simple sections—the meze and the entrees. While you should absolutely take advantage of both during your meal, the meze section deserves most of your attention. With almost 25 different dishes, ordering can be a little overwhelming, so just do what we do, and stick to the combination platters. Broken into three different sizes (for two, four, or six people), they're a highlight tour of the best meze on the menu. You'll get creamy hummus, tangy tabbouleh, flaky cheese fatayer that people will fight over, spicy sugok, and labneh and olive oil. In other words, there's no shortage of flavor profiles on the table. From there, throw in a few more a la carte meze, like a slightly sweet muhammara that's probably our favorite thing on the whole menu, and the hummus with tahini and ful. We love this marinated quail because its smoky, barbecued flavors are an ideal change-up from the more savory and herbaceaous profiles that make up a meal at Marouch. This isn't the best baklava we've ever eaten, but it's still very good, and any opportunity to eat baklava is an opportunity you take. Truly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_timeout_2024",
      "publication": "Time Out LA",
      "title": "Marouch Is A Beloved East Hollywood Mainstay With Birthday Fun",
      "url": "https://www.timeout.com/los-angeles/news/head-to-this-longtime-lebanese-strip-mall-joint-for-kebabs-and-campy-birthday-fun-031224",
      "published_at": "2024-03-15",
      "trust_level": "editorial",
      "content": "Delicious meze and affordable prices have made Marouch a beloved East Hollywood mainstay since 1982. The modest strip mall space feels like a cozier, more compact version of a Glendale kebab palace, down to the pseudo-bricks and Corinthian columns that line the walls. Marouch's Armenian-inflected Lebanese fare first put it on the map in the '80s. In 1990, then-L.A. Times restaurant critic Ruth Reichl included Marouch in her list of the city's top 40 restaurants, praising the meze, a dizzying, tasty assortment which you can still get today. The late Jonathan Gold used to visit the restaurant weekly. Even compared to then-new competition like Raffi's, he deemed it \"as good as ever\" in 1994. In 2024, it's difficult to imagine an era of L.A. dining when just a few prominent restaurant critics were able to dictate what was cool to a wider audience. The public's attention span has shrunk considerably, there's a perpetual fixation on what's new and anyone can share restaurant recommendations online with zero editorial oversight or attempt at \"objective\" fairness. Visit Marouch once, however, and you'll quickly understand how it's outlasted so many others—and might walk away with a new place to keep in your back pocket. In their hands, the restaurant has maintained a near-identical menu, save for the addition of manti, an Armenian ground beef dumpling and tomato yogurt sauce recipe passed down from Haikouhi's great-grandmother. In 2022, food celebrity Guy Fieri featured the dish on an episode of Diners, Drive-Ins and Dives. \"This dish has become a new staple,\" says Roman. \"Folks from all around the country are stopping by because they've seen this show, and they specifically ask for this dish.\" Aside from the manti, Marouch serves many of the same dishes beloved by generations of Angelenos, including plenty of celebrities. (By the bathroom, you'll find faded headshots of Leonardo DiCaprio and Jamie Lee Curtis on the wall, plus countless others.) Since taking over, the Keshishyans have also retained most of the old employees, including a few who have worked there for decades. Others might prefer Glendale's more opulent dining rooms or Westwood's tiny but mighty collection of Persian restaurants, but you can't ignore the cozy atmosphere and steadfast cuisine at Marouch. Marouch is located at 4905 Santa Monica Blvd and is open Tue–Thu 11am–8pm; Fri, Sat 11am–10pm; Sun 11am–8pm."
    }
  ]
}