{
  "place_slug": "maru-coffee",
  "sources": [
    {
      "source_id": "src_sprudge_2017",
      "publication": "Sprudge",
      "title": "Peak Inside Maru Coffee In L.A.'s Los Feliz Neighborhood",
      "url": "https://sprudge.com/maru-coffee-109792.html",
      "published_at": "2017-01-01",
      "trust_level": "editorial",
      "content": "There's a new coffee shop open in Los Feliz, the small neighborhood in Los Angeles that borders Silver Lake and Hollywood. A lot of small and independent businesses line the streets here, including a fair share of coffee spots. One of the newest to hit the scene is Maru Coffee, a minimalist and tranquil spot that fits into the eclectic makeup of Los Feliz perfectly. A dream conceived by co-founders Jacob Park and Joonmo Kim more than three years ago, Maru finally began serving coffee in late September. On a visit, you may catch Park behind the bar — he's not just an owner, but also the head barista and a certified Q Grader. Co-founder Kim is also in-house most days and manages the business side of things. \"It's an amazing feeling to see your vision come to life,\" he tells me. Maru is from an old Korean word 'San Ma Ru' which means mountaintop, Kim tells me, \"it is our representation of high quality as good coffee beans come from high elevation,\" he says. Inside, you'll find the standard coffee menu with espresso drinks made on a sleek Synesso MVP. Kalita and Kono drippers are also on hand for pour-overs, alongside a Mahlkönig EK 43 and Mazzer grinders. Maru plans to feature three roasters at a time; on a recent visit, the shop carried Coava Coffee Roasters, Sweet Bloom Coffee Roasters, and Stereoscope Coffee. If you happen to have the time to stay and drink inside, you'll get your beverage served in a stylish ceramic cup by Notary Ceramics from Portland, Oregon. Maru also serves a selection of herbal, green, and black teas. For now, pastries come from LA's Cake Monkey — with treats like slices of babka, doughnuts, and savory bacon jam twists available to pair with your coffee."
    },
    {
      "source_id": "src_sprudge_2022",
      "publication": "Sprudge",
      "title": "Sprudge Maps Spotlight: Maru Coffee In Los Angeles, CA",
      "url": "https://sprudge.com/sprudge-maps-spotlight-maru-coffee-in-los-angeles-ca-184840.html",
      "published_at": "2022-06-15",
      "trust_level": "editorial",
      "content": "Maru Coffee is a Korean-American owned coffee company with two locations and a roastery in Los Angeles. The name Maru comes from an old Korean phrase \"San Ma Ru\" meaning mountaintop. We approach coffee very simply and intentionally in pursuit of creating memorable flavors and experiences. This grow and change through the years, and Maru has, too. Now they have two locations, roast their own coffee, and will open a third outpost in Beverly Hills in 2022. Their original cafe in Los Feliz remains one of LA's most charming coffee bars. We've been roasting our own coffee for about three years now, on a 15kg Giesen, in addition to our recently added 15kg Loring Falcon. For the coffees we roast and serve, we like to use single varietal coffees as often as possible for developing consistent and distinctive flavors. Additionally, all of our offerings are single origin, even our espresso offerings. Equipment: Slayer Steam X three-group, Kees Van Der Westen Slim Jim, La Marzocco, Synesso. We like switching it up and exploring different makes. Nuova Simonelli Mythos, Mahlkönig EK43 and K34, Mazzer Kony S. What is the neighborhood like where you're located? We currently have two locations (Los Feliz and Arts District) and a third location (Beverly Hills) expected to open this summer. Los Feliz is a neighborhood surrounded by many residential properties. People that live here also hang out in the neighborhood. Arts District is an industrial area that is in the midst of transformation. While there are many warehouses and big trucks going by, it is also a place where many new good restaurants, creative studios, and offices opened up. In the vicinity, there are great restaurants like Damian by renowned chef Enrique Overa whom we have a coffee partnership with, Bestia, and Yess Aquatic which will be opening up soon. Soho House is also across the street from our shop and also a boutique hotel Kensho Ryokan is opening up this spring. During the pandemic, we mostly stayed open as a to-go service shop. Our cafe was designed with the intention of creating a warm ambience and celebrating the analog energy where simple coffee can bring people together in a shared space."
    },
    {
      "source_id": "src_infatuation_losfeliz",
      "publication": "The Infatuation",
      "title": "Maru Coffee — Los Feliz Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/maru-coffee",
      "published_at": "2024-06-20",
      "trust_level": "editorial",
      "content": "Depending on your perspective, Maru in Los Feliz is either a beige-toned temple of discerning taste and aesthetics, or just a place where ceramic studio assistants from Mount Washington silently debate between the Ethiopian or Honduran light roast while in line. But no one debates whether or not this quiet-but-never-slow coffee shop on Hillhurst serves incredible coffee, particularly drip coffee, pour-overs, and slow-drip cold brew. Admire the gorgeous wooden shelving at the bar while you wait for your cream-topped iced long black, but don't plan on lingering: despite being in a neighborhood filled with sidewalk cafes, Maru is pretty much standing room only. Perfect for: Coffee & A Light Bite. Included in: LA's Best Iced Coffees And Cold Brews, Meet 10 Of LA's Best Asian-Owned Cafes, The Best Coffee In LA. Written by Garrett Snyder, Los Angeles Editor."
    },
    {
      "source_id": "src_infatuation_artsdistrict",
      "publication": "The Infatuation",
      "title": "Maru Coffee Arts District Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/maru-coffee-arts-district",
      "published_at": "2023-06-14",
      "trust_level": "editorial",
      "content": "Maru Coffee's Arts District location has excellent matcha and pour-over coffees, but know you're walking into a scene. The people-watching here is elite: influencers and people who want to be influencers come dressed in cashmere and whatever clothing brand is sponsoring this morning's latte. And you can take all of it in from a spacious communal table that's great for in-person meetings. Wifi and free street parking are available if you want to spend the workday here, but skip the pastries and check out our neighborhood guide for lunch options in the area. Perfect for: Coffee & A Light Bite. Included in: The Best Coffee Shops In LA For Getting Work Done, LA Coffee Shops Where People Go To Look Cool. Written by Sylvio Martins, Senior Staff Writer, Los Angeles."
    },
    {
      "source_id": "src_official_site",
      "publication": "Maru Coffee (official)",
      "title": "marucoffee.com",
      "url": "https://www.marucoffee.com/",
      "published_at": null,
      "trust_level": "official",
      "content": "A coffee company and roaster based in Los Angeles, CA; we focus on offering unique and high quality coffees that undergo intensive processing. Maru Coffee is made with intention, balance, and a love for the ritual of a well-made coffee. Our coffee shops live in the Los Feliz and Arts District neighborhoods of LA. Maru adopts its name from a native Korean language, San Ma Ru, which means 'mountaintop'. This is our symbol of quality as the finest coffee beans are grown and harvested from areas of high altitude. Born from a love of process and everyday quality, we are inspired by all things analog and the simplicity of good coffee. We believe that quality does not have to be austere and that tradition can be respected as well as re-imagined. Maru is made with intention, balance, and a love for the ritual of a well-made coffee. Locations: Los Feliz — 1936 Hillhurst Ave., Los Angeles, CA 90027, Mon-Sat 7-5, Sun 8-5. Arts District — 1019 S. Santa Fe Ave., Los Angeles, CA 90021, Mon-Sun 8-5. Williamsburg. Maru Espresso Bar — Beverly Hills."
    }
  ]
}
