{
  "place_slug": "maurys",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Maury's - Review - Silver Lake",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/maurys-bagels-silver-lake",
      "published_at": "2025-10-07",
      "trust_level": "editorial",
      "content": "Located on a residential street in Silver Lake you probably don't know exists unless you live on it, Maury's is a tiny, predominantly takeout spot. The menu here is limited - usually seven different sandwich and open-faced options, most of them involving fish. But, just like how Quentin Tarantino says he's only going to make ten movies, we don't mind the limited quantity when the quality is so high. The bagels are soft and chewy, but not so springy that you're going to sprain your jaw - they still crunch a bit when you bite into them.\n\nThe deli classic is our favorite thing here. The cured salmon is saltier than the ocean, and more beautiful than open sea. Smoked black cod sounds like something you'd order for $68 at a restaurant you only go to when your boss is paying. But you can get it at Maury's anytime you want, and it's probably better than the $68 version.\n\nWe're not going to tell you to spend $22 on a bagel. But if this special is available, and you feel like balling out a bit, get The Mori. The price will seem downright reasonable once you taste the lox and wasabi tobiko on top. This open-faced bagel is incredibly simple - and pretty incredible in general. The Everything and the garlic bagels are our favorites, but you can't really go wrong with any of them... and no matter which you order, it'll still be warm when it's handed over. Maury's doesn't toast their bagels (unless you ask for it), they just churn them out at an incredible pace.\n\nAnd though the bagels are great, the real star of the show is the fantastic fish. The sable is among our favorites - the buttery black cod is perfect with cream cheese, and offset by the pickled red onions and tomatoes - and the kippered salmon is also excellent. And they have a special that is almost undoubtedly the most expensive bagel in Los Angeles - The Mori, which is $22 and piled high with lox, dill, cucumber, and wasabi tobiko (flying fish roe). A bagel that costs this much might seem like a gimmick, but this is a distinctly great breakfast dish, and we highly recommend getting it at least once.\n\nSo we're not going to compare Maury's to a New York bagel, because we don't care how it stands up to some New Yorker's favorite Tompkins Square sesame-lox whatever. All we know is this Silver Lake spot bakes damn good bagels, smears them with just the right amount of cream cheese, loads them with excellent smoked fish, and breaks a few rules in the process."
    },
    {
      "source_id": "src_timeout_la_2019",
      "publication": "Time Out LA",
      "title": "Maury's Bagels | Restaurants in Silver Lake, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/maurys-bagels",
      "published_at": "2019-05-17",
      "trust_level": "editorial",
      "content": "One of L.A.'s most beloved bagel pop-ups finally landed its own restaurant, and Maury's Bagels in Silver Lake is about as old-school charming as it gets: There are metal baskets of piles upon piles of the chewy, yeasty bagels, while black-and-white signs display the daily selection of house-made schmears and bagel sandwiches like whitefish salad and kippered salmon."
    }
  ]
}