{
  "place_slug": "mazal",
  "sources": [
    {
      "source_id": "src_the_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Mazal - Review - Lincoln Heights - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/mazal",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "Mazal is an Israeli restaurant in Lincoln Heights that's one of our favorite casual dinner spots on the Eastside. If you're struggling to remember what that specific experience feels like, make a reservation at Mazal. As you walk into this Israeli spot in Lincoln Heights, there's a chance you'll whisper to yourself \"I live here now\" before you even sit down. You'll notice weathered patterned walls lining their alleyway patio, a broken basketball hoop that looks like a pivotal prop from a 90s feel-good sports movie, and table after table of friends cheers-ing to simply being together. This isn't a rowdy restaurant, but everyone at Mazel is enjoying themselves.\n\nYou know you've ordered correctly here when, at some point, every inch of your table is covered with a shareable small plate. That said, you don't have to order everything at once. A meal at Mazal can be done in waves - order a handful of spreads like spicy madbuka and some of the best babaganoush we've eaten in LA, rip and dip their thick, pillowy house-made pita, and pick a bottle off their excellent wine list that specializes in minerally biodynamic wines from Europe and North America. You'll chat about that one time in December you put a wig on your snake plant, and when the time is right, you'll look over the entirely-vegetarian menu and get some more food on the table. If you're with a big group, order a few of everything and watch your friends quickly forget about the drama that happened on their way to the restaurant.\n\nA big portion of your meal at Mazal should be spent in the \"spreads\" section, because everything there is delicious and comes with a basket of their excellent house pita. That said, ordering the madbukha is non-negotiable. This roasted tomato dish is simple, and yet slammed with sweet, garlicky, and slightly spicy flavor. This is one of the best plates of babaganoush we've eaten in Los Angeles. It's smooth, smoky, and nutty, with a vibrant pop of citrus that balances the dish and keeps it from being overpowered with earthiness. We're not saying we would drink this through a straw, but we can't promise anything if it was served with one.\n\nMazal has several different rotating flatbreads on their menu, but we recommend concentrating on the bagel toast instead. This thin, hot-pressed sandwich is filled with provolone, spicy schug, kale, shredded carrots, tomato, and pesto - all between a crispy, sesame seed-laced bagel toast that crackles with each bite. We've gone back to Mazal specifically just for this dish. A meal at Mazal is designed to be dominated by shareable small plates. But if you want one big dish to anchor the meal, get the couscous. Made with semolina grain and topped with garbanzo beans and grilled daily vegetables, this turmeric-forward dish is ideal for passing around the table.\n\nThis dish personifies exactly why we love the food at Mazal - fresh ingredients that have been simply prepared and taste incredible together. It's rare you'll see a salad get cleared from the table as fast as this one (unless we're talking about one of these). When it comes to bigger dishes, we love the citrusy bite of the Israeli salad and the toasted bread of the cheese- and vegetable-filled Jerusalem bagel toast that crackles in our mouth with each bite. The turmeric-laced couscous is probably the heftiest dish on the menu and a great option to pass around the table to keep your one friend who got elbowed out of the last bite of hummus happy. If you don't have room left for the citrus-y orange marmalade cake, then at least you know you have an errand to run afterwards - to the host stand to make another reservation.\n\nThis is a restaurant designed for people to enjoy each other's company and the menu itself plays directly to that strength. Continuously living in a world surrounded by $40 bottles of natural wine, endless mezze, and friends might just be our version of eternal happiness. But meals at Mazal do have to end at some point, and that's OK because we leave feeling grateful that such camaraderie is even an option again. Truly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_spectrum_news_2020",
      "publication": "Spectrum News 1",
      "title": "Mazal brings luck -- and Israeli cuisine -- to Lincoln Heights",
      "url": "https://spectrumnews1.com/ca/la-west/food-and-dining/2020/11/12/mazal-brings-luck--and-israeli-cuisine--to-lincoln-heights",
      "published_at": "2020-11-13",
      "trust_level": "editorial",
      "content": "LINCOLN HEIGHTS, Calif. — In today's challenging restaurant environment, it will take some luck to succeed. In the case of Mazal, a new Israeli vegetarian restaurant that had its grand opening in Lincoln Heights Thursday, luck is literally on the menu. Named after the Hebrew word for luck (as in mazel tov), the place grand-opened on November 12th last year, and is the brainchild of Southern California native Tal Zaiet.\n\nZaiet was born and raised in Los Angeles, but his mother Hanni used to work at the family's bakery in Israel. Now she makes Mazal's rotating menu of desserts, whether it's a cinnamon bread pudding, a chocolate coffee cake, or something gluten- or dairy-free. \"It's whatever she's feeling. My mom is a phenomenal cook,\" said Zaiet, who's spent the past year working with her to craft a vegetarian menu that incorporates a lot of her family's Moroccan ancestry. Mazal's specialty is a spicy couscous made with squash, red onions, and garbanzo beans, but Zaiet counts the homemade hummus (chickpeas), tahini (sesame seeds), baba ganoush (eggplant), and a stewed tomato and bell pepper dish known as madbkha as the restaurant's \"heavy hitters.\"\n\nLocated on the Northeastern side of Chinatown, on the opposite side of the LA River, Lincoln Heights is the next pocket of the city that's likely to gentrify, Zaiet said. He pointed to examples of other bars and restaurants in the area, such as the Lincoln Kitchen & Tap gastropub and The Heights Deli & Bottle Shop, as well as other Israeli restaurants, such as Bavel in downtown's Arts District. \"It's developing and it's super exciting,\" Zaiet said of a location that is in between up-and-coming Chinatown and already discovered Highland Park. \"I'm getting a lot of love from the community that I didn't expect.\"\n\nMazal is located at 110 N. San Fernando Road in Los Angeles. It is open for patio dining, curbside pickup, and delivery from 4:30 to 10:30 p.m. Wednesday through Saturday and from 2:30 to 9:30 p.m."
    }
  ]
}