{
  "place_slug": "meteora",
  "sources": [
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Meteora - Review - Hancock Park - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/meteora-la",
      "published_at": "2025-07-03",
      "trust_level": "editorial",
      "content": "There's strange and then there's Meteora—a mysterious, prehistoric-themed restaurant in Hancock Park that feels like dinner theater held out in the wilderness. If you've ever wished Rainforest Cafe was more emo, Meteora might actually provide an entertaining experience. The jungle-inspired dining room is filled with lush foliage stretching up toward giant skylights. The menu is made up of imaginative fine dining food that doesn't exist elsewhere in LA. And every half-hour, a server will saunter around the room with a bowl of burning incense like a monk in a monastery. Given the heavy-handed aesthetics on display, it's no surprise that this place comes from the team behind Vespertine—an over-the-top tasting menu restaurant that didn't deliver on its lofty promises. The same people also run Destroyer, a zen-feeling, order-at-the-counter daytime spot that we're huge fans of. Meteora seems like a natural middle ground between the two: an upscale sit-down restaurant with an experimental a la carte menu. Unfortunately, this cavernous concept on Melrose is more unsettling than any movie Jordan Peele has ever made. Similar to Vespertine, Meteora actually looks pretty cool when you first walk in. The entrance is essentially a giant bird's nest made of spiraling branches swallowing two huge glass doors. Curved banquettes and cushioned wicker chairs give the room the relaxed feel of a club VIP section. Palo santo smoke fills the air and bass-driven ambient music bumps from the speakers like a pulse. But once you've settled into your table and the food begins to arrive, all of that energy turns to disappointment. As much as we admire restaurants trying new things, it's hard to appreciate the uniqueness of Meteora when you'll likely end up spending over $100 per person for bland, pretentious dishes without enough flavor to back up their creativity. As unique and otherworldly as the setting of Meteora is, the actual restaurant part of the experience is underwhelming. It doesn't feel like a thought-provoking reimagining of modern dining, or even just a place that offers an interesting meal for special occasions. It's more like a bad dream, jungle excursion, and frustrating dining experience rolled into one. As an aperitif, a server will bring over a \"gift\" of tepache washed in pineapple wine, which is basically a cup of bittersweet kombucha—we recommend you savor it, because this will be the most flavorful portion of the entire meal. This dish offers three different finger foods you can mix and match—soft cheese wrapped in duck ham, lettuce cups, and grilled peaches. The sweet and savory combinations sound interesting, but the mild flavors of each element had little to no impact on our taste buds. Picture a baked tortilla in the shape of a bowl filled with leafy greens and topped with a whole avocado—that's Meteora's avocado pie. It tastes like a glorified fruit salad, which would be fine if it wasn't $32. They tease you with a side of bone marrow vinaigrette that tastes about as complex as off-brand olive oil. Something like an experimental ceviche, this dish is a scoop and slurp situation. Each chunk of \"quickly grilled\" squid is chopped with chilis, placed in a bowl filled with jicama, and soaked in a broth made from macadamia nut milk. Our problem is that the mildly sweet squid is rendered tasteless by all of the other components, resulting in what is essentially a $32 bowl of slightly spicy jicama cereal. Skip it or you'll wish you did."
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Chef Jordan Kahn's Meteoric Rise",
      "url": "https://guide.michelin.com/us/en/article/people/chef-jordan-kahn-meteora-vespertine-michelin-star-los-angeles",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "The chef/owner of Meteora and relaunched Vespertine earns multiple Stars for his two Los Angeles restaurants. While other restaurants in Los Angeles and around the country began reopening, Kahn was slow to reopen Vespertine as a sit-down restaurant, choosing instead to take stock of where they had been and where they wanted to go. \"The pandemic gave us this beautiful gift to learn how we can engage and connect with people in a deeper way through our storytelling and through the ingredients. It's a weird thing to say, but the pandemic made our purpose clearer.\" It was also during this time that the opportunity to open Meteora arose. \"It came into our orbit and I felt it was a really important opportunity to pursue as a response to the pandemic, because for me the pandemic did a few things. It accelerated the digital age by probably 10 years. Everything became hyper digital, which isn't a bad thing, but it also makes it so that there is maybe a little bit too much emphasis on the digital age and less emphasis on our natural world. We really wanted Meteora to be a little bit of a reciprocal response to that—not forgetting that very basic premise, which is nutrition is how humans access nature.\" Jordan Kahn reopened Vespertine in April 2024. He describes the new restaurant by sharing what it always was. \"It's a modern exploration of exceptional ingredients that incorporates multisensory elements to deepen our diners' and our guests' connection, understanding, impact and taste of those ingredients.\" Of course, just like the takeout boxes, Vespertine is also deeply personal. \"Dining at Vespertine is sort of like dining in a museum of my life, and as with time, it's evolved and matured in the way that I have evolved and matured. Its purpose remains the same, but it is even more clear now. Our tenets of culinary approach remain the same, but we're just more fine-tuned. Now with two fine dining restaurants and Destroyer, a café located across from Vespertine, Kahn is running a constellation of restaurants, one that he sees as complementary. \"Their essential purpose is the same, however, the way that we execute it is specific to each of the restaurants. Vespertine only has 20 seats, so it allows us to craft experiences that are extremely detailed, and we have a very specific choreography. Meteora is in a place where you really feel like you're in a jungle, and that's by design, to take people out of feeling like they're in the middle of a metropolis. Walking into Meteora is truly like walking into a portal into another world. We apply the same ethos in very different ways across the two restaurants because the setting is a bit different and the context is a little bit different, but it is essentially the same kind of end result.\""
    },
    {
      "source_id": "src_hollywood_authentic_2024",
      "publication": "Hollywood Authentic",
      "title": "METEORA",
      "url": "https://hollywoodauthentic.com/meteora/",
      "published_at": "2024-05-11",
      "trust_level": "editorial",
      "content": "Jordan Kahn's Meteora is nothing short of spectacular. There's a reason why Kahn has two Michelin stars at such a young age, and Meteora is just one of them. Hailed by the late Jonathan Gold, the legendary LA Times food critic, Kahn is not a stop short of perfection. There is no real foodie, wine connoisseur, critic, ratings person, dog, cat, or alien that wouldn't have a good time here. Leave it at the door, and relax into one of the best dining experiences you'll have right now in Los Angeles. First, about the space… 6703 Melrose Avenue has a past. And yep, I was around for it. I've lived in this neighbourhood for nearly 19 years. I've watched it change and grow, and I've had eyes on that address – both as a restaurant lover and a real estate junkie. Here's the download. After the long-standing and popular Hatfields moved on, 6703 Melrose was never fully reinvented or realised – that is, until Kahn came along. Photographs by ADAHLIA COLE & COLIN PECK. At 16, Jordan Khan left Savannah for Charleston, wrote a nine-page letter to French Laundry's Thomas Keller, and kickstarted his somewhat destined journey to Meteora. Kahn earned his stars at his progressive and interstellar restaurant, Verspertine, located in Culver City. I've been there a few times and it is something else. Talk about levels: Vespertine is all the way up. It temporarily paused in-house dining in 2020 but – so a little birdy told me – it may (off books) reopen later this year. But there is no doubt that Kahn's style, work ethic, attention to detail, love of the craft, open mind and humble genius all fuelled his swift rise to the top. Gratitude and good energy emanates from him, his co-workers, the food and beverages themselves, and from the entire restaurant. Let's talk about the food. My bestie Jacqueline King Schiller and I went all out on the chef omakase menu… 'We work directly with farmers, fisherman, ranchers, and foragers to create hyper-seasonal menus of exceptional quality with a commitment to sustainability and environmental impact,' say the show notes. This pays off in not only the quality of the ingredients, but the menu as a whole. This is a dining experience filled with flavour pairings that are creative yet cohesive; deeply evocative of the place and the season. Take something as simple as the fourth dish, avocado and caviar, for example. Only two ingredients, and yet so much more. The avocado, drizzled with pressed oil from the seed, imparted with the subtle flavour of the leaves, cradles a large spoon-full of top-notch caviar. Yummy. What surprised me about this is not only the dish itself, but the story behind it (another reason why I love Jordan Kahn, and I love Meteora). Check this: the avocado was farmed by a local osteopath who farms avocados on his land as a hobby."
    },
    {
      "source_id": "src_kevineats_2024",
      "publication": "kevinEats",
      "title": "Meteora (Los Angeles, CA) [2]",
      "url": "http://www.kevineats.com/2024/07/meteora-los-angeles-ca-2.html",
      "published_at": "2024-07-03",
      "trust_level": "editorial",
      "content": "Meteora Restaurant 6703 Melrose Ave, Los Angeles, CA 90038 323-402-4311 www.meteora.la Wed 07/03/2024, 08:00p-11:30p I last reported on Jordan Kahn's Meteora back in July 2022, not long after the place opened. I was quite fond of that last meal at the difficult-to-classify, modern-primitive, predictably-polarizing Hollywood eatery, and figured that it was time for a revisit, especially since I'd read that the team had changed things up quite a bit. As you enter Meteora, you're greeted by the restaurant's bar/lounge area. The decor is some of the most unique you'll find in LA, and is designed to resemble a structure that's been taken over by the jungle. The space was penned by Roth Architecture, based in Francisco Uh May, Mexico, not far from Tulum, so you can certainly see that inspiration. When Meteora first opened, it was a purely à la carte affair, but by November 2022, an $85 tasting menu had already been implemented, and was formalized the following May at $95 for five courses, with You also get a choice of five supplemental dishes that you can add on to your meal, if desired. Meanwhile, the restaurant began offering a 12-course \"omakase\" option at $195 a head back in June 2023, while an à la carte lounge experience commenced in September. Brunch was also initiated in February last year, but is apparently no longer offered. Click for larger versions. Here we see the cocktail list (now divided into Native, Timeless, and non-alcoholic sections), which has got to be one of the more unusual in the Southland, especially since it ostensibly restricts the use of sugar and other refined ingredients. Apparently, it's the creation of Dave Purcell, an alum of Winston House/The Waterfront Venice, NoMad, Melrose Umbrella Co, Dirty Laundry, and Playa. Click for larger versions. Meteora's wine list has been greatly expanded since my last visit, and is uniquely arranged based on geographical features. Kalimaz [$9.00] | Gerba - Guji, Ethiopia The coffee was some of the fruitiest I've had, and came with a serving of oat(?) milk and a trio of sweeteners. Pictured above is Meteora's famously vegetated main dining room, cleared out at the end of the night. Following my last dinner at Meteora, I described the food here as \"live fire-focused, elemental, naturalistic/modernist cooking with a pre-colonial Latin American bent,\" and I think that long-winded descriptor still holds true. However, Kahn's cooking has become more focused, more curated, really showcasing the Chef's singular, imaginative, original vision through a parade of dishes that veer toward both the primal and the avant garde, that look back while looking forward. Meteora may very well be the most underrated restaurant in Southern California, and definitely deserves to be Michelin-starred, so hopefully that'll be corrected in the next revision of the Red Guide."
    },
    {
      "source_id": "src_snobbish_2022",
      "publication": "Snobbish Media",
      "title": "LA Restaurant Review: Meteora",
      "url": "https://snobbishmedia.com/blog/la-restaurant-review-meteora",
      "published_at": "2022-09-07",
      "trust_level": "editorial",
      "content": "You all know I love a good dining experience, so I was extremely excited to try out Chef Jordan Khan's new restaurant Meteora, which is on Melrose in West Hollywood. Especially because I have already been to some of his other restaurants like Vespertine and Destroyer, I already had pretty high expectations of what the food/ambiance would be like. And let me tell you, he did not disappoint. It was absolutely soooo stunning inside and I literally felt like I had entered some kind of oasis or spa. While the vibe of the restaurant is very earthy and organic, I like that it still looked sophisticated and put together. Like you can't tell me that the these pictures I took don't look like they came straight out of Pinterest. Also, I don't know how other people might feel about this, but they had a person come around the restaurant every so often with sage, which I think was to probably like cleanse the energy or something. At first when I came here I thought that it was only going to be a tasting menu, but actually it's just a regular sit down restaurant where you can order whatever you want (which I kind of prefer because I usually can never finish all the courses on tasting menus). But, seriously before I show what I ordered, I just want to say that everything that I was served was so beautiful, like this meal was legitimately art. When you first sit down they serve you these little cups of stone-fruit kombucha. It was so yummy and I literally could have had a whole glass of it. Zea: ancient purple corn, pressed plum juice, plum pit, avocado leaf, opuntia, barrel-aged corn spirit · Both cocktails were really good and unique, but they were not really that sweet. So, if you are more of a sweet, sugary type of cocktail fan, just be aware that these are not that."
    }
  ]
}