{
  "place_slug": "mexicali-taco-co",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Mexicali Taco & Co. - Review - Chinatown",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/mexicali-taco-chinatown",
      "published_at": "2024-05-28",
      "trust_level": "editorial",
      "content": "Back in 2009, two Mexicali natives opened up their tiny taco stand on a surface parking lot in a part of Downtown best described as \"by the highway.\" Yet despite the low profile location, word traveled pretty quickly about the authentic Baja-style tacos being served at 1st and Beaudry Street. LA probably has more taco stands than it does bachelor degrees, so to gain ANY traction selling them is a monumental accomplishment in and of itself. Now fast forward a few years, one recession, and still no taco emoji later, Mexicali Tacos has hot, new digs on the other side of the highway (Chinatown!) and is as busy as ever. Despite still being in a rather quiet corner of downtown, the surrounding area has most certainly taken notice. Come to Mexicali on a weekday afternoon and you will find Financial District lunch-goers, Echo Park hipsters, Elysian Valley locals, and little old Chinese ladies all eating together, thanks largely to the fact that the menu is concise and the price is right. For about $12, you could eat your way through half of the menu by yourself, and no matter who you are, we're betting you like those kind of numbers. As for what to order, Mexicali Tacos is known for a few things, but their freshly-shipped Baja tortillas and carne asada sit atop the throne. And nowhere on the menu is that better exemplified than in their now quite famous Vampiro Taco. Gracing all of the most important \"Best Taco in LA\" lists, this glorified quesadilla does not dissapoint. And despite what your worst nightmares might be telling you, there's no blood to be found inside. Only the craziest use of garlic sauce in the city. Don't ask questions, just eat. It's reputation certainly precedes it, but luckily she lives up to expectations. The secret of this quesadilla-like thing is of course in that unexpected garlic sauce they put on the inside. If you think garlic on tacos seems super questionable, you're not alone. But something magical occurs and the result is one of the more interesting taco experiences in the city. When people hear \"baja tacos\", they often think of fish tacos. But at Mexicali, this shrimp taco is the only seafood to be found. Adobado-grilled with gooey cheese on top, this little guy is an unexpected delight. No longer just for eating while you watch the Lakers lose, Mexicali's nachos are enormous and pretty dmn good. Perfect for rabid co-workers looking to eat away frustrations. Served rather plainly, the real reason to order this is to take full advantage of their amazing salsa and toppings bar. What's usually an easy, one-way ticket to Ecoli poisoning, their little buffet is all fresh, delicious goodness. Pretty Good: You'll likely be satisfied by a meal here, especially for a specific situation. These are handy back-up restaurants and beloved local spots."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Mexicali Taco & Co. | Restaurants in Chinatown, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/mexicali-taco-co",
      "published_at": "2025-05-31",
      "trust_level": "editorial",
      "content": "Northern Baja-style tacos reign supreme at Mexicali Taco & Co, which has locations in both Chinatown and San Gabriel, thanks to head chef Esdras Ochoa's housemade tortillas and excellent salsas made with ingredients from just across the border. While you can't go wrong with their regular tacos and, of course, their wonderfully crispy, crema-laden Baja-style fish taco, the real draws here are more gluttonous dishes like the triple meat and cheese-filled Zuperman and the garlic-lashed vampiro stuffed with with hand-chopped carne asada. Then again, when everything on the menu's a winner, it's pretty hard to pick a true favorite."
    },
    {
      "source_id": "src_theinfatuation_2020",
      "publication": "The Infatuation",
      "title": "The Chinatown Takeout & Delivery Guide",
      "url": "https://www.theinfatuation.com/los-angeles/guides/chinatown-la-takeout-delivery-best",
      "published_at": "2020-09-08",
      "trust_level": "editorial",
      "content": "Despite the proliferation of great taco shops in Downtown these days, Mexicali still ranks among our favorites. The vampiro is a garlic-accented quesadilla that's a thing of legend – particularly when topped with a fried egg – and the cachetada is a skinny, crispy tostada dressed with a chipotle aioli. Even the nachos, topped with chorizo, chicken, and carne asada, are excellent. There might be hotter taco names out there these days, but Mexicali is still one worth paying a visit to."
    }
  ]
}