{
  "place_slug": "mini-kabob",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Mini Kabob - Review - Glendale - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/mini-kebab",
      "published_at": "2025-05-22",
      "trust_level": "editorial",
      "content": "It's no hyperbole to say you can smell kabobs pretty much anywhere you go in Glendale. The city is home to the largest Armenian community in the US, making the task of finding excellent skewers an easy one. There are crowded, big group spots like Raffi's and Carousel, lule specialists such as Moon Mart and Adana, and more spots for grilled meat on lavash than there are parking spots at The Americana. But if you want the best of the best, an LA classic that epitomizes kabob perfection, the choice is simple: Go to Mini Kabob.\n\nThe menu here revolves entirely around giant combination plates. There are 12 in total, including lamb chops, beef lule, pork shish kabob, and falafel. They're all tremendous, but whether you're at Mini Kabob for your first time or your 50th time, no meal is complete without a chicken cutlet. This signature dish is technically a chicken lule kabob that's been hand-shaped to resemble a giant baked potato. The interior is sweet and juicy with a golden-seared exterior similar to what you'd find on a great Maryland crab cake.\n\nFor Mini Kabob first-timers, there'll be a moment while staring at the combo plates, when you ask to no one in particular, \"Ok, but which one?\" Answer: This one. It's Mini Kabob's most famous dish and one of the best kabobs we've ever eaten. The large, oval-shaped cutlets (each plate comes with two) are made with sweet juicy ground chicken that's been seared to a crisp golden-brown. The $24 combo also comes with a heap of buttery rice, hummus, and roasted vegetables on the side, so this is definitely a two-meal situation.\n\nEven great kabob shops tend to have a few throwaway items included in their combo plates. Not Mini Kabob. A charred pork tenderloin kabob might be the star of the show, but then you start eating the buttery, plump long grain rice underneath and realize this is a shared stage. Blistered, fire-roasted jalapenos and tomatoes aren't only there for decoration, they enhance the innate smoky sweetness of the beef lule, chicken thigh, and lamb chops. The creamy, lemon-drizzled hummus has just a pinch of heat from the Aleppo pepper. And whatever you do, load up on as many housemade garlic sauce packets as you can fit in the bag. The pungent spread tastes good on literally everything—including lunch today, leftovers tomorrow, and whatever you're cooking three days from now.\n\nMini Kabob's dime-sized shop is located in a small building on a residential side street south of downtown Glendale. This is usually when we'd mention it's a little tricky to find, but as long as your nose works, you'll be fine—the fragrant wafts of grilled meat hit you before you even get out of the car. Follow the savory plumes and you'll end up at an open door frame with a table in it. This is where the ordering goes down, or for most people, where you'll scurry to grab a bag full of food that you ordered online. There's no shame in that game (even prior to the pandemic, Mini Kabob was mostly a to-go operation), but if you have a minute to spare, take a seat on the sidewalk picnic table. It's shady and peaceful, and you'll get a front-row view of the eccentric family that runs the place (mother, father, and son) all cooking together and lovingly harassing each other in the kitchen. It's the ideal environment to soak in the complete sensory experience that is Mini Kabob.\n\nMini Kabob's combo plates might be massive, but that doesn't mean you can't add a few sides to round things out. The eggplant caviar is a particular standout. It's made with roasted red peppers and eggplant pureed into a smooth, smokey sauce ideal for dipping lavash, meats, or anything else on the end of your fork."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Mini Kabob | Restaurants in Glendale, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/mini-kabob",
      "published_at": "2025-03-01",
      "trust_level": "editorial",
      "content": "Chef-owners Ovakim and Alvard Martirosya and their son, Armen, run this tiny kebab house together, turning out flawless, soulful food fueled by decades of skill and a lot of love for each other and their ancestral cuisine."
    },
    {
      "source_id": "src_timeout_la_2023",
      "publication": "Time Out LA",
      "title": "Westfield Topanga Social to add Mini Kabob, Amboy and other chef-driven eateries",
      "url": "https://www.timeout.com/los-angeles/news/mini-kabob-amboy-and-others-are-coming-to-a-shiny-new-mall-food-court-in-the-valley-031023",
      "published_at": "2023-03-10",
      "trust_level": "editorial",
      "content": "The award-winning Mini Kabob, best known for Armenian-style chicken and beef lula, is among the 25 opening food and drink vendors at Westfield Topanga's ritzy, brand-new food court. One of L.A.'s best restaurants, plus other noteworthy spots, will debut at the Canoga Park food hall this spring. Opening this spring, Westfield's Topanga Social is set to add Mini Kabob, Amboy Burgers, Katsu Sando and other high-profile L.A. food names.\n\nIn the case of the Martirosyans, however, the decision to expand Mini Kabob after decades in business is particularly noteworthy. Over the years, the family has taken plenty of meetings with outside entities in hopes of opening another location, but none have provided as compelling a business proposition as the Westfield team. There's also the fact that both of Armen's parents aren't getting any younger, and he'd like to be able to let them take a step back from the day-to-day operations, especially after his mother, Alvard, was hospitalized in early December.\n\nThough expansion plans often bring up questions of quality control, Westfield has made it clear to incoming Topanga Social vendors that the company is dedicated to maintaining the same level of consistency that has made these L.A. restaurants beloved citywide. In the case of Mini Kabob, that means the Martirosyans will soon be training a new outside chef at the satellite location to the same exacting standards that Ovakim, Alvard and Armen have set."
    },
    {
      "source_id": "src_foodgps_2023",
      "publication": "Food GPS",
      "title": "Small Building, Big Flavor on Glendale Side Street",
      "url": "https://foodgps.com/mini-kabob-glendale/",
      "published_at": "2023-11-06",
      "trust_level": "editorial",
      "content": "Mini Kabob is a tiny three-table restaurant situated on a Glendale side street that I visited nearly 10 years ago, inspired by Charles Perry's LA Times article, long before The Americana opened around the corner. I love Mini Kabob and when I don't eat here, I will drop by to pick up her egglant babaganoush and hummus which I think are some of the best in Glendale next to Kabab Way. I hope to write a \"Side of Salt\" posting on their story. Hovik and Alla are quite funny people. Hovik quickly changed his Armenian music to Euro Techno when J & I came to eat here.. because \"we look young\" haha.\n\nMini kabobs are flavorful, fresh quick-hitters that fill the 20 minutes it takes for full-sized kabobs to cook on the special gas grill lined with ceramic tiles. The Combination Plate ($12.95) is a great way to try different meats, with two pieces each of marinated pork tenderloin, chicken thigh, and the ridged casing-free ground meat sausage known as lule. In the case of the combo plate, it's chicken, though they also offer beef. Each plate comes with steamed white rice, a thatch of parsley and raw white onion a grilled tomato and pepper, both singed black.\n\nBeef Shish Kabob ($12.95) was a good way to incorporate another animal into our omnivorous meal, featuring thick slices of somewhat chewy flap meat. Lamb chops and chicken breast are the only meats that will have to wait. Hovik was practically offended when I asked if the dusting of red spice that topped their Hommus ($5.95) was paprika."
    },
    {
      "source_id": "src_consumingla_2013",
      "publication": "Consuming LA",
      "title": "Your Armenian Mama's Kitchen",
      "url": "http://www.consumingla.com/2013/04/18/mini-kabob-glendale/",
      "published_at": "2013-04-18",
      "trust_level": "editorial",
      "content": "Nestled on a residential side street a few blocks from The Americana and Glendale Galleria, Mini Kabob is a little mom and pop shop that serves some of the best Armenian food in the city. To say it's a hole in the wall would be an understatement. It has three small tables and you feel as if you're eating in the kitchen of your grandmother or favorite aunt while she cooks for you. Ugly upholstered chairs and a dreary oil painting on the wall add to the charm of this hidden gem.\n\nThe restaurant is run by \"Mama\" Alla and \"Papa\" Hovik, a friendly immigrant couple from Yerevan, Armenia. Mama does the cooking in the open kitchen and Papa works front of the house. Everything Mama makes is delicious. Your meal starts with amazing homemade hummus served with Armenian lavash bread. There are several choices of kabobs including beef, pork and beef luleh (ground beef), but the best is the chicken."
    }
  ]
}