{
  "place_slug": "mustards-bagels",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Mustard's open-faced bagels are worth planning your weekend around",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/mustards-bagels",
      "published_at": "2025-11-07",
      "trust_level": "editorial",
      "content": "Mustard's started as a window in Highland Park that exuded a \"we're here until we're not\" attitude, but now they have an actual storefront in Culver City, where they'll be opening permanently in 2026. We can't wait until we can get our hands on these bagels every morning of the week, but for now, their crackly dough rings are available Friday through Sunday—a great time to experience the most exciting addition to LA's bagel scene since Courage landed on Virgil. Our sole advice is to make sure you arrive early, since they occasionally sell out before 1pm. There's excellent single-origin filter coffee available while you wait, but since Mustard's is run by one of the founders of GGET, don't expect any cream or sugar to be on hand.\n\nMustard's is more like a neighborhood kickback than a bagel shop. Kendrick occasionally plays from the speakers, blasting DJ Mustard's \"MUSTARRDDD\" line. There are just a handful of tables scattered out front, and a tiny kitchen where you'll see incredible sourdough bagels emerging every few minutes. The crackly, blistered crust sends flakes everywhere like a Nature Valley bar, but it's a glorious mess that you won't bother brushing off until the bagel is gone. If you merely keep it simple with a few loosies—which come in flavors such as salted plain, toasted sesame, everything, and nori everything, plus schmears like miso scallion or chimichurri—you'll leave very happy. That said, the open-faced sandwiches are where things get interesting. The Grampa Sam is their excellent albeit fairly straightforward interpretation of a classic lox bagel, but for something less traditional, there's the Deanna Michelle, layered with chili oil and cucumbers, and the Weezy, a breakfast-dessert hybrid with cocoa spread and bananas—two of our favorites.\n\nThis is what happens when a classic lox bagel adds some pizzazz. You've got house-smoked salmon draped over a crackly sourdough base, while the pickled onions and cucumbers add a refreshing pop.\n\nBanana-Nutella crepes, step aside. The flavor combo works even better on a salted sourdough bagel. The banana slices are brûléed until a crunchy caramel shell forms, and the housemade hazelnut-cocoa spread resembles glossy chocolatey lava. A dusting of bee pollen on top gives each bite a crunchy little pop like sprinkles.\n\nFor the heat lovers out there. This spicy special comes with cream cheese that's mixed with five kinds of pickled chiles, red onion, a jammy egg, and a few blistered Jimmy Nardello peppers on top for good measure. I'll make you sweat, but it packs plenty of flavor, too.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_theinfatuation_2025_guides",
      "publication": "The Infatuation",
      "title": "The 14 Best Bagels In Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/la-best-bagels",
      "published_at": "2025-03-10",
      "trust_level": "editorial",
      "content": "LA is having a bagel renaissance. Let's talk about it. LA has its share of bad bagels, but when we make good ones, they're fantastic. No one can argue that, even opinionated purists who don't live on this coast. And since there's no such thing as an \"LA-style bagel,\" we have bakeries, pop-ups, and window shops that serve every type of yeasty dough ring under the sun, like Montreal-style, \"rip-and-dip\" bagels, and bagel sandwiches filled with freshly smoked pastrami. There's a lot to explore, but these 14 spots make the argument that LA is a bagel town, after all.\n\nMustard's Bagels (10850 W Washington Blvd, Culver City, California 90232) - This tiny weekend-only pop-up in Highland Park (run by the co-founder of GGET) has a \"we're here until we're not\" attitude and often sells out by 1pm, which might be annoying if its crackly, fresh-baked sourdough bagels weren't so incredible. As good as the loosies are, their messy open-faced sandwiches are even better. We're fans of the Grampa Sam with a flurry of fried capers that's their take on a classic lox situation, but the standout is the Deanna Michelle, a play on Din Tai Fung's cucumbers that's topped with chili oil and miso scallion schmear. There's excellent single-origin coffee available while you wait in line, but since Mustard's is run by one of the founders of GGET, don't expect any cream or sugar to be on hand. Food Rundown Grampa Sam: This is what happens when a classic lox bagel adds some pizzazz. You've got house-smoked salmon draped over a crackly sourdough base, while the pickled onions and cucumbers add a refreshing pop. The fried capers are a fun surprise—crunchy flavor bombs that taste like salty Pop Rocks. Deanna Michelle: A simple but brilliant combination of toppings that reminds us of Din Tai Fung's cold cucumbers in bagel form. The miso-scallion schmear lays down a solid base of umami, the crisp cucumbers are neatly tiled like dominoes, and the chili oil seeps into every nook and cranny."
    }
  ]
}