{
  "place_slug": "night-market-sahm",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Night + Market Sahm - Review - Venice - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/night-market-sahm",
      "published_at": "2023-04-15",
      "trust_level": "editorial",
      "content": "Venice isn't exactly a hotbed of quality Thai restaurants, so it's a big deal that one of LA's coolest Thai spots, Night + Market, opened their third location down near the beach. If you've been to one of their other restaurants, then you know the deal at Night + Market Sahm - great Thai food, occasionally with a modern twist (like drunken noodles with pastami, and a personal-sized peking duck pizza). The bright space on Lincoln is already slammed, with hour plus waits on weekends, but once you do get seated, food comes out quickly (if occasionally in a random order), service is efficient but friendly, and there's plenty of natural wine to drink. If you live in the area, this is about to be your regular spot. Truly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_timeout_la_2019",
      "publication": "Time Out LA",
      "title": "Night + Market Sahm | Restaurants in Venice, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/night-market-sahm",
      "published_at": "2019-01-10",
      "trust_level": "editorial",
      "content": "Night + Market Sahm is the third outpost of Kris Yenbamroong's trendy new-school Thai mini-chain. Known for its salty, spicy cuisine, natural wine list and party-like atmosphere, the restaurant has even expanded to Las Vegas. In the last few years, the buzz around Night + Market as dissipated to a sensible murmur—and while the Lincoln Boulevard location is easier to get into than ever before, the restaurant's street food-inspired menu still fires on all cylinders. Salt-forward signatures like the party wings and pastrami pad kee mao pair well with a glass of beer or wine, though you can find Thai takeout standards like pad thai, massaman curry and som tum (papaya salad) with their flavors cranked all the way up. Compared to its siblings in West Hollywood and Silver Lake, Night + Market Sahm offers a little more space and a far less hectic crowd. Other standouts include the nam khao tod (crispy rice salad), moo sadoong (startled pig) and three flavor whole fish, the last of which is available only for dine-in customers. Also, the fried chicken sandwich here is one of the best in the city—but since it's a meal unto itself, I wouldn't recommend ordering unless you're going all in on it."
    }
  ]
}