{
  "place_slug": "oybar",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Oy Bar - Review - Studio City - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/oy-bar",
      "published_at": "2024-05-30",
      "trust_level": "editorial",
      "content": "Oy Bar is a dive bar in Studio City that serves a fantastic burger, among other elevated bar foods. Nothing about Oy Bar's dimly lit interior feels particularly remarkable. Dated wood paneling lines the walls, old chipped-up swivel stools dot the bar area, and 1980s-era dropped ceiling tiles hover above everything. In other words, it's exactly how a dive bar should look. The crowd is a mix of people in their 30s drinking $9 Old Fashioneds and dissecting script pitches, long-time Valley residents reminiscing about The Bar At Oyster House (the previous tenant, hence the name), and college kids home on summer break ripping shots because it's somebody's birthday. It makes for an eclectic mix—the scene is one of the charms that draws people in—but it's the food coming out of the kitchen that keeps drinkers in their seats. Oy Bar's elevated bar menu is made up of what can best be described as Jewish comfort classics that did a semester abroad. And perhaps more crucially, they are also the kinds of foods you want to consume while drinking.\n\nOne item that's not to be missed under any circumstances is the burger. In fact, if you're reading this and it's after 6pm (when Oy Bar opens), just get in your car and go eat it. The juicy beef patty comes topped with hoisin ketchup and an entire herb garden's worth of cilantro, giving it a uniquely tangy, fragrant flavor—while still delivering the kind of unfussy bar burger experience you want from a place that blasts '90s R&B and has \"cold beer\" listed on their menu. It's already one of our favorite burgers in LA. A heavy helping of cilantro is something we've never seen on a burger before, but Oy Bar proves it's a pretty great match with a thick, medium burger patty.\n\nTake the \"Jeff's Special\" quesadilla: a gooey, over-the-top masterpiece filled with smoked pastrami, sauerkraut, and covered with a crispy gruyere-jalapeno crust on the outside. At Oy Bar, the Reuben quesadilla is practically a Swiss army knife. Filled with pastrami, sauerkraut, and gooey comté cheese—with a gruyere and jalapeño crust for good measure—there's nothing subtle about this dish, but hot damn, it sure tastes good. Oy Bar doesn't serve fries, but these salty chunks of potato will scratch the same itch if you're craving some. Regardless, you should be ordering this because of the sweet, tangy chutney served on the side. It's meant to be a dip for the potatoes, but we usually end up eating it with a spoon.\n\nIf you're at Oy Bar for a quick drink, this is a great dish to pick at while you stare into space. It's a play on a traditional deli pickle tray, only here it's served in a bento box: there's various types of pickled vegetables and sauerkraut. The wings at Oy Bar are habañero-honey flavored, and while we wish there was a bit more heat to complement the sweetness, overall these are well-cooked, meaty wings that will likely vanish instantly upon arrival.\n\nFor obvious weather-related reasons, this noodle soup comes and goes during the summer months. But if it's on the menu while you're at Oy Bar, don't hesitate. Made with a light, ginger-scallion chicken broth, and filled with thick cuts of chashu, mushroom, egg, chili crisp, plus a giant matzo ball, this is a soul-curing bowl of soup—and not at all a gimmick.\n\nIf you live in and around Studio City, congratulations: You've got yourself a great dive bar that'll make friends in other neighborhoods jealous. If you don't live nearby, make a trip to Oy Bar anyway. We promise your bubble will still be there when you return."
    },
    {
      "source_id": "src_timeout_la_2022",
      "publication": "Time Out LA",
      "title": "Oy Bar | Bars in Studio City, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/oy-bar",
      "published_at": "2022-11-03",
      "trust_level": "editorial",
      "content": "The liquor licensed follow-up to Jeff's Table in Highland Park, this buzzy Studio City dive bar is livening up the Valley's drinking scene with an eclectic, ever-changing menu of Jewish-ish bar food (until 10pm) and strong cocktails served until midnight. Housed in a former oyster bar (hence the name), this no-reservation spot fills up early with patrons hungering for self-taught chef Jeff Strauss's matzo ball ramen and smoked salmon onigiri. Though we honestly felt the fusion fare here left something to be desired, spirit-forward cocktails like the Best Mistake (Japanese vodka, mint, lemongrass, lime, apricot) and the Imported Goods (rum, cognac, honey, lemon, herbs) make Oy Bar a worthwhile SFV destination for a stiff drink with a side of chaos cuisine."
    },
    {
      "source_id": "src_resy_2025",
      "publication": "Resy",
      "title": "How Oy Bar in Studio City Reinvents Classic Bar Foods",
      "url": "https://blog.resy.com/2025/07/how-oy-bar-in-studio-city-reinvents-classic-bar-foods/",
      "published_at": "2025-07-07",
      "trust_level": "editorial",
      "content": "After a recent meal at Oy Bar, I posted some poorly lit, amateurly shot iPhone photos to my Instagram story. My DMs immediately lit up: \"Love it there so much.\" \"The best!\" \"My favorite spot,\" and so on. As a food writer who regularly documents her meals on social media, this felt like an abnormally excited response. The cult-like following for this dive bar-slash-restaurant in Studio City is real, and it's no wonder: Former Friends producer Jeff Strauss is the chef/owner behind both Oy Bar and Jeff's Table, a viral sandwich shop that developed a similarly passionate following after opening inside a Highland Park liquor store in 2019. Maybe it was all those years making Must See TV, but if there's one thing Strauss is great at, it's knowing his audience — and delivering to them playful, fusion-inspired dishes that are simultaneously adventurous and crowd-pleasing.\n\nStrauss, a self-taught chef and food lover, cooked for friends frequently over the years, throwing annual Super Bowl parties and catering occasional events. In 2019, frustrated with the entertainment business, he started thinking about turning his culinary hobby into a brick-and-mortar. After stumbling into The Bar at Oyster House (previously Valley fixture The Oyster House) to see a friend's comedy show, he felt a burst of inspiration. \"The minute I walked into the old Oyster House saloon, I knew I was somewhere special,\" Strauss says. \"It was this vintage 1970s neighborhood watering hole where you could still feel the community and the history,\" he adds. Strauss befriended the owner, Peter Jarjour, and learned that they lacked a real food program. So he started staging Monday night pop-ups there, making reubens, wings, pickle plates, and other creative dishes to go along with the drinks. The pop-up was such a hit that Jarjour approached Strauss about making food for another space he owned, Flask in Highland Park – aka the beginnings of Jeff's Table. Strauss used the Oyster House space to do some of his prep in the meantime. After the roaring success of Jeff's Table, which become known for mash-up style sandwiches like the Jubano (a fusion of a Jewish pastrami sandwich and a Cubano), Strauss and Jarjour transformed The Bar at Oyster House into Oy Bar in 2022, which serves Strauss's cheeky takes on bar food classics with a Jewish twist. When we say \"bar food,\" think anything that goes well with a beer: it might be a bowl of ramen, crispy fried artichokes, or even a classic cheeseburger."
    },
    {
      "source_id": "src_latimes_2025",
      "publication": "Los Angeles Times",
      "title": "Two very Los Angeles latkes for anytime of the year from OyBar's Jeff Strauss",
      "url": "https://www.latimes.com/food/recipe/story/2025-12-18/latkes-from-oybar-jeff-strauss",
      "published_at": "2025-12-18",
      "trust_level": "editorial",
      "content": "Latkes may be the food most associated with the eight nights and days of Hanukkah, but fried potato pancakes are delicious enough to eat anytime of the year — especially if you follow the advice of OyBar's Jeff Strauss. Strauss, the former TV writer and producer who not only founded OyBar in Studio City but the Highland Park deli Jeff's Table, takes a global approach to latkes. At his annual Whole Latke Love event, which this year runs through Dec. 20, he invites fellow chefs such as Bridgetown Roti's Rashida Holmes, Ronan's Daniel Cutler, Estrano's Diego Argoti and former Alta Adams partner and Jaca Social Club founder Daniel Patterson to serve their own free-wheeling takes on latkes. Recently, Strauss came to The Times Test Kitchen to share what he calls \"a very Los Angeles, very OyBar approach\" to latkes.\n\nOf course, none of these global twists would work if Strauss didn't begin with a great basic latke. And Strauss is a pro at making crisp, golden brown potato pancakes. \"One thing that's really important in a latke is the texture. I like something that is on the side of a hash brown, more than a kind of flat, cakey potato pancake.\" The way to get that lacy and crisp texture is by hand-grating the potato into long strips with some shorter strips mixed in to help the pancakes cohere.\n\n\"You're going to be tempted to use a food processor,\" says Strauss, who uses the largest holes on a box grater for his latkes. \"When you use a food processor, two things happen. One, you get a kind of random mush, even if you use the grating blade on the processor.\" Once you have your grated potato and onion you want to eliminate as much moisture as possible. Moisture, Strauss insists, is the enemy of potato pancakes. \"One secret to making a perfect latke is to put grated onion and potato in cheesecloth,\" he says. \"Then we're going to twist it and squeeze out as much liquid as we possibly can. That water that's in there, that just creates dark, unhappy latkes.\"\n\nThe best way to cook potato pancakes, Strauss says, is to shallow-fry them in about a half an inch to a third of an inch of neutral oil. \"I like to use a cast-iron pan,\" he says, \"because it holds the heat really well.\" Strauss uses a thermometer to check the temperature of the oil for readiness — he aims for 350 degrees. But he also relies on his senses. \"If your oil is too cold, you're not going to hear much sizzling,\" he says. \"If your oil is too hot, it's really going to jump and spit and react very strongly.\""
    }
  ]
}