{
  "place_slug": "paul-barfood",
  "sources": [
    {
      "source_id": "src_infatuation_2023",
      "publication": "The Infatuation",
      "title": "Paul Bar - Review - Palm Springs",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/paul-bar",
      "published_at": "2023-03-21",
      "trust_level": "editorial",
      "content": "Located in a strip mall north of the airport, Paul Bar/Food isn't the most convenient dinner spot in town - particularly if you're staying off Palm Canyon. But if you're up for a drive, your reward will be one of the coolest dinner experiences in PS right now. And we say cool, we mean 1940s-Rat-Pack-era, slinking-across-the-bar-with-a-martini type cool. The dimly-lit space is tiny - it's essentially one long bar and a few booths against the wall - giving the whole place an intimate, romantic vibe. Come here for some marinara-covered meatballs and a crisp wedge salad don't be fazed if the bartender tells you about some crazy celebrity that just came in, and know you will likely stumble out a few hours later, having completely forgotten you're in the middle of the desert. Pretty Good: You'll likely be satisfied by a meal here, especially for a specific situation. These are handy back-up restaurants and beloved local spots. Bar Cecil is our favorite place for date night in Palm Springs. Workshop in Palm Springs is a farm-to-table restaurant in a big industrial space. Peruvian Fuego is a great lunch spot in Palm Springs with tremendous pollo a la brasa. Boozehounds is a great option for a big group brunch in Palm Springs. Brant has been eating his way around town and attending corgi beach days since he moved to LA in 2009."
    },
    {
      "source_id": "src_desert_magazine_2021",
      "publication": "Desert Magazine",
      "title": "Roadside Attraction: Paul O'Halloran's strip mall restaurant and bar is packing them in",
      "url": "https://thedesertmag.com/good-taste/restaurants/roadside-attraction-paul-o-halloran-s-strip-mall-restaurant-bar-packing/",
      "published_at": "2021-12-07",
      "trust_level": "editorial",
      "content": "Of Vista Chino and Gene Autry Trail, PAULBar/Food shares the mall with a dispensary and a linen uniform cleaning service. But don't look for Paul's name; instead look for the large sign that reads BAR/FOOD. The food is consistently delicious and the tightly-curated menu allows each dish to shine. Our favorites are the Iceberg Wedge, made with a generous amount of crisp bacon and ranch dressing. The bone-in pork chop, burger and chicken schnitzel are favorite dishes that keep patrons coming back. Word to the wise: save room for Paul's signature pot de crème. The flavors vary nightly and constantly sell out. We loved the space. We loved the food. But we had questions for owner Paul O'Halloran. DM: You moved from New York — did you come to Palm Springs first or was it along the way? PO: I moved out here to marry a guy who was an old friend from NYC. I fell in love with Palm Springs and California. Opened PaulBar, got divorced and couldn't be happier. DM: On any given night, your place is packed—how do you explain the success? PO: People appreciate great service and a great cocktail, along with simple, savory food. Owner and host Paul O'Halloran is likely to greet you at the door, with his requisite bow tie. This is a small place: dark yet inviting, with a definite speakeasy vibe. You feel like a guest at an intimate gathering hosted by Paul himself. He really is the host with the most and makes all his guests feel welcome. The staff is a tight-knit team who strive to make every diner's experience an event. They are open Wednesday through Sunday, serving some of the finest unpretentious American fare in the valley. What will you find at PAULBar/ Food? PO: More than a few celebrities … one of my favorite actors of all time ... Broadway stars ... I'll never tell. Otherwise they won't come back. Plus they just wanna eat and have fun."
    }
  ]
}