{
  "place_slug": "perilla-la",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Perilla - Review - Chinatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/perilla-la",
      "published_at": "2025-05-22",
      "trust_level": "editorial",
      "content": "A long, leisurely lunch in the sunshine is sometimes crucial for maintaining your sanity. When it's one of those days, our destination of choice is Perilla, an inventive banchan shop in an idyllic courtyard cluster on the border of Chinatown and Echo Park. A lot of that has to do with their convenient grab-and-go cold case, stocked with a rotating selection of Korean sides like sweet pepper muchim and marinated okra. But beyond that, Perilla is an excellent spot to spend a few hours picking at a spread of kimbap and dosirak on their huge (and leafy) garden patio.\n\nThis casual daytime cafe takes inspiration from owner-chef Jihee Kim's hometown of Busan—where little banchan shops are a takeout staple. After cooking at Rustic Canyon, she began turning local produce into funky-fresh fermented dishes for her own banchan pop-up. Now Perilla lives in a 200-square-foot space that doubles as a neatly stocked mini-mart.\n\nBut don't let the color-coordinated yakju bottles and sauces on shelves fool you—what Perilla's unassuming kitchen puts out is on par with the best Korean restaurants in LA. And the fact that you can eat it in a beautiful communal courtyard next to a banana tree is icing on the cake.\n\nTHE BANCHAN\n\nThe banchan at Perilla is what Graceland is to Elvis fans—worthy of a special pilgrimage. The vegetable-dominated dishes aren't formally listed on the menu as they tend to vary from day to day, but a selection of a half-dozen or so containers is the first thing you'll see when you step inside. And for good reason. The banchan here are executed with the obsessive perfectionism of a breakup text. So whether you're granted collard green kimchi drizzled with sweet plum syrup, sprouting cauliflower tossed in sesame oil, or the creamy potato salad tinted with apples and fermented cucumber, it'll probably be the highlight of your day.\n\nBeyond banchan, Perilla dabbles in lunchboxes, rice combos, and noodle plates that you should order with the confidence of Taylor Swift watching the charts on New Music Friday. Their cod dosirak is the unmistakable headliner of this section, served perfectly charred and honey-glazed like a holiday dinner centerpiece. Though the gimbap is pretty special, too—each roll of dried seaweed is inch-perfect and skillfully packed with a balanced mix of creamy avocado chunks, crunchy pickled radishes, and marinated mushrooms.\n\nPerilla might have the ease and efficiency of a takeout window, but a sit-down meal in the adjacent mini meadow transforms an otherwise quick lunch here into a substantial event (in other words, you'll want to pull a Cranberries and linger in the garden). The fun, freewheeling menu would be stunning on its own, but the food becomes even more impressive in the context of the impromptu picnic happening daily on Perilla's lush patio.\n\nOUR FAVORITE DISHES\n\nBANCHAN SAMPLER FOR ONE\nThis sampler plate should be your go-to for a solo lunch. For $15, you get to try four of that day's banchan (picked by the staff), served over warm rice dusted with seaweed powder. The staff do a great job of picking complimentary banchan, which makes the dish come together when you mix all the varied textures and flavors in the paper tray.\n\nGIMBAP\nAn unmissable snack. The assortment of eggs, pickles, and meticulously cut vegetables are tucked inside toasted nori to form a neat little mosaic. And while this rice roll is a crunchy marvel on its own, the tiny squeeze bottle of spicy mustard sauce on the side adds some much-needed heat.\n\nSPICY ROLLED EGG\nA visual masterpiece that tastes as slick as it looks. It's a feat of science that this soft pinwheeled egg dish stays fluffy while the seaweed at the center retains its crunch. Don't hesitate when you see this stocked in Perilla's refrigerated case.\n\nSPICY BEEF DOSIRAK\nEven though this entree has the word \"spicy\" in its name, the marinade has more of a sweet taste. It's delicious, but you can probably skip this one unless you're in the mood for simple, nicely-charred beef over rice.\n\nCOD DOSIRAK\nWhile we like Perilla's juicy marinated chicken dosirak, it's the fish that steals our heart. We appreciate the smokiness of the two big chunks of grilled cod, and how the tender fish mixes with the soft-crunchy banchan beneath. If you're looking for a strategic lunch order, this is also one of the more filling dishes.\n\nAVOCADO & MENTAIKO RICE\nDo not, under any circumstances, skip this dish: it represents all that we love about this place. Between the bright pearls of trout roe, creamy avocado, and drizzle of rich mentaiko sauce on top, it looks a side dish you'd get from an over-the-top sushi roll spot. The briny roe against the buttery-cool avocado works through, and the combination of flavors is elegant, but also goes off like a bomb in your mouth.\n\nTRULY EXCELLENT: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Perilla LA | Restaurants in Echo Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/perilla-la",
      "published_at": "2025-04-19",
      "trust_level": "editorial",
      "content": "Five years ago, Rustic Canyon alum Jihee Kim built a devoted online fanbase for her seasonally driven banchan pick-ups during lockdown. Now, Perilla LA has opened a permanent storefront on the border of Echo Park and Chinatown, where in-the-know diners have already begun flocking for Kim's delicious, vegetable-forward Korean side dishes and made-to-order lunch plates.\n\nDelicate gyeran mari (rolled eggs), ong choy yuba muchim (water spinach and tofu skin salad) and tomato kimchi offer subtle, heady pleasures for your next summer picnic, but you can also enjoy your lunch on the few patio tables outside or in the Alpine Street retail complex's outdoor dining area, which borders a vegetable and herb garden and calls to mind a friend's backyard more than anything else. For a more substantive meal, I also like the garlic sesame noodles and avocado-and-ikura rice plate."
    },
    {
      "source_id": "src_latimes_2023",
      "publication": "Los Angeles Times",
      "title": "It's banchan heaven at Perilla L.A.",
      "url": "https://www.yahoo.com/lifestyle/banchan-heaven-perilla-110147669.html",
      "published_at": "2023-09-21",
      "trust_level": "editorial",
      "content": "Los Angeles food obsessives have long deliberated over which Koreatown restaurants serve the finest spreads of banchan — and whether the merit in a given flurry of small plates lays in the care of each dish's individual preparation, or in the sheer variety, or both. Soban, Genwa and Park's are three easy icebreakers for such open-ended debates.\n\nWhen Jihee Kim began her Perilla L.A. takeout project in summer 2020, she taught many of us to savor banchan as the meal itself. In her hands it was a given that this class of dishes, so full of geometries and colors and so urgent in flavor, commanded center stage at lunch or dinner. I can easily relive the first tastes of her food: halved, tapered okra pods charred for faint smokiness and then marinated in soy sauce and vinegar.\n\nFinding a home for Perilla cements a path that Kim always suspected she'd follow. She grew up in Busan, South Korea, where her parents run a restaurant started by one of her grandmothers nearly 40 years ago. Her father still roams the market each morning buying produce to make banchan. As a teenager she was enlisted in the laborious brining and fermenting of soybeans and cooked barley to create doenjang.\n\nKim moved to the Golden State when she was 20, first living in the San Diego area before relocating to San Francisco for culinary school. Cooking at places like fine-dining staple Gary Danko and now-closed Range in the Mission introduced her to the rhythms of the Bay Area growing seasons. She and her husband drifted back down the coast to be closer to his family in Los Angeles, and it was a natural fit when she found a place in the kitchen at Rustic Canyon, with its close ties to the Santa Monica farmers market.\n\nInstant enthusiasm for her Perilla pop-up spurred Kim to begin looking at spaces to house a banchan shop. It took three years, but in July she opened her storefront in a converted garage that's part of an emerging complex of food businesses in Victor Heights, a tiny neighborhood on the edge of Chinatown that borders Echo Park.\n\nLocating the place can feel like a treasure hunt on the first visit: Follow GPS to the address and look for the clutch of peachy-orange buildings along Alpine Street. Turn the corner at Heavy Water Coffee and follow the row of tables shaded with umbrellas to Perilla's gabled, 260-square-foot roost.\n\nAnd a straight-up spread of banchan — punctuated maybe with an order of gimbap filled with avocado, cucumber and other vegetables, or the crinkly cold noodles in soy-garlic dressing often available on weekends — is fundamentally communal. We mix, we match, we pass the rice; you take the smoked egg with its jellied yolk, I go heavy on the collards and the sweet peppers.\n\nPerilla, born in a time of isolation, has bloomed at last into a vital new daytime destination."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The Best Korean Restaurants In LA - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-korean-restaurants-in-la",
      "published_at": "2024-06-03",
      "trust_level": "editorial",
      "content": "In a town full of great Korean food, Perilla stands out for its fantastic seasonal banchan. But it's the mini meadow surrounding this Chinatown spot that transforms a quick lunch into a substantial event. Formerly a pop-up, this daytime spot in Chinatown operates out of a tiny cottage where colorful umbrellas sway over patio tables, and people walk through a garden sipping housemade yuzu soda."
    },
    {
      "source_id": "src_theinfatuation_2025_chinatown",
      "publication": "The Infatuation",
      "title": "The 18 Best Restaurants In LA's Chinatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-restaurants-chinatown-la",
      "published_at": "2025-07-09",
      "trust_level": "editorial",
      "content": "Banchan is the main event at Perilla, but that's only part of why this lunch spot stands out in a town full of great Korean food. Their huge garden patio is what transforms a quick, vegetable-dominated lunch into a substantial event. We especially love the neatly packed banchan combo, which comes with four daily banchan and seasoned rice."
    }
  ]
}