{
  "place_slug": "petit-trois",
  "sources": [
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Petit Trois – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/petit-trois",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Open and operating non-stop from noon until late night, this narrow room is always full and the counter is always cramped. While the setting may not sound overly comfortable, there is a focus on service, which makes every meal here a pleasant experience from start to finish. The French hip-hop in the background eschews tradition, but the cooking does the exact opposite. This menu is a canon of bistro favorites, like garlicky escargots de Bourgogne, steak frites with mustard sauce and what may be the city's best omelet. Try their \"Big Mec,\" a double cheeseburger with bordelaise and house sauce and fries. Facilities & Services: Air conditioning, Car park, Counter dining, Terrace, Valet parking, Credit cards accepted."
    },
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Petit Trois - Review - Hollywood - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/petit-trois",
      "published_at": "2025-05-13",
      "trust_level": "editorial",
      "content": "Petit Trois is a narrow, dark-wood bar counter in Hollywood that serves classic French bistro food. It's perfect for a date or long lunch. For the past decade or so, Petit Trois has been serving cheese-filled omelets from a narrow, dark-wood bar counter along Highland Avenue. And while many things have changed over the past ten years, including the crowds that you used to find huddled outside the front door waiting for a table, we appreciate that the food at Petit Trois isn't one of them: you'll still find the same pleasantly straightforward French bistro cooking (that doesn't skip on butter or garlic) set in an intimate space. It's perfect for dates, long lunches, or celebratory dinners at the bar with a friend or two. There was a time when waiting in the parking lot for a counter seat at Petit Trois was such an ordeal we'd divert people to the more spacious Sherman Oaks location as a safer bet. But since then, Petit Trois L'Original has added a covered front patio with a few tables and a spillover space next door (previously home to tasting menu spot Trois Mec). That said, eating in the main bar area is still the move. Mostly because the ambiance in the other two options is abysmal. You're either eating with a view of a parking lot or an empty, unused kitchen. However, the experience of dining at the main counter—watching cooks work in observing the small open kitchen with the smell of brown butter in the air—encapsulates Petit Trois' charm. Imagine a Masterclass where the subject is cheesy french onion soup and escargot smothered in enough garlic to require half an Altoids tin, with pours of grenache and friendly chatter on the periphery, and you'll grasp the romantic appeal. Most of the menu here is made up of neat, by-the-book French classics that might not blow you away if you've eaten them before, but are still undeniably delicious. The least traditional—and most famous—item is Petit Trois' Big Mec burger, which oozes a rich bordelaise. Our first thought when this soup arrives is always, \"damn, that's a lot of cheese.\" The molten cap of alpine cheese on top is the most noteworthy thing to say about this textbook soup, made with hearty veal stock, a glug of sherry, and jammy onions. Best enjoyed on a frigid, 60-degree night in Los Angeles. This classically French omelet filled with tangy-soft Boursin cheese made a quick cameo on a episode of The Bear, but Trois Mec has been serving this silky beauty since day one (pssssst, the secret is lots of butter). If it's hard to imagine getting excited about an omelet, know that this one makes other \"omelettes\" you've had seem like overcooked beaten eggs. These plump snails act as tiny vehicles for the delicious sauce made with tons of butter, garlic, and parsley. If your date or guest doesn't mind smelling that on your breath for the next hour, order this little snack with a glass of white burgundy."
    }
  ]
}