{
  "place_slug": "pine-and-crane-dtla",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Pine & Crane - Review - Downtown LA - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/pine-and-crane-dtla",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "Pine & Crane DTLA is the rare fast-casual spot where you'll actually want to have a sit-down meal. The open-air dining space is impressive enough for a birthday bash or rehearsal dinner, but communal tables and a mini-mart near the entrance keep it from feeling stuffy. The servers make jokes and high-five you for ordering a tequila sour at lunch, and even though you're on the ground floor of a luxury high-rise, you'll be surrounded by natural light and plants. But our favorite part of the restaurant is the covered patio. It's one of the most pleasant places to eat outside in DTLA, which is why you might have to weave between a few big group brunches to find a table on weekends.\n\nPine & Crane's Taiwanese street food should be the first thing that pops into your head at the start of your lunch break or when you're looking for a quick dinner spot to break things off with a summer fling that went on too long.\n\nThe cocktail menu at Pine & Crane involves lots of herbs, but everything we've tried was refreshing and subtle. For \"Walking On A Mountain Path In Spring\" they add some chrysanthemum in the mix for a floral twist on a grapefruit margarita. While \"Sun Moon Lake\" tastes like the black tea-infused cousin of a classic whiskey sour. If you prefer to keep it simple, choose a whisky, bourbon, or rye from the spirits section and they'll turn it into a highball for no additional charge.\n\nLet's just get this out in the open: the second location of Pine & Crane is the rare sequel that's even better than the original. It's an all-day cafe, market, and cocktail destination all wrapped up in a massive space that's easy on the eyes. In a perfect world, we'd probably come to this DTLA spot every week. And if you regularly sleep, work, or hang out near DTLA, please live out this dream for us.\n\nFor years now, Pine & Crane in Silver Lake has been that reliable LA spot for beef rolls and dan dan noodles on days when you can't make the trip to the San Gabriel Valley. They also branched out to Highland Park with Joy On York, serving an expanded menu of soups, buns, and scallion bread sandwiches to a new subset of clog-wearing NELA couples and their four-month-old babies. With this location of Pine & Crane, the team brought together the best elements of those two other spots—plus the Taiwanese breakfast items from their former Chinatown pop-up Today Starts Here—under one roof.\n\nDishes tend to come out of the kitchen here in a matter of minutes, so hypothetically you could be in and out of Pine & Crane within the hour. But it's also perfect for lazy lunches, first dates, and all other meetups with ambiguous end times. The beauty of this all-day restaurant is that it isn't some tiny dining room where people anxiously scramble for the next available table, but rather a gathering spot where you can eat, drink, and peruse at your own pace. In fact, it's the best version of a sequel—one that manages to top its predecessors by bringing its all-time favorite dishes to an all-around fantastic space.\n\nThe pork buns here are on the doughier side, with a wonderfully crispy brown bottom coated in sesame seeds. They're about the size of your fist and taste especially good dipped in a shallow bath of soy sauce and vinegar."
    }
  ]
}