{
  "place_slug": "pizzeria-mozza",
  "sources": [
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "Pizzeria Mozza – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/pizzeria-mozza",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Bib Gourmand: good quality, good value cooking\n\nMozza is at its essence a pizzeria, but so much more than a mere neighborhood haunt. It boasts the presence of Co-owner Nancy Silverton, whose culinary pedigree has foodies flocking to this Hollywood hottie. Adding to that, its sunny-yellow exterior and orange canopy set a Mediterranean scene. Make your way into this bright room donning bare wood tables and skylights.\n\nPizzas are far above average, beginning with that unmistakable cornicione—perfect spots of char that rim the crust and bring the flavor. Toppings are just as fanciful, highlighting goat cheese, leeks and bacon; or maybe squash blossom with burrata. Come dessert, Pastry Chef Dahlia Narvaez works her magic with scrumptious treats, like Meyer lemon and kumquat crostata."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Pizzeria Mozza - Review - Hancock Park - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/pizzeria-mozza",
      "published_at": "2025-06-11",
      "trust_level": "editorial",
      "content": "Let us be very clear. Pizzeria Mozza is good. The pizzas are built beautifully, most of them taste like you want them to, and you'll walk out of that door satisfied. The space is classy yet casual. Maybe even demure. It doesn't draw attention to itself, and is suitable for anything from a first date to a casual business meeting, to an impromptu solo dinner at the bar after a nice little trip to Wi Spa.\n\nBut if you're looking for spectacular pizza or are celebrating something, or someone, Mozza might let you down. Perhaps we're being too hard about all this but, this is pizza after all, and you deserve the truth. And the truth is that Pizzeria Mozza is not the best pizza and that's alright. Because it's still an LA classic with pretty good food in a relaxed, welcoming environment.\n\nMozza is a classic, Mozza can be very useful, but despite whatever your in-flight airline magazine's \"Spotlight on Los Angeles\" says, Pizzeria Mozza just isn't the best of the best anymore. Maybe that was the case for the decade after it opened in 2006, when Nancy Silverton was still sweating by the oven or chopping the chopped salad.\n\nThe meatballs al forno come out in scalding hot tomato sauce with a tower of cheesy, chewy sesame bread, and somehow remain delicate. And you must get the burratina antipasti, which is essentially a plump mozzarella ball (presumably made next door at the Osteria) resting on top of braised leeks and garlic toast. If you ordered just that and a glass of wine, you'd leave very happy.\n\nThe crust on the pies is puffy, crunchy, and light, but the tomato sauce on the margherita isn't memorable, and, while you can taste the quality in the toppings on the other pies, we'd rather eat them on their own. If you make this reservation weeks in advance, the pizza will underwhelm you.\n\nWhite pizza can only really work if you have excellent cheese and at Mozza, it shouldn't be a shock to anyone that they do. Unfortunately, these delicious toppings (fennel sausage, red onion, scallion) just don't adhere to the mozzarella. But that sausage is no joke. While this classic is the best way to experience Nancy's obsession with bread (the crust crackles and puffs perfectly), the tomato sauce is bland. This thing is magic. And also incredibly simple. Savory from the butterscotch, sweet from the marshmallow, salty from the sea salt. And step aside, sugar plums. Those little rosemary cookies on the side are actually what dance in children's heads at night."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out Los Angeles",
      "title": "Pizzeria Mozza | Restaurants in Hancock Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/pizzeria-mozza",
      "published_at": "2025-09-26",
      "trust_level": "editorial",
      "content": "For all the artisanal pizza joints that have opened up in L.A. in the last decade, Nancy Silverton's pies at Pizzeria Mozza have remained in a class of their own—and thanks to a supporting, ever-changing cast of bruschette, salads, unique pastas and desserts, it's still one of the best Italian restaurants in town.\n\nDoughy, chewy and lightly charred, Silverton's flatbreads feature cheffy, farmers' market toppings like squash blossoms and fennel sausage. Newer menu additions include a chicken parm made with caciocavallo cheese, pasta alla vodka and cheesy gnocchi. Throw in over a half dozen compelling dolci—among them, the always-trusty butterscotch budino and the freshest versions of Silverton's famous gelati and sorbetti—and you're all but guaranteed a memorable fancy pizza dinner. In the summer, chase your pizza with sides of corn al forno and zucchini a scapece."
    },
    {
      "source_id": "src_timeout_la_pizza_guide_2025",
      "publication": "Time Out Los Angeles",
      "title": "The best places for pizzas in Los Angeles, ranked",
      "url": "https://www.timeout.com/los-angeles/restaurants/best-pizza-restaurants-in-los-angeles",
      "published_at": "2025-09-29",
      "trust_level": "editorial",
      "content": "What is it? Unapologetically Californian pizzas from local celebrity chef Nancy Silverton within her larger three-restaurant Mozzaplex in Hancock Park.\n\nWhy we love it: Despite the numerous pizza places that have opened in recent years, Pizzeria Mozza's pies have remained in a class of their own—and thanks to a supporting, ever-changing cast of bruschette, salads, unique pastas and desserts, it's still one of the best Italian restaurants in town. Doughy, chewy and lightly charred, Silverton's flatbreads feature cheffy, farmers' market toppings like squash blossoms and fennel sausage. Newer menu additions include a chicken parm made with caciocavallo cheese, pasta alla vodka and cheesy gnocchi."
    },
    {
      "source_id": "src_infatuation_best_pizza_2021",
      "publication": "The Infatuation",
      "title": "The 25 Best Pizza Places In LA - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-pizza-in-los-angeles",
      "published_at": "2021-07-09",
      "trust_level": "editorial",
      "content": "There's an argument to be made that Pizzeria Mozza kick-started LA's current pizza obsession, and we are making it. This spot on Highland and Melrose has been open since 2006, and has barely taken a breath since. Despite being full every night of the week, the pizzas here are as good as ever. That mostly comes down to the toppings, including the legendary goat cheese, leek, garlic, and bacon pizza. If you're anything like us, you head to Mozza fully intending to try something different, but end up ordering this anyway. If there was such a thing as LA-style pizza, this would probably be it."
    }
  ]
}