{
  "place_slug": "quarter-sheets-pizza",
  "sources": [
    {
      "source_id": "src_theinfatuation_2022",
      "publication": "The Infatuation",
      "title": "Pizza, cake, or beyond—there's no wrong order at Quarter Sheets",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/quarter-sheets-pizza",
      "published_at": "2022-10-19",
      "trust_level": "editorial",
      "content": "With each passing year, those cheesy Hallmark cards carry more and more weight. As it turns out, the simple things in life are what matter most: Sipping cocktails by a pool, getting too competitive at family game night, staying in bed a little longer on the weekends. Or maybe just eating some pizza and cake with friends. And if there's an ideal place to do that last one, it's Quarter Sheets.\n\nThe Echo Park pizza parlor really only does two things: pan-style pizza and dessert. And it executes both of them at an extremely high level in a warm, old-school space where you can hang out for hours.\n\nLike many of our favorite LA restaurants, Quarter Sheets began as a pandemic-era pop-up offering takeout through social media. These days, you can find them at a permanent brick-and-mortar just off Sunset. They still run a fierce takeout operation—as evidenced by the crowds waiting on the sidewalk who sell out pre-orders daily—but if you have the chance to dine in here, you should.\n\nFor customers who walk in to order, they also sell a Sicilian-style \"corner slice,\" which comes out slightly thinner and with a crust so crisp, one time we bit into it and the table next to us looked over and said, \"Wow, we heard that from here.\" These are hefty pizzas, but the crust is so light and airy that taking a full one down with two to three friends won't feel like a failed mission of testing your stomach capacity. And that's a good thing, because there's still dessert coming.\n\nHowever intense Quarter Sheets' pizza fans are, its dessert lovers are equally passionate. And it's not difficult to see why. While it's a fool's errand to chase specific desserts here—menu specials change weekly—you can feel comforted that whatever list of treats is stapled up on the wall that day is going to be incredible. It could be a spongy princess cake, peach-blackberry slab pie, or citrusy ricotta cheesecake. If, god forbid, Quarter Sheets decided to stop selling pizza one day, we'd still come here weekly just for dessert. Specials change all the time, so don't get too upset if your favorite cake suddenly isn't around anymore. In our experience, the best dessert at Quarter Sheets is the one that's on the menu that day (like this personal-sized citrus ricotta cheesecake on a graham cracker crust)."
    },
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "Quarter Sheets – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/quarter-sheets-pizza",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Aaron Lindell and Hannah Ziskin's Quarter Sheets Pizza has nailed that haute hipster vibe with its casual styling and vinyl and cassette collection. The word is out on this Echo Park spot, so expect a wait, but one bite of their inch-thick, pan-style pizzas makes it all worth your while. Baked to order, they're prepared with flavorful sauce and quality ingredients.\n\nPepperoni is a classic choice, or opt for the pimento grove, a vodka sauced pizza topped with olives, 'nduja and cheese. And, while you might not expect to get serious pastries at a pizza shop, don't leave without trying at least one of Hannah Ziskin's pastries. There are a few offerings that rotate often but the signature Princess cake is a staple that's worth every bite."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Quarter Sheets Pizza | Restaurants in Echo Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/quarter-sheets-pizza",
      "published_at": "2025-09-30",
      "trust_level": "editorial",
      "content": "How do we love thee, Quarter Sheets? Let us count the ways: This Echo Park shop serving Detroit-style–leaning pizza offers square slices with pillowy, flawless-hydration dough that practically springs back after every bite. The ratio of toppings to dough is always spot on, and so are the flavors—they range from the classics and expecteds (pepperoni with red sauce, basil and cheese) to weekly specials that always have us checking for entirely new creations, and some of our favorites, which we greet like an old friend whenever it's their turn in the rotation again.\n\nChef Aaron Lindell's wild creations include options like the pierogi-inspired Polish Yacht Club, which scatters potato, lemon cream, caramelized onion, green onions and bacon over the cheese-crusted dough. Not to be missed are desserts by Lindell's partner, Hannah Ziskin, whose spectacular cakes, pies and cookies are worth ordering all on their own."
    },
    {
      "source_id": "src_timeout_la_2024",
      "publication": "Time Out LA",
      "title": "Top L.A. pizzeria Quarter Sheets is finally taking reservations",
      "url": "https://www.timeout.com/los-angeles/news/one-of-l-a-s-best-pizzerias-is-finally-taking-reservations-041824",
      "published_at": "2024-04-19",
      "trust_level": "editorial",
      "content": "If the heavy weekend crowds have kept you from trying Hannah Ziskin's amazing desserts and Aaron Lindell's Detroit-inspired pizza squares at Quarter Sheets, you're in luck: The nationally recognized pizza joint in Echo Park will begin taking reservations at the end of this month. Per a social media post, Quarter Sheets will offer table times up to two weeks out, with the first batch of reservation dates—May 1 to May 14—becoming available on Resy on Monday, April 29. Parties of up to six guests will be able to book. All tables will be limited to an hour and a half of dining. In our experience, that's more than enough time to enjoy a couple of appetizers, a few pizza squares and dessert here.\n\nIn practice, national recognition, combined with plenty of local love, has led to notorious weekend crowds at the restaurant rivaling Courage Bagels in nearby Virgil Village. However, Quarter Sheets has, and will continue to offer, a smaller takeout menu that includes pizza by the slices, whole pies and dessert, including Ziskin's excellent princess cake. Most weekends, the entire crowd can get quite scene-y, complete with plenty of fitted beanies, Y2K sunnies and people smoking down the street from the restaurant. With any luck, Quarter Sheets' new reservation system will let dine-in guests skip the secondhand smoke and comically small sunglasses—though you're on your own once you get inside. It certainly won't let you skip the search for street parking, though: Like most restaurants in Echo Park, Quarter Sheets will still not offer valet, forcing you to circle the block over and over for a spot."
    },
    {
      "source_id": "src_timeout_la_2020",
      "publication": "Time Out LA",
      "title": "L.A.'s best new underground pizza pop-up also serves some of the best new desserts",
      "url": "https://www.timeout.com/los-angeles/news/l-a-s-best-new-underground-pizza-pop-up-also-serves-some-of-the-best-new-desserts-102220",
      "published_at": "2020-10-27",
      "trust_level": "editorial",
      "content": "Come for the Detroit-style square pies, stay for the Valrhona chocolate cream pies: Technically you'll be taking it all to-go, but the point remains that at Quarter Sheets, a new pop-up run by a seasoned culinary couple, you cannot skip dessert. Every Wednesday the orders go live over Instagram DM, and by Thursday afternoon the Saturday pickup slots are already filled—and when the weekend arrives, the boxes of fluffy-doughed, crunchy-edged square pies and decadent, artful desserts wait on a table outside a charming Spanish-style bungalow on a sleepy residential street in Glendale.\n\nWith more than a decade of professional pizza-making experience and a Michigan upbringing, Quarter Sheets founder Aaron Lindell walks that perfect balance of high-low with Detroit-inspired, nostalgic pizzas that are perfectly crusted by cheese around the edges but are baked using freshly milled flour and can come topped by more upscale and inspired ingredients. Now every Saturday, should you be quick enough to place your order before it all sells out, you can sink your teeth into stellar pizza and a stunning layer cake that's inspired by the pop-up's name and gets baked, naturally, in a quarter-sheet–size pan. The cakes rotate, but you'll almost always find Ziskin's remarkably chewy chocolate chip cookies and her crucial chocolate cream pie that's modeled after her childhood favorite, the chocolate pie at the Apple Pan. Ziskin fans can order her cakes and pies, as well as cookies and loaves, throughout the week online.\n\n\"It kind of vibes,\" Ziskin says. \"It's like fancy and casual in this way where the pizza is accessible and heartwarming and familiar, and because he's an incredible chef it becomes something else, and the cakes are the same way: a layer cake that has elevated ingredients [and] elevated flavors, and [with] the pies, I feel the same way.\" The recipe is adapting, as is the format: Currently Quarter Sheets can only offer 24 pizzas due to spacial, timing and equipment limitations, but Lindell is planning on opening up other days, most likely adding Friday nights to the schedule. It's all a balance and part of exploring new entrepreneurial territory, for both of them."
    }
  ]
}