{
  "place_slug": "republique",
  "sources": [
    {
      "source_id": "src_infatuation_2022",
      "publication": "The Infatuation",
      "title": "Republique - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/republique",
      "published_at": "2022-01-13",
      "trust_level": "editorial",
      "content": "Republique—how does one begin to describe its importance? The legendary French restaurant is a historical landmark at this point, firmly rooted in everything that makes this town great (show business, gorgeous architecture, food, etc.). Like a pop star who only goes by a single name, Republique needs no introduction: you'll find it on every \"Best of\" list in the city, a gathering place for fans of history, hungry tourists, and anyone who loves dessert.\n\nWhen standing in the dining room, a stunning two-story structure on La Brea in Mid City with arched ceilings and rustic wooden tables, the word \"breathtaking\" will likely come to mind. It's majestic, like a wild horse or looking straight into the sun. Combined with the propped open windows and provincial street lamps above, eating here feels like being dropped into a bustling French marketplace, located in a village with a charming but difficult to pronounce name.\n\nIn the past, Charlie Chaplin once called this building home, and quite some time after that, the dining room belonged to one of the city's landmark restaurants, Campanile (helmed by Nancy Silverton). There's a history that's steeped into the walls, a lore you feel whenever you eat here or bite into one of their buttery croissants.\n\nRepublique is open for brunch and dinner, although we much prefer brunch. You'll find silky shakshuka, kimchi fried rice, and omelets made with gruyere and finely chopped herbs, as well as a pastry case that makes us feel like a kid in a candy store. The glass case is filled to the brim with kouign amanns, chocolate bombolinis, cake donuts glossed in hot-pink icing, and ube coconut bundt cakes decorated in intricate purple flowers. If you have a hard time choosing, just stick to the mango and passionfruit cream pie, a glistening dessert we'll happily make our first meal of the day, any day.\n\nNights are a different story. Dinner at Republique was once a serious dining experience, but now, dinner can best be best described as \"fine.\" During our last few visits, the service was sluggish if not downright bad: dishes were dropped in the wrong order, some failed to show up at all. Everything tastes too salty; larger dishes like duck breast and short ribs were forgettable. We left with the sense that the focus had shifted to the owners' newest restaurant, Bicyclette in Beverlywood. Which is OK, probably. For now, Bicyclette doesn't do brunch and we're still awestruck whenever we walk into Republique's dining room, an actual architectural wonder. Although we're not as hot on their dinner situation as we used to be, we're still fans of everything Republique represents—an LA time capsule, a cathedral that worships French food. We just prefer it during the day.\n\nRating: 8.1"
    },
    {
      "source_id": "src_laist_2023",
      "publication": "LAist",
      "title": "République, The French Restaurant That Was Saved By Its Award-Winning Pastries",
      "url": "https://laist.com/news/food/republique-the-powerhouse-restaurant-that-almost-wasnt",
      "published_at": "2023-06-06",
      "trust_level": "editorial",
      "content": "In 2012, République was a gamble for chefs and restaurateurs Margarita and Walter Manzke, as the couple struggled to find the right spot for their restaurant. The building came with a sparkle of Old Hollywood history — Charlie Chaplin built it as an office space while developing his studio chops in the 1920s. It was used as rental offices in the 1940s, converted to retail space a decade later and hosted the beloved restaurant Campanile for 25 years.\n\n\"It really is a historic piece of Los Angeles. The building wasn't even for sale at the time but we inquired and made an offer. We had no hope of actually getting it. We are so very fortunate to have this and we think this space has had a big part of why we were successful,\" she says.\n\nThe Manzkes had big shoes to fill, trying to live up to the success of past chef-owners, Mark Peel and Nancy Silverton, who were the '90s \"it\" couple of new American cooking. During République's first few months, the Manzkes struggled to fill the dining room — and the customers were vocal in their discontent.\n\nAbout six months in, an eternity for a new restaurant, attitudes started to change. \"I think as time went by, they saw what we were doing and started to accept us. I think it just clicked. I think a couple of reviews came out at the time and they were very positive,\" she says.\n\nJonathan Gold praised the \"urban rustic\" desserts and Eater called it an \"all-day\" restaurant: \"Walter and Margarita Manzke have made République into one of the touchstones of modern, multipurpose dining in Los Angeles — the kind of place you can come for a celebratory dinner, meet colleagues for lunch, or swing by for coffee and (stunning) midday pastries while staring into your laptop.\"\n\nThat first wave of reviews highlighted Margarita Manzke as the force behind the restaurant's stellar pastry program. By word of mouth the focus of the restaurant became the delicious baked goods coming from Marge's case. She was the restaurant's secret weapon — and by 2016 she emerged as the key figure for République.\n\nWalking around Wilshire and La Brea, it's rare not to see a line stretching outside République. Inside the brick building with tall glass panes, you can't miss case after case of delicate baked goods. The savory mushroom tart piled high with peas, moist fruit danishes with fresh mango, ricotta toast topped with sweet blood oranges, tart jam, salted pistachios and the flakiest, butter-crammed croissants beckon Angelenos from across the city. Since opening in 2013, République has become such a staple it's hard to imagine the neighborhood without it.\n\n\"This place is home because we made it work,\" she told LAist. \"It was very hard, but I think we have found our place in Los Angeles.\"\n\nSince then, it's been an all uphill ascent for Manzke. In 2019, she was a finalist for Outstanding Pastry Chef at the James Beard Awards, pitting her pastries against some of the best in the country. Born and raised in the Philippines, Manzke has a gift for fusing flavors and artistry into her baking, which is featured in her newly released cookbook \"Baking at République.\" Margarita Manzke of République has won the 2023 James Beard award for Los Angeles for Outstanding Pastry Chef or Baker."
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "République – Hollywood - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/hollywood/restaurant/republique",
      "published_at": "",
      "trust_level": "editorial",
      "content": "In some ways, this all-day hit feels like a city of its own. With soaring ceilings, beautiful brickwork and sunny skylights, the cavernous space is a beehive of activity. In the morning, freshly baked pastries and breads draw long lines. Come evening, the open kitchen is in full swing, working quickly to serve wave after wave of diners.\n\nThe tightly curated menu explores the cuisine of Southern Europe through exceptional ingredients, many of them local. Trays loaded with warm potato and leek beignets or toast points stacked with eggs and uni land on almost every table. Baguettes with superb French butter inevitably follow. Dungeness crab risotto, braised wagyu beef cheek and duck with baby beets round out an experience that never fails to satisfy.\n\nFacilities & Services: Air conditioning, Brunch, Interesting wine list, Terrace, Valet parking, Wheelchair access, Credit cards accepted."
    }
  ]
}