{
  "place_slug": "rickys-fish-tacos",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Ricky's Fish Tacos - Review - Los Feliz - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/rickys-fish-tacos",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "One of the most celebrated fish tacos in the city and for good reason. Large, glorious chunks of fresh fish caked in that famous buttery batter. We're hard pressed to find anyone else who can do it better than Ricky.\n\nThere are plenty of places to eat a fish taco in this town, and the many people who sell them are often looking to find a way to stand out amongst an already extremely crowded scene. That usually means various aiolis, dressings, and other strange accessories end up on top of your taco. Not to say those can't be beneficial - we're always down to put some version of mayonnaise on pretty much everything we eat.\n\nBut at Ricky's Fish Tacos, you will find no such thing. To take a bite into a taco from Ricky's is to experience the \"baja style\" in its truest form. No add-ons, no cover-ups, no taco bling. Just a fresh tortilla and some spicy pico de gallo sitting atop a few fresh pieces of fish.\n\nNow, lets make one thing clear here - there might not be any sauce on top, but you also won't be earning any Weight Watchers points for eating at Ricky's. The fish here is deep fried, but done so by the hand of god - light and airy but still featuring tremendous fresh fish texture. And therein lies the Ricky's Fish Taco difference.\n\nRicky's caters to all of the Eastside's coolest people, including freshly audited Scientologists and a sizable lunch crowd. They recently moved to a spot on Riverside Drive, but it also seems like they're roaming around a little too, so pay attention and check Twitter to make sure they're open.\n\nBut once you roll up to this roadside taco truck, you'll understand what the hype is all about - fresh fish without help from anything else."
    },
    {
      "source_id": "src_lamag_2014",
      "publication": "Los Angeles Magazine",
      "title": "My News Year's Resolution? More Ricky's Fish Tacos",
      "url": "https://www.lamag.com/lafood/my-news-years-resolution-more-rickys-fish-tacos/",
      "published_at": "2014-07-17",
      "trust_level": "editorial",
      "content": "Ricky is back—and this time, it's for good.\n\nI don't always eat fish tacos, but when I do… It's true, I'm fortunate enough to find myself in Ensenada every couple of months, where I get to enjoy the best fish tacos on the planet from a handful of urban seafood shacks. But, when I get the urge for a fish taco in L.A., it can only be satisfied by a stop at Ricky's Fish Tacos.\n\nJust five days before Christmas I received my first present (no it wasn't five golden rings): a pair of fish tacos, and one shrimp taco from the newly christened Ricky's Fish Tacos—a shiny, hulking silver catering truck. This has been a long time coming for Ensenada native owner Ricky Piña, whose meticulous attention to the basic ingredients, and the preparation of his famous Baja-style fish tacos has earned him national recognition.\n\nDespite the accolades and huge following, Piña has had to move around a lot in order to operate—and at times, has had to shut down—since street vending in L.A.\n\nHold the Salsa, New York Times!\n\nNow that he has the truck, and has received his health permit, there's no stopping L.A.'s top fish taco specialist. Rain or shine, Ricky's Fish Tacos will be available at 1400 N. Virgil, from Thursday through Sunday. Soon, he will be setting up six days a week. The only competition Piña has is himself, and it's only in the sense that he needs to perfect his recipes on his new equipment.\n\nHe notes that \"the fish sticks to the bottom of the basket in the new deep fryers\"—he's had to make some adjustments, as the conventional fryers don't behave in the same way as the traditional aluminum discs that Piña was using at his stand. Most won't notice, but Piña himself won't rest until his tacos are perfect.\n\nI ordered a pair of fish tacos, and one full of plump, fried shrimp. I put my own cream and hot sauce on top, to add an extra sensation of being in Ensenada, where customers get to finish their tacos and choose their own condiments."
    }
  ]
}