{
  "place_slug": "rvr",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "At RVR, stellar izakaya dishes with a dose of Venice cool - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/rvr",
      "published_at": "2025-11-07",
      "trust_level": "editorial",
      "content": "RVR can seem a little mysterious. You might walk past its angular concrete facade on Abbot Kinney and wonder: Is this another luxury eyewear store? What do they have against vowels? And why is it always packed so late on school nights? All these burning questions will be answered once you book a table, though, because RVR's appeal isn't mysterious at all. It's a California-filtered izakaya with delicious food, great drinks, an energized crowd, and everything else you'd want from a night out in Venice (except for more elbow room, perhaps). A reboot of the dearly departed MTN, RVR is a comeback of sorts for the former Gjelina chef, a.k.a the person who changed our personal relationship with kale. As with Gjelina, assertively grilled, super-seasonal vegetables and gorgeously dressed salads are where this place shines brightest. Charred maitakes get brushed with salty miso butter, pickled burdock roots come wrapped in fragrant shisho leaves, and even a standard-seeming dish like little gem salad is revamped with smoked shoyu creme fraîche. Despite its hazy blend of cultures, RVR is 100% a Venice restaurant. Beanie-clad dads pull up to dinner on electric motorcycles, agency folks are on dates with graphic designers, and no one hears the lo-fi vinyl playlist over conversations about surf camp in Nicaragua. For now, this means that unless you're cool with eating after 9pm (or opting for a slower-paced brunch), you'll need to plan for a reservation, and even then, there's a chance you'll be seated along the narrow counter with zero back support. You can also request a table up on the semi-hidden rooftop, which offers more room, but also sacrifices some of the social buzz found in the main dining room. RVR isn't always the comfiest dining experience, and showing up at primetime often means navigating a specific brand of restaurant chaos, but it's clear why Abbot Kinney hasn't seen energy like this since the Birkenstock store's year-end sale. RVR's brunch service is a great hack if you don't want to wait for a seat during primetime dinner hours. The crowds are smaller, the pace is slower, and not only does the menu include almost everything from dinner, there are also excellent daytime-only specials, like warm mochi beignets dripping with orange-miso syrup. Truly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for. We're not sure if you can call yourself an izakaya without some fried pork on the menu, and in this case, RVR nails a classic. The thin crust on this sliced cutlet sticks to the marbled meat like Spandex, while being craggy enough to swipe up the sinus-clearing hot mustard on the side. Overall, RVR's handrolls are the most underwhelming part on its menu, with the exception of the one stuffed with cod tempura. This two-bite fish fry reminds us of our ideal fish and chips (minus the chips) with its light, puffy crust. Each bite is moist from the warm seasoned rice and tangy tartare sauce. If you like carby dishes with your alcohol, you can't go wrong with any of RVR's dumplings. The best ones, however, are the plump pork gyoza loaded with chives. Their chewy wrappers developed crunchy bottoms after a hot and fast pan-fry, and they come glued together with a thin skirt that's so satisfying to crack apart."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Three Los Angeles restaurants made it on this best restaurants in America list",
      "url": "https://www.timeout.com/los-angeles/news/three-los-angeles-restaurants-made-it-on-this-best-restaurants-in-america-list-091125",
      "published_at": "2025-09-12",
      "trust_level": "editorial",
      "content": "If Abbot Kinney feels like the stage for endless openings, RVR (pronounced 'river') is the rare spot with staying power. Chef Travis Lett (of Gjelina fame) teams up with Ian Robinson for a Japanese izakaya that's deeply L.A. in sensibility: vegetable-forward, seasonal, effortless. The kitchen is focused, technically precise, with dishes like sweet, briny clam ramen and grilled duck tsukune. But the surprise here is how thrilling the vegetables are—this section of the menu goes longer than some restaurants' entire menus. Baby Bistro, Mori Nozomi and RVR rank among the 50 best restaurants in the U.S. according to the New York Times. L.A.'s dining scene has never been short on ambition, but these three prove it still has the power to surprise—and to set the pace for the rest of the country."
    },
    {
      "source_id": "src_timeout_la_2025_review",
      "publication": "Time Out LA",
      "title": "Review: RVR in Venice isn't an izakaya at all—but at least the veggies are good",
      "url": "https://www.timeout.com/los-angeles/news/review-this-inconsistent-california-izakaya-in-venice-isnt-an-izakaya-at-allbut-at-least-the-veggies-are-good-101525",
      "published_at": "2025-10-15",
      "trust_level": "editorial",
      "content": "For better and for worse, Venice's RVR is essentially Gjelina 2.0 with a Japanese accent. I visited MTN once during its three-year run from 2017 to 2020, but I can't say I remember much about it. At this point, the experience is lost to memory, though a depressing, greasy bowl of Manila clam ramen—which the server claimed tasted like a brothy version of linguini al vongole—served as a rude awakening as to why I never returned to MTN. Though billed as a California izakaya, several of RVR's dishes that overlap with a conventional izakaya but are largely unremarkable or in need of significant improvement. At all costs, avoid the ramen section, where the watery vegetable miso will make you miss the far better vegetarian options at Tonchin, Jinya or even, dare I say it, Tatsu. I also like the vegetarian option at nearby Venice Ramen in Marina del Rey better. Compare this to a meal I enjoyed last summer at nearby Gjelina, which Lett officially left in 2020. (RVR is his first restaurant independent of Gjelina Group, which also runs nearby Gjusta and Gjusta Grocer as well as expansions in New York and Las Vegas.) Seventeen years in, the Abbot Kinney all-day staple hums along on autopilot, swapping in many of the same seasonal dishes that the founding chef introduced decades ago. The service is brisk, the pizza crust crisp, the ricotta pancakes as good as ever. It might not be the most interesting meal in Los Angeles anymore, but Gjelina first-timers and regulars alike don't necessarily care about novelty or ingenuity. They care about consistency. For the average, now fairly affluent Venice resident, a $16 wild caught fish handroll, a $16 plate of mediocre gyoza and a $15 Toki whiskey highball at the bar might be a fine-as-wine way to spend $60 after tax and tip. RVR earned three stars—good—from us."
    },
    {
      "source_id": "src_resy_2024",
      "publication": "Resy",
      "title": "Everything You Need To Know About RVR, Travis Lett's New Venice Izakaya",
      "url": "https://blog.resy.com/2024/11/rvr-travis-lett-venice-izakaya/",
      "published_at": "2024-11-21",
      "trust_level": "editorial",
      "content": "After almost half a decade away from Abbot Kinney, Lett has returned, and in a big way, with RVR (pronounced river). Since opening in October, it has become one of the hottest reservations in Los Angeles. RVR isn't Travis Lett's first izakaya on Abbot Kinney. In 2017, the chef, who first wowed Angelenos with Gjelina and Gjusta almost a decade prior, opened the Japanese-inspired MTN, that once inspired Johnathan Gold to ask, Is there a more Venice restaurant than MTN? In 2019, Lett sold his stake in the Gjelina group and in 2020, during the early months of the COVID-19 pandemic, MTN closed. Almost everything at RVR is presented as a small plate. Standouts include the pork rib gyoza, the crisp, juicy chicken thigh karaage with spicy honey, the duck meatball skewers with hot mustard, and the lightest, airiest tonkatsu (made of pork collar) you'll find. The ramen comes in medium or large — go big here, because the thin, delicate noodles (made in house) are perfectly springy, while the broth, topped with crispy pork belly chashu, has just the right level of salty richness without bowling you over. RVR has an accessible, easygoing feel. If you want a dining experience that's rooted in seasonality and a sense of place, you can get that here. If you want a quick bowl of noodles, you can get that, too. That's very much by design by Lett, whose love of Japanese cuisine dates back to his New Jersey childhood, when his parents shifted to a diet of macrobiotic Japanese food. To complement the food, Maggie Glasheen, former wine director at Anajak Thai, has drawn up a small list of a dozen wines, all available by the glass, dominated by French, with a few German and California offerings thrown in. There are six sakes, although one of them, Kamoizumi's Umeliciois, is actually an umeshu (plum wine). RVR is currently only open for dinner but plans to start serving lunch in the new year. It's a hot spot, but open seven days a week, with seatings as early as 5 p.m. all the way up to 11 p.m. (a rarity in this neighborhood), so come early or late and try your luck at the bar if that Notify doesn't come through."
    },
    {
      "source_id": "src_theweek_2025",
      "publication": "The Week",
      "title": "Critics' choice: Three chefs fulfilling their ambitions at Dogon, RVR and Minari",
      "url": "https://theweek.com/culture-life/food-drink/chefs-dogon-rvr-minari",
      "published_at": "2025-08-27",
      "trust_level": "editorial",
      "content": "Travis Lett's previous solo restaurant venture, MTN, was dripping in hipness, said Bill Addison in the Los Angeles Times. Though trend chasers loved the place, the experimental izakaya didn't survive the pandemic. But Lett, who'd previously redefined modern California cuisine at Gjelina, has retaken control of MTN's former space in Venice and transformed it into RVR, an equally hip but more assured incarnation that turns out to be shockingly good, thanks especially to the kitchen's brilliance with vegetables. During summer, apricots step in for cucumbers in a riff on a Japanese salad, and the flavor burst of ripe tomatoes is sharpened by sweet potato vinegar. Even midwinter, the kitchen plates such Technicolor wonders as a pinwheel of Fuyu persimmons under rounds of lilac-purple daikon. Beyond the vegetarian-friendly options, there's plenty more that entices, from duck meatball tsukune to smoky-sweet Monterey Bay squid."
    }
  ]
}