{
  "place_slug": "saffys",
  "sources": [
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Saffy's – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/saffy-s",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Crackling flames, heat radiating from the coals, the constant kneading and stretching of dough— the visceral nature of Ori Menashe and Genevieve Gergis's latest restaurant is impossible to ignore. Clearly, as snagging a reservation at this hot spot isn't an easy feat. Lamb and pork kebabs cooked on long metal skewers are the main event, but grilled lobster marinated in green harissa is a luxurious feast that would dazzle in fine dining temples. Turmeric mussels are a delight, as is the golden-brown falafel with creamy tahini. Bread is a constant source of pleasure, from the delicate challah to the soft laffa, but dessert is far from an afterthought. Avocado honey butter soft serve ice cream with a tableside pour of sherry is a real treat."
    },
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "At Saffy's, seriously good kebabs with a side of glamour - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/saffys",
      "published_at": "2025-10-20",
      "trust_level": "editorial",
      "content": "Saffy's, a glamorous kebab house in East Hollywood, is the latest restaurant from the Bestia and Bavel team. When you have restaurant siblings that are that popular, comparisons are inevitable—and in the case of Saffy's, there's a decent amount of shared DNA with Bavel. Much like its pita-pushing predecessor, Saffy's serves a menu of pumped-up Middle Eastern-leaning dishes (including some life-changing hummus) in a bright and airy space that you'll want to hang out in all night. But we're also not dealing with a carbon copy of Bavel transported across town. This Fountain Ave. restaurant is the younger, more carefree sibling who rebels against LA hot spot tropes: walk-ins are encouraged and accommodated (even if you have to wait for a bit), servers treat you like an old friend, and most dishes cost less than $25 yet still taste worthy of a special occasion. In short, you can think of Saffy's as the Solange to Bavel's Beyoncé—a bonafide star that has stepped out of her sibling's shadow with a fresh perspective. Located in an Art Deco corner building with street-facing windows, Saffy's intimate dining room and spacious sidewalk patio are usually packed. Arrive early in the evening and you might see an older couple sipping orange wine seated in a booth next to Addison Rae. Somehow the people-watching gets even better after 10pm, when men in double-breasted blazers bump elbows with a loud birthday crew on its third round of vesper martinis. The menu at Saffy's is pretty straightforward. There are sections broken down into small plates, meat skewers, and a couple of larger entrees. As charming as ordering a table-covering spread of dips and salads to start might be, try not to get bogged down in appetizers. The luxuriously creamy hummus ful and mussels in coconut-turmeric broth should not be missed, but otherwise save room for a few juicy, marinated kebabs. Cooked over a wood-fire grill that dominates one corner of the dining room, the kebabs arrive on intimidatingly pointy two-foot metal skewers. There are usually five different types or so available, including plump chunks of pork, bite-sized cubes of steak, and tender minced lamb mixed with pine nuts and parsley. Each one comes with a unique dip—like creamy mint yogurt, dill garlic aioli, or a smoky chile crisp—and a heap of housemade laffa. But what really hooks us is the balance of the seasonings. The sharp herbs harmonize with the juicy lamb and the nuts offer a bit of crunch. A squeeze of lemon, done just before that first bite, takes it all over the edge. The dessert menu at Saffy's isn't as intricate as the one at Bavel, but when you have excellent soft serve, you don't really need much else. The texture is smooth and silky and the rotating fruit-centric flavors change with the seasons—everything from the floral boysenberry to the tangy peach has left us in awe so far. Even if you're stuffed after dinner, you should always find room for a few spoonfuls of this creamy frozen treat. Saffy's takes the polished service and meticulously detailed food of Bavel and transforms it into a more accessible luxury, resulting in a place you might go to a couple of times a month instead of once or twice a year. The buzzy dining room is manageable for a group of friends to get into without waiting around for hours, but intimate enough for a date night at the bar. Come to Saffy's for masterfully conceptualized Middle Eastern food you can eat with your hands and a fun scene that makes a three-hour meal feel like it flew by in thirty minutes."
    },
    {
      "source_id": "src_timeout_2022",
      "publication": "Time Out LA",
      "title": "Review: Ultra-chic Saffy's is the kind of place we'd visit over and over",
      "url": "https://www.timeout.com/los-angeles/restaurants/saffys",
      "published_at": "2022-10-13",
      "trust_level": "editorial",
      "content": "No matter how or what you order, you won't be bored at Saffy's, the East Hollywood eatery run by Ori Menashe and Genevieve Gergis, the couple behind citywide favorites Bavel and Bestia. Ori Menashe's newest eatery covers similar territory as Bavel—but the Fountain Ave hot spot sits in a league of its own. Named after their daughter Saffron, the newest addition spurns the former's spendier large-format Middle Eastern-inspired dishes in favor of small plates and main courses best shared between two. Despite significant overlap—Menashe's creamy hummus tastes just as marvelous on Fountain Avenue as Mateo Street—the unique menu offerings, particularly the city's best sit-down kebabs, and the restaurant's more laidback ambience distinguish Saffy's from its pricier siblings in the Arts District. Each juicy kebab—two to an order—comes individually seasoned, including the grilled lobster skewer hidden among the appetizers. Topped with a squeeze of lime and serrano-tinged yogurt, the green harissa marinade cuts the meat's inherent richness and makes the splurge on seafood well worth the cost of entry. For a meal at, say, 6:30 or 8:15pm, you'll need to look 30 days out online—not exactly the makings of a relaxed get-together. Otherwise, most slots for a table run late, and the later dinner hour, as evidenced by the stylishly dressed crowd milling about well past 9pm, doesn't seem to bother the restaurant's generally fashionable, in-the-know clientele. A question in my mind still lingers: Should a meal at Saffy's take the place of a night out at Bavel? The answer depends on your budget and personal preference. A high-drama blockbuster dinner in the Arts District is quite unlike a stylish, low-key meal offered on Fountain Avenue (which the equally stylish, low-key Found Oyster also calls home). Booze notwithstanding, Saffy's will cost slightly less than Bavel, while delivering the same level of profound gustatory satisfaction Angelenos now expect from Menashe and Gergis."
    }
  ]
}