{
  "place_slug": "sapp-coffee-shop",
  "sources": [
    {
      "source_id": "src_infatuation_2022",
      "publication": "The Infatuation",
      "title": "Sapp Coffee Shop - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/sapp-coffee-shop",
      "published_at": "2022-01-14",
      "trust_level": "editorial",
      "content": "Thai Town's Sapp Coffee Shop is a coffee shop much in the same way that the supercomputer in your pocket is just a phone. Yes, Sapp has been serving coffee since the '80s, and yes, people drink it, but calling it a coffee shop is selling it short—because coffee is far from the number-one priority here. In fact, it's probably somewhere around the 93rd - behind the other 92 things on the massive, illustrated menu. We couldn't tell you exactly what the number-one priority is, but we can tell you what ours is: the boat noodle soup. This incredibly complex dish has a huge combination of flavors and textures. It's funky, spicy, sour, and sweet, with a cinnamon, galangal (a piney relative of ginger), and anise broth that envelops tender slices of beef filet and adds incredible depth of flavor. Ordering your bowl \"with beef and everything\"—which you should—makes those flavors even deeper, thanks to the addition of tripe, liver, and tendon to the mix.\n\nAll of it is served with zero frills, which is, frankly, refreshing. In an era where much of Thai Town is changing, Sapp is a constant. It's open until 7:45 nightly, is cash only, and doesn't serve beer or wine. And when even the best Thai spots in town have made the move towards sweeter pad thais - dishes that are less fishy than the versions found in Thailand - Sapp's haven't changed at all. Their noodles are pungent, sticky, and tart (we like them best, by the way, with fresh blue crab, on the menu as sen chan pad pu). That Sapp remains the same is a good thing - because despite constant mentions by other food writers and an appearance on No Reservations, the reason you (and likely everyone else at the other nine tables) are there hasn't changed, either. You can walk in at any time, be seated immediately, and have a quick, cheap, incredible meal.\n\nThere are a lot of great salads involving different kinds of meat at Sapp. The one we usually go for, though, is this grilled shrimp one. It's spicy, minty, and tastes like a plate full of springtime. Sapp's pad thai is more tamarind-y, fishy, and pungent than most others in Thai Town. It's excellent, and made even better in this version, which has blue crab stir fried with the egg. This crab fried rice is a bomb of salt and curry spice, balanced out by the meaty crab. Order it. This big, flavorful bowl of boat noodle soup is a Los Angeles icon on par with the Griffith Observatory (which you can see from the corner outside Sapp, by the way). We love these jade noodles because, even though they're loaded with peanuts, cilantro, duck, pork, and dried crab, they remain impeccably balanced. The flavors meld together to create a sum greater than its parts, like Thanos's Infinity Gauntlet."
    },
    {
      "source_id": "src_infatuation_2020",
      "publication": "The Infatuation",
      "title": "LA's best takeout: Sapp Coffee Shop, a Thai Town classic",
      "url": "https://www.theinfatuation.com/los-angeles/features/sapp-coffee-shop-to-go-takeout-los-angeles",
      "published_at": "2020-07-31",
      "trust_level": "editorial",
      "content": "Why you should order takeout from Sapp Coffee Shop tonight, and what you should get at this classic Thai Town spot. Many LA restaurants have streamlined their pick-up process during COVID - even well-established, set-in-their-ways spots like Sapp Coffee Shop. Before the shutdown, this Thai Town classic only accepted cash, didn't offer delivery, and required that you show up in-person to order takeout. Now, not only can you pay with a credit card, you can order online. Which you should. Preferably, as soon as you finish reading this. The thing is, Sapp was well worth all those extra steps before the pandemic. Now, there's no reason it shouldn't be a regular part of your weekly delivery rotation. There are 92 items on the menu (it's easy to count - they're numbered), and we're not exaggerating when we say you could order with a random number generator and still be happy.\n\nPapaya Salad - The papaya salad is an ideal takeout dish at Sapp - you don't have to worry about it getting cold, and though it's tremendously spicy, it's balanced out by the crunchy raw papaya and intensely salty dried baby shrimp."
    }
  ]
}