{
  "place_slug": "secret-pizza",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Secret Pizza - Review - Montecito Heights - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/secret-pizza-la",
      "published_at": "2024-03-06",
      "trust_level": "editorial",
      "content": "But Secret Pizza is the only LA spot on par with East Coast slice joints. This pick-up-only operation in Montecito Heights—run by a New Jersey transplant—makes us want to call Infatuation NYC to brag. At this point, riffing on New York-style pie is about as common as exhaling carbon dioxide. But Secret Pizza is the only LA spot on par with East Coast slice joints. This pick-up-only operation in Montecito Heights—run by a New Jersey transplant—makes us want to call Infatuation NYC to brag. Each slice folds with a distinct crunch. Soft, springy edges won't cut the roof of your mouth. The pies at this one-man show have nothing to hide. Aside from the occasional pepperoni, we don't even like to add toppings—just sweet, slightly acidic tomato sauce and fresh mozz. (What else do you need?) There's a link in their Instagram bio for easy pre-ordering and a patio in front of the shop where you can dive into your pizza right away."
    },
    {
      "source_id": "src_laist_2024",
      "publication": "LAist",
      "title": "NY vs LA pizza: which coast is best?",
      "url": "https://laist.com/news/food/off-field-rivalry-ny-vs-la-pizza",
      "published_at": "2024-10-25",
      "trust_level": "editorial",
      "content": "Secret Pizza was started by Sean Lango, who began cooking pizza out of his Hollywood apartment before graduating to his pizzeria in the foothills of Montecito Heights. He calls his pizza New Jersey-style because he's from there, and wanted to protect himself from the wrath of purist New Yorkers not happy with outsiders laying claim to their turf. It's very similar to a classic NY pie; he sees it as an opportunity to highlight his home state and his love for it. What makes his pizza so memorable? Its simplicity. The thin crust gives way to a stellar crispy underside, providing an excellent texture, topped off by a tangy sauce. Sure, you could add different toppings, but Lango's pie, with crushed tomatoes, a small amount of mozzarella cheese, and topped with aged pecorino is perfect as it is. Sometimes, when you rely on a good, uncomplicated formula, good things happen."
    },
    {
      "source_id": "src_laist_2025",
      "publication": "LAist",
      "title": "The LAist NELA pizza slice tour",
      "url": "https://laist.com/news/food/the-laist-nela-pizza-slice-tour",
      "published_at": "2025-10-02",
      "trust_level": "editorial",
      "content": "Secret Pizza specializes in a distinct sub-category of East Coast pizza: New Jersey-style pizza. Founded by Sean Lango, who began cooking pizza out of his Hollywood apartment in 2020 and subsequently launched his own brick-and-mortar shop in 2022. Lango calls his pizza New Jersey-style because he's from there and wanted to defend himself from the wrath of purist New Yorkers, who aren't happy with outsiders claiming their turf. However, in appearance, Lango's pizza is similar to NYC-style, with its thin, hand-tossed crust that's foldable when eaten and simple topping selections. With four slice options available at any given time, ranging from $3.50 to $5.75, the beauty of Lango's pizza is its simplicity. The thin crust creates a perfectly crispy bottom, providing a great texture, topped with a tangy sauce that consistently enhances the flavor. Secret Pizza, meanwhile, nails the crisp, foldable Jersey slice with dough that only gets better with every visit."
    }
  ]
}