{
  "place_slug": "seline",
  "sources": [
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "Seline – Santa Monica - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/santa-monica/restaurant/seline",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "You might not expect to be served ice cream in the middle of savory courses, but at Chef Dave Beran's Seline, surprises are par for the course. This ambitious tasting menu dances between sweet and savory, and delivers on drama. Begin with a cup of mushroom tea before enjoying the likes of roasted leeks with foamy eucalyptus sauce and a banana leaf puree, or dry-aged beef tartare with celery root and a savory granola. The hot mushroom salad steamed in a squash is plated tableside for a bit of drama. Squab served in two parts plates roasted breast with a fennel sausage-stuffed leg for the opener, followed by smoked chocolate and squab liver truffle with strawberry sauce. The chef's signature golden osetra caviar served atop hazelnuts and a coffee anglaise is the ultimate ending."
    },
    {
      "source_id": "src_michelin_guide_2025_new_additions",
      "publication": "Michelin Guide",
      "title": "March 2025: New Additions to The MICHELIN Guide California",
      "url": "https://guide.michelin.com/us/en/article/dining-out/michelin-guide-california-new-additions-restaurants",
      "published_at": "2025-03-19",
      "trust_level": "editorial",
      "content": "You might not expect to be served ice cream in the middle of savory courses, but at Chef Dave Beran's Seline, surprises are par for the course. This ambitious tasting menu dances between sweet and savory, and delivers on drama. Begin with a cup of mushroom tea before enjoying the likes of roasted leeks with foamy eucalyptus sauce and a banana leaf puree, or dry-aged beef tartare with celery root and a savory granola. The hot mushroom salad steamed in a squash is plated tableside for a bit of drama. Squab served in two parts plates roasted breast with a fennel sausage-stuffed leg for the opener, followed by smoked chocolate and squab liver truffle with strawberry sauce. The chef's signature golden osetra caviar served atop hazelnuts and a coffee anglaise is the ultimate ending. From the French-focused wine list and streamlined menu at Bar Etoile to edomae-style sushi at Mori Nozomi, those in Los Angeles are in for a delicious treat with seven new additions."
    },
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Seline blends bold, creative fine dining with familiar comforts - Review - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/seline",
      "published_at": "2025-11-10",
      "trust_level": "editorial",
      "content": "While it's true that this fine dining spot in Santa Monica charges a clear fine dining price—dinner is $295 per person before wine, tax, and tip—and serves stunning high-brow spectacles like celery root ice cream with miso fudge, it's foremost a charming place to eat dinner. The service is warm, the dining room is comfortable, and each dish is paired with an engaging bit of storytelling, so that even being invited into the kitchen to pop a mustard leaf dipped in passion fruit pulp that's flash-frozen before your eyes feels like a perfectly natural part of the meal. At first, though, Seline might psyche you out a little. The restaurant is tucked within a brick mixed-use complex, accessible behind a heavy iron gate. Once you peel it open, you'll walk into an ominously empty courtyard flooded with synthy ambient music and medieval-looking candles. Watch enough Ari Aster films and you might expect to be sacrificed to a pagan deity or worse. Oh, God. This restaurant takes itself so seriously. And in some way, Seline does—it just happens to focus its seriousness in the right places. The midnight-black decor is stylish, but it's not the focus of the room. It's the 18 or so intricately designed courses, which start arriving the moment you sit down, that dominate the conversation. The chef, who also runs nearby Pasjoli, combines a seasonal, we-just-picked-this-from-the-backyard approach with the sort of sensory nostalgia you might find at places like Alinea in Chicago (where the chef worked previously). Sometimes the backstories that accompany each dish are subtle, while others are pretty on the nose. During the autumn tasting menu, there was a small dish of roasted squash with chestnuts and truffles that tastes like the greatest holiday casserole ever created. Seline puts a lot of effort into transporting you to a specific time of the year, and depending on how much you enjoy the seasonal section at Target, that alone can make a meal here memorable. Beyond all the anecdotes of crunchy fall leaves or smoldering cinnamon sticks, however, you'll eat dishes that are simply delicious. Not every tasting menu—even the expensive ones—needs to push boundaries, but if there's a place to discover that roasted leek and banana actually taste incredible together, without feeling like you're stuck in a piece of experimental performance art, it's Seline. The food here is unforgettable, but the restaurant doesn't forget about the rest of what makes dining out feel special, either. Seline serves a seasonal tasting menu that changes often. Here are some dishes from our past visits. We've described many foods (maybe too many) as tasting \"like butter\" but we really mean it with this poached fish. Contrary to what some people think, caviar does not belong on everything. Coffee and hazelnut cream, though? Seline has converted us. If you're into sea salt on chocolate, this will blow you away. If you're looking to add a beverage pairing, get the $145 non-alcoholic option. The bespoke drinks are as creative as the food, and span a rainbow of flavors and textures that pair smartly with what you're eating. Highlights include things like a tomato and cumin seed soda, or a silky banana-laced latte that arrives with dessert."
    }
  ]
}