{
  "place_slug": "short-stories-hotel",
  "sources": [
    {
      "source_id": "src_hollywood_reporter_2022",
      "publication": "The Hollywood Reporter",
      "title": "Inside Los Angeles' New Short Stories Hotel, Across From The Grove",
      "url": "https://www.hollywoodreporter.com/lifestyle/style/los-angeles-short-stories-hotel-1235102255/",
      "published_at": "2022-03-05",
      "trust_level": "editorial",
      "content": "A new chapter has been written for L.A.'s shuttered Farmer's Daughter Hotel, where Julianne Moore stayed while reading the Boogie Nights script. The 1962 property, on three-quarters of an acre across from The Original Farmers Market and The Grove, is now the casual chic 66-room Short Stories Hotel (from $300 a night; shortstorieshotel.com).\n\nHotelier Leo Grifka of Grifka Group saw great potential — especially in the sun-drenched courtyard. \"It was a concrete jungle, and by bringing in natural stone and woods, we were able to soften it,\" says Grifka, owner of the Palihotel Culver City hotel and Simonette restaurant, who collaborated with Kevin Klein Design to bring his vision to life of a walkable neighborhood staple.\n\nThe pair conceived key furniture pieces — such as a rounded sofa emblazoned with velvety leopards for the larger suites and clever closets — plus curated enviable collections of Taschen and Phaidon books for each room alongside a Kenton Nelson artwork above every bed, not to mention generous craft-spirit minibar. Terrazzo-clad bathrooms nod to Hollywood history with framed matchbooks from institutions including Dan Tana's, Canter's Deli and Craig's.\n\nGrifka aims for the property to be known for its attentive, personalized service. \"Especially in a post-COVID world, people are yearning for human interaction, and most hotels are going away from it with mobile check-in and automation,\" says Grifka. At Short Stories, staff greet guests by name, walk them to their room and call an hour later to ensure it's all to their liking. There's also turndown service, complete with a classic Andes chocolate mint in a custom gold Short Stories wrapper.\n\n\"I want a paper menu and to be served a drink by the pool, not order it on an app,\" adds Grifka. That's on offer throughout the property, including at the Short Stories Restaurant, where a small menu of simple, flavorful dishes involve ingredients sourced from across the street.\n\n\"I think the boutique stay has been standardized,\" says Grifka, \"but I want to bring old-school hospitality back.\"\n\nA $250 monthly membership option is available for locals seeking pool access, concierge services, and work and conference space."
    },
    {
      "source_id": "src_timeout_la_2022",
      "publication": "Time Out Los Angeles",
      "title": "Fairfax's newly open Short Stories just debuted brunch in the old Tart space",
      "url": "https://www.timeout.com/los-angeles/news/fairfaxs-newest-breezy-patio-eatery-just-debuted-brunch-in-the-old-tart-restaurant-space-041322",
      "published_at": "2022-04-14",
      "trust_level": "editorial",
      "content": "Bottomless mimosas on Fairfax are back, courtesy of Short Stories Restaurant, a brand-new brunch spot occupying what was once Tart Restaurant inside the old Farmer's Daughter hotel. Located inside the also-new hotel by the same name, the beautifully redesigned eatery first opened for dinner service in early March with a menu of flavorful, market-driven cuisine by Ricardo Zarate. Now, as of April 10, Short Stories has launched the Rosaliné chef's similarly Peruvian-inspired Sunday brunch, available from 10am to 4pm.\n\nIn true Sunday Funday fashion, the menu includes $30 bottomless mimosas with your choice of fruit purée and a brief but satisfying selection of all-day staples perfect for enjoying en plein air on the restaurant's dreamy, plant-filled patio.\n\nLongtime patrons of Tart will hardly recognize the same indoor-outdoor courtyard, which now features marble chess board flooring, evergreen trees strung with lanterns and plenty of bright white accents. A stone fountain by the restaurant entrance and plenty of foliage at Short Stories add to the secret garden-like feel worlds away from the roar of L.A. traffic just outside its walls.\n\nIn terms of brunch fare, Short Stories offers 10 familiar items with a few Peruvian twists, including a kale caesar salad made with huacatay, or black mint; steak and eggs with a Peruvian soy glaze; and the Nikkei Cobb salad, which winks at Zarate's soon-to-open Peruvian-Japanese spot Causita with a sesame yuzu dressing and dense, oversized kernels of Peruvian corn. Six new daytime cocktails are also available; among them is the Farmer's Father, a tequila-based tropical homage to Short Stories' most recent predecessor.\n\nNamed for the literary history of the surrounding Fairfax District, Short Stories Restaurant has already begun to draw a dressed up evening crowd, so expect a similarly chic, somewhat upscale atmosphere at Sunday brunch. It's not the first time the space has served as a seen-and-be-seen hotspot: Back in the '90s, the same venue existed as the Olive Club, one of L.A.'s first nightlife-oriented restaurants in the style of the Nice Guy, Delilah and Catch L.A."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Short Stories - Review - Fairfax - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/short-stories-los-angeles",
      "published_at": "2025-02-20",
      "trust_level": "editorial",
      "content": "Located at the bottom of the Fairfax hotel, Short Stories serves Latin-American food. There's no shortage of hotel restaurants in LA, and one of the latest is Short Stories, a new Latin American spot located in a Fairfax boutique hotel of the same name. Run by the chef behind Picca and Rosaline, Short Stories serves dishes like Peruvian market potatoes covered in Huancaina cheese sauce, and media luna tacos on freshly made blue corn tortillas. There's of course a gorgeous courtyard patio, filled with fluffy white couches, bubbling fountains, and bushes of blooming flowers—wear a whimsical dress and the smallest sunglasses you can find."
    }
  ]
}