{
  "place_slug": "spina",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Spina - Review - Atwater Village - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/spina",
      "published_at": "2024-01-12",
      "trust_level": "editorial",
      "content": "Spina is an Italian restaurant in Atwater Village that is, in many ways, the ideal place to flirt with someone. It's walk-in only, so chances are high you'll have 20-ish minutes to break the ice before a seat opens up. The dining room is small but warm and chatty, like the entire neighborhood popped in for a meal and doesn't want to leave. We also like that the pasta-focused menu is short (great for an indecisive date), but there's a list of rotating specials to keep things interesting. Nothing at Spina is so delicious it'll set off a metaphorical firecracker in your brain. Instead, everything is just pretty good across the board. Ricotta-stuffed ravioli is served in a toasty, sweet brown butter sauce that's tasty, if a tad simple. We also appreciate the pops of flavor in the spaghetti puttanesca special, courtesy of brined olives, tinned tuna, and an onslaught of garlic."
    },
    {
      "source_id": "src_theinfatuation_2024b",
      "publication": "The Infatuation",
      "title": "The 17 Best Restaurants In Atwater Village - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/where-to-eat-drink-in-atwater-village",
      "published_at": "2024-08-26",
      "trust_level": "editorial",
      "content": "Whether it's dinner with a friend or a hot stranger you met on the Internet, Spina is a great option that doesn't require much pre-planning. (It's walk-in only). This small Italian restaurant serves the best pasta in the neighborhood, including ricotta-stuffed ravioli in a brown butter sauce and a deliciously potent spaghetti puttanesca special. The casualness of the room, the garlicky pasta, and the wine list make Spina the spot that every local wants to be a regular at (even if the non-pasta parts of the menu are fine at best). A night at the bar, splitting a bottle of nebbiolo and watching the kitchen toss pasta in the air, is the most romantic date spot in this part of town."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Spina | Restaurants in Atwater Village, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/spina",
      "published_at": "2025-09-26",
      "trust_level": "editorial",
      "content": "This popular no-reservation pasta bar in Atwater Village comes from Pablo Cruz, an alum of Terra/Eataly, L'Antica da Michele and Terroni. From an open kitchen seemingly the size of a postage stamp, Cruz pulls off an ambitious, slightly inconsistent menu of appetizers, housemade pastas, grilled mains and desserts that beats out most of L.A.'s more established mid-tier Italian options. Wine lovers will appreciate the unique bottle list and handful of by-the-glass selections; for everyone else, there are $12 Aperol spritzes and a compelling booze-free house spicy lemonade. The pasta-focused menu includes a standout squid ink linguine, prepared multiple ways (seabass is the regular, but you might find lobster and crab on the specials menu), an umami-forward cacio e pepe and dutiful renditions of lamb ragú and pasta al scarpariello, a cheese-forward version of pomodoro. The night I visited, I enjoyed the Delmonico alla griglia, perfectly seared to medium-rare, but the oversalted rapini on the side killed my appetite. My squid ink linguine was also accompanied by overcooked lobster. What revived my tastebuds by night's end, however, was Spina's creamy yet delicate tiramisu—a truly standout version of the ubiquitous espresso-laced dessert."
    }
  ]
}