{
  "place_slug": "stir-crazy",
  "sources": [
    {
      "source_id": "src_the_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Stir Crazy - Review - Hollywood - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/stir-crazy",
      "published_at": "2024-03-14",
      "trust_level": "editorial",
      "content": "Funky natural wine, snacky finger food, and a crowd of assistant art directors who just got back from their first Frieze exhibit. Any guesses as to what we're describing? No, it's not the latest Echo Park bistro or a recent community event at an Elysian Valley co-op. We're talking about Stir Crazy, a chilled-out, excellent wine bar in a part of town with very few of them—Hollywood. Stir Crazy's tiny Melrose space only has ten or so tables inside, so by 7pm every night, the crowd spills out onto the sidewalk like it's a courtyard afterparty at The Largo. Friends sit on wooden blocks and pass bottles of chilled cab franc. Dates squish inside the small, wood-paneled dining room splitting small plates like cow's milk cheese with honeycomb, rockfish carpaccio, and a particularly excellent plate of anchovies. You'll almost certainly see somebody with a Netflix comedy special. Most people at Stir Crazy are there to graze and sip wine for an hour, but if you've come for a full dinner, you won't feel out of place. The constantly shifting menu has expanded since opening and now includes a few larger plates, like grilled oyster mushrooms marinated in red wine, a giant juicy German sausage with potato salad, and silky black cod poached in a butter broth. And there's an icy dessert that tastes just like a creamsicle. The food is universally good, often great, but in general, Stir Crazy is best suited for an impromptu weeknight drop-in rather than a destination to plan your night around (the place isn't even open on Saturdays and Sundays, keeping the crosstown weekend warriors at bay). Maybe you'll get a pinot grigio buzz and decide to head off to a movie, maybe you'll stay for three hours because you keep ordering plates of cured ham and talking to the guy who location-scouted one of the Marvel movies. If you're at Stir Crazy for wine and a little snack, make sure this is the snack. A plate of five long anchovies is draped over a pungent, dark green herb sauce that mellows the saltiness of the fish, then gets sprinkled with roasted hazelnuts. It's a dish that, without fail, will convert someone at your table who a few minutes ago said they don't eat anchovies. Some bites of this carpaccio are a little too lemony, but when you get a slice of raw fish with the right balance of brown butter, citrus, and crushed pistachios, it's a home run. This Fyre Fest-coded plate of sausage and potato salad has been on the menu since day one, and we pray it never goes away. The sausage is sweet, salty, and so plump that a six-inch splash zone warning should be issued before the first bite. The chunky potato salad is equal parts buttery and mustard-y. The most entree-y entree at Stir Crazy's menu is also the best thing on the menu. Bathed in a decadent butter broth, the flaky white fish is so tender and silky, it might not even register that you're chewing it. This is a creamsicle in a glass, and if those words don't make you immediately order it, then we had different ice cream truck priorities growing up."
    },
    {
      "source_id": "src_resy_2023",
      "publication": "Resy",
      "title": "Stir Crazy Is the New Idyll of a Los Angeles Neighborhood Haunt",
      "url": "https://blog.resy.com/2023/12/stir-crazy-los-angeles/",
      "published_at": "2023-12-01",
      "trust_level": "editorial",
      "content": "Soon after Stir Crazy opened on Melrose Avenue, it quickly became the place I didn't know I needed. Well, technically, Stir Crazy reopened, or maybe it's more accurate to say it was revamped. Previously home to a second-wave coffee shop of the same name, it was taken over by new owners Mackenzie Hoffman, Harley Wertheimer, and Macklin Casnoff last spring. They kept the name, but beautified the interior with a simple maroon banquette, wood-lined walls, and framed art; spiffed up the kitchen; and revived the space as a nighttime cafe. Or something like that. A lot of people use the ubiquitous 'wine bar' to describe us, Hoffman says. We are definitely the first word, but I don't consider us the second. There are no stools. You can't belly up. You can use us as a bar, but we're truly a cafe. This is what I love about Stir Crazy: unlike the typical bar where you'd meet a friend for a drink, Stir Crazy is a sit-down experience turning out sophisticated food, in charmingly casual environments. The way I see it, Stir Crazy is the chicest snack bar in L.A. The space itself is modestly handsome, with classy details like a stainless steel ham slicer that sits on the counter of the open kitchen and a collection of old exhibition posters in the bathroom. And the snacks are far more interesting (not to mention delicious) than what you'd find at your average bar or cafe. Casnoff oversees the kitchen, which dishes a compact, market-driven menu that changes almost daily. There are crumbles of parmesan and two types of cured ham, a handful of seasonal plates—think celery salad with walnuts and goat cheese and pole beans with chicories and bigeye tuna confit—and a couple of straightforward desserts. The beauty of Stir Crazy is that you can use it any way you like. You could come as early as 4 p.m. for a late afternoon glass of wine, some marinated anchovies with bread, and a brown butter-laced crudo. Or, you could come after dinner, order a bottle, and nibble on grapes with gouda. Regulars have been known to spend entire nights here, linking up with various friends, asking for refills, and satiating themselves with the menu's heartier items, like the sausage with Weiser potato salad. Best of all, when you're seated at a table, there's no pressure for your entire party to conform to the same path. You could have a full meal, and I could just have a glass of wine, and that's not at all weird. Wertheimer says. It's choose your own adventure, even at a table of five. Furthermore, there's plenty to drink—Hoffman has about 300 wine bottles on her list, which spans a dozen countries and over 60 grape varietals. Accordingly, the trio approached the revamp with an intentional yet flexible mindset. From the get-go, they expected to evolve based on guest feedback. However, they did make one very deliberate and somewhat unusual decision: Stir Crazy is only open on weekdays, Monday through Friday, from 4 p.m. to 11 p.m. Why? For one, it allows them to cater to the neighborhood, as opposed to the weekend tourists that descend on Melrose. Secondly, it enables their staff to recuperate appropriately and return to work on Monday feeling refreshed. And finally, the somewhat limited hours imbue visitors to Stir Crazy with the feeling of stumbling into something special. There's this sense that the guest has chosen to be with us on a weekday, so let's show them a magical ride, Hoffman says. To experience Stir Crazy to its fullest, you must factor in both the energy of the room and your own desires. In that way, it's not so different from going to the beach. You arrive, then consider the environment—How strong is the tide? How high is the wind?—to determine how to approach your time. Then you settle in, unwind, and let the day take you wherever it goes. And when you get hungry, the snack bar is there, waiting like a beacon, to welcome you back ashore."
    },
    {
      "source_id": "src_latimes_2024",
      "publication": "LA Times",
      "title": "Stir Crazy Restaurant Review",
      "url": "https://www.latimes.com/food/story/2024-09-19/stir-crazy-melrose-restuarant-wine-review-addison",
      "published_at": "2024-09-19",
      "trust_level": "editorial",
      "content": "[PAYWALLED]"
    }
  ]
}