{
  "place_slug": "sunset-tower-hotel",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Tower Bar is ridiculous. That's entirely the point",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/tower-bar",
      "published_at": "2025-03-07",
      "trust_level": "editorial",
      "content": "If anyone tells you they go to Tower Bar \"for the food,\" they're lying. Everyone at this industry hangout inside the Sunset Tower Hotel is here to see and be seen (or, as a friend taught us to call it over cocktails here one night, SABS). Oscar winners float through the dim-edging-on-dark dining room, on their way to their usual table for a pre-awards-night burger. Studio bigwigs hold court at very visible booths, strategically greeting (or ignoring) almost everyone who walks in. Well-behaved children in polo shirts quietly pick at their fries before falling asleep in their parent's lap. Not to mention the low-level agents, aspiring actors, and tourists attempting casual nonchalance, all only half making conversation while on the lookout for someone, anyone, famous.\n\nPerhaps, to you, that sounds horrible. To which we say, lighten up. You will not have a memorable meal at Tower Bar, but you will have a memorable Hollywood night.\n\nThere are a few ingredients to keep in mind, though. Martinis are near mandatory, expertly made, and go very well with a plate of pigs in a blanket in the bar area. If it's daytime, sit in the terrace room, as close to the pool as possible. If it's evening, deny any attempt by the maître d' to seat you in that same terrace room and insist on a table in the clubby, dark main dining room. Come with someone who's ready to gossip and embrace the fun, and who won't be mad when you suggest ordering a $45 burger.\n\nTower Bar is ridiculous. And that's entirely the point.\n\nAt this point, ordering a martini in a place like Tower Bar is a cliché. Who cares? They taste good, make you feel fancy, and the ones at Tower Bar are excellent. On the other hand, pigs in a blanket are entirely unsophisticated and yet, still, a Tower Bar classic. These are fine, although they do sometimes come out kind of burnt."
    },
    {
      "source_id": "src_theinfatuation_2025_hotel_bars",
      "publication": "The Infatuation",
      "title": "The 14 Best Hotel Bars In LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-hotel-bars-in-la",
      "published_at": "2025-11-12",
      "trust_level": "editorial",
      "content": "Located on the ground floor of Sunset Tower Hotel (which dates back to the 1920s when people like Howard Hughes and Elizabeth Taylor lived there), this Art Deco pool bar is the stuff of Hollywood legend."
    },
    {
      "source_id": "src_theinfatuation_2025_weho_scene",
      "publication": "The Infatuation",
      "title": "The Sceniest Restaurants In West Hollywood, Ranked",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-sceniest-restaurants-in-west-hollywood-ranked",
      "published_at": "2025-05-05",
      "trust_level": "editorial",
      "content": "Behold, the greatest scene of all the West Hollywood scenes. At this iconic hotel restaurant, movie deals get signed over chopped salads and executives get canned while swallowing a mouthful of zucchini chips. We once watched Dianna Agron cry for five minutes without wiping a single tear away. You'll eat a nice steak and build an ice cream sundae worth gloating about on your deathbed, but the food is beside the point. A meal at Tower Bar is about drinking martinis poolside at what feels like the center of the universe, at least for two hours."
    },
    {
      "source_id": "src_timeout_2017",
      "publication": "Time Out LA",
      "title": "Sunset Tower",
      "url": "https://www.timeout.com/los-angeles/hotels/sunset-tower",
      "published_at": "2017-11-08",
      "trust_level": "editorial",
      "content": "A Hollywood landmark since 1929, the Sunset Tower Hotel is a design aficionado's dream. Sporting Art Deco architecture that landed the building an appearance in a Raymond Chandler novel and retro details like pinstriped furniture, deep soak tubs and powder rooms, the hotel is a throwback escape high above the hustle of the surrounding Sunset Strip. Of course, the hotel has been updated with a few thoroughly modern amenities: you'll find Kiehl's products in every shower, for instance, and personal flat-screen TVs throughout the 24-hour fitness center. While business travelers can certainly take advantage of the complimentary wifi, Sunset Tower is particularly well suited to those looking for a glamorous sojourn. During your stay, you're invited to indulge in lobster tacos while you lounge poolside, up your wellness routine with a soak in the onsite salon's Turkish hammam, and sip classic cocktails in the walnut-paneled Tower Bar.\n\nLocation: Located smack in the center of the Sunset Strip, the Sunset Tower Hotel is within stumbling distance of all West Hollywood's cheeky-seedy charm—from velvet-roped nightclubs and celebrity-owned restaurants to tattoo parlors and the Hustler Store.\n\nTime Out tip: Rose gold lighting and intimate nooks make the Tower Bar an ideal date spot, but locals know that the real meal to enjoy here is breakfast. Nibble on mimosas and breakfast tacos by the pool, accompanied by plenty of celebrity sightings. The industry is practically built from breakfast meetings, after all."
    },
    {
      "source_id": "src_timeout_2016_spa",
      "publication": "Time Out LA",
      "title": "CURE West Hollywood",
      "url": "https://www.timeout.com/los-angeles/health-and-beauty/cure-west-hollywood",
      "published_at": "2016-05-20",
      "trust_level": "editorial",
      "content": "Whether you're a globe-trotting rock star, silver-screen starlet or dream of being one, get polished, primped and pampered at Sunset Tower Hotel's spa hideaway. Tucked away on the Strip, a stone's throw from the original Riot House where rock 'n' roll legends used to carouse and play, you feel as though you've entered another time and place—Old Hollywood, perhaps—the moment you pull up to the Art-Deco building. Past the understated glam (and decidedly masculine) lobby and down a flight of stairs leads you to the main reception/salon where the town's most famous tresses are tousled and tamed. Another flight down takes you to a dimly-lit haven for all your pampering needs. Services are extensive from nail care, facials, waxing, massages, body treatments, hammam, baths, make-up tanning and injectables. The spa is available for hotel and non-hotel guests, so there's no reason not to indulge in these amenities and feel like Hollywood royalty."
    },
    {
      "source_id": "src_michelin_2024",
      "publication": "Michelin Guide",
      "title": "Sunset Tower Hotel",
      "url": "https://guide.michelin.com/us/en/hotels-stays/los-angeles-area/sunset-tower-hotel-3451",
      "published_at": "",
      "trust_level": "editorial",
      "content": "In the latter years of the golden age this Art Deco apartment tower was home to the likes of Marilyn Monroe and Frank Sinatra; and while today the mid-century atmosphere is still in place, it's no museum — there's nothing faded about the newly renovated Sunset Tower's sober, earth-toned interiors, and it's not collectors or autograph hounds but bona fide Hollywood players who frequent its halls today. The décor is seemingly tailor-made for the golden afternoon sunlight that brought the film business to LA in the first place. It's not quite high luxury, but it's pleasantly upscale, with high-end Egyptian linens and Sangre De Fruta bath products. And if there's any incongruity, it's between the classic elegance of the Sunset Tower and the very modern inelegance of the Sunset Strip. It's a locale that's best enjoyed with a raised eyebrow, and then escaped, with a trip to the Tower Bar and Restaurant, a clubby, classic eatery on the site of what used to be the apartment belonging to the ga..."
    }
  ]
}