{
  "place_slug": "sushi-tama",
  "sources": [
    {
      "source_id": "src_theinfatuation_2022",
      "publication": "The Infatuation",
      "title": "Sushi Tama - Review - Beverly Hills",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/sushi-tama-1",
      "published_at": "2022-01-13",
      "trust_level": "editorial",
      "content": "If the phrase \"affordable sushi omakase in Beverly Hills\" doesn't immediately register with your brain, that's fine. Normal, even. It sounds like an oxymoron, akin to \"jumbo shrimp\" or \"ethical consumption under capitalism.\" But make no mistake: Sushi Tama is the real deal.\n\nThe neighborhood's latest spot has all of the trappings of a restaurant with a much higher price point, but for just $45, you can order an incredible ten-piece omakase nigiri set, which comes with smooth, buttery cuts of toro, ikura that bursts in your mouth, and fresh uni that's been shipped from either Mexico or Japan - all of which will be patiently explained to you by a member of their waitstaff, even if you're just grabbing the box to-go.\n\nIs Sushi Tama too good to be true? Probably. But for now, we're not going to question it."
    },
    {
      "source_id": "src_timeout_2020",
      "publication": "Time Out LA",
      "title": "Beverly Grove's new Sushi Tama offers sushi from a Tsukiji fish market chef",
      "url": "https://www.timeout.com/los-angeles/news/beverly-groves-new-sushi-tama-offers-sushi-from-a-tsukiji-fish-market-chef-082620",
      "published_at": "2020-09-24",
      "trust_level": "editorial",
      "content": "Los Angeles is home to some of the best sushi in the country, but for all its hand-roll bars and tucked-away omakase spots and quick-and-casual gems, one thing it doesn't have an abundance of is sushi restaurants run by vets from Tokyo's Tsukiji Market. The new Sushi Tama, sitting at the nexus of Beverly Hills, West Hollywood and Beverly Grove, is pushing us in the right direction.\n\nChef Hideyuki Yoshimoto spent more than a decade at the world-famous fish market, and his new restaurant within Robertson Plaza is inspired by it in its sourcing, flexibility and simplicity: The fish rotates constantly, so the daily donburi might feature its own unique omakase selection, or the nigiri might involve toro taku—both exact dishes gone the next day. The menu is built to change and scale in price, always with the fish in mind.\n\nThe handful of zensai run the gamut, including more L.A.-elusive starters such as clam miso soup and the nori-wrapped scallops as well as options like a more straightforward variety. There are maki ($8–$25) and sashimi ($17–$36) with a chef's sashimi choice at $50 and an omakase don—topping a bowl of rice with whatever fish Yoshimoto recommends that day—at $45, a competitive price point, especially given the upscale neighborhood. There's even a vegetarian omakase don at $21.\n\nThere are salmon temaki, and bites of wagyu topped with uni, and even aburi toro, where thick cubes of fatty tuna receive a light charring, all to be enjoyed on the patio along Robertson Boulevard. Don't want to dine in? Sushi Tama's part of the Shōwa Hospitality group, which is no stranger to takeout (just see their lush to-go bentos and sushi sets from sibling restaurant Himitsu in San Diego), and you can expect a separate, streamlined menu of thoughtfully planned and plated sushi to enjoy from your couch, including an artful $60 temaki set where you assemble uni, ikura, salmon and whatever else is freshest that day over already-formed mounds of imported rice.\n\nIn fact, Sushi Tama's to-go might be the best move of all, as it's available all day and night with no stop-downs between lunch and dinner service—though if you're open to dining out and looking for a patio (and don't want to miss Yoshimoto-san's daily specials), it might be hard to skip the patio.\n\nSushi Tama is now open in Robertson Plaza, at 116 N Robertson Blvd, with hours of 11am to 2:30pm and 5 to 9pm Sunday to Wednesday; 11am to 2:30pm and 5 to 10pm Thursday to Saturday; and pickup hours of 11am to 10pm daily."
    }
  ]
}