{
  "place_slug": "teddys-red-tacos",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Teddy's Red Tacos - Review - South Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/teddys-red-tacos",
      "published_at": "2023-12-11",
      "trust_level": "editorial",
      "content": "Teddy's Red Tacos is a truck located about 15 minutes south of downtown, sitting right on some (hopefully-not-in-use) railroad tracks. There's no menu, they only cook beef birria, and before you even say hi to the cashier, they'll have started making you a deluxe plate, which comes with a quesadilla, molita, tostada, taco, pozole, and chips and salsa for only $10. Teddy's food is big and gooey and the kind of soul-curing meal you need as you sit and wonder if that train will actually come. Cash only.\n\nPretty Good: You'll likely be satisfied by a meal here, especially for a specific situation. These are handy back-up restaurants and beloved local spots."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Teddy's Red Tacos Venice Beach - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/teddys-red-tacos-venice",
      "published_at": "2024-10-03",
      "trust_level": "editorial",
      "content": "The first Westside location of Teddy's Red Tacos is just as good as the original in Boyle Heights (which made our list of the Best Tacos In LA). And while the atmosphere in a shop off the boardwalk in Venice doesn't quite live up to the original truck parked on train tracks, the rich, spicy beef birria is exactly the same. It's the only thing on the menu, and the way to order it is in deluxe platter form, which comes with a quesadilla, mulita, tostada, taco, and pozole. You'll be extremely full and happy.\n\nPretty Good: You'll likely be satisfied by a meal here, especially for a specific situation. These are handy back-up restaurants and beloved local spots."
    },
    {
      "source_id": "src_foodgps_2023",
      "publication": "Food GPS",
      "title": "Teddy's Red Tacos",
      "url": "https://foodgps.com/teddys-red-tacos/",
      "published_at": "2023-12-15",
      "trust_level": "editorial",
      "content": "Teddy Vazquez serves vivid Tijuana style beef birria tacos in South L.A. The industrial byways in South Los Angeles continue to sprout Mexican street food stars. Teddy's Red Tacos is one of the area's growing legends, a food truck from Teddy Vazquez that parks along deactivated railroad tracks just east of the 110 freeway and specializes in Tijuana-style birria tacos starring tender stewed beef. Vazquez was born in L.A. and grew up in Puebla, Mexico. His friend runs popular Birria El Paisa in Tijuana and offered to teach Vazquez everything he knows. At the time, he was working in shipping and initially passed on the opportunity, but after business dipped, he agreed. Vazquez stews beef shoulder for three hours in broth with tomatoes, secret spices and chiles before the meat falls apart into shreds. He forms tacos and quesadillas on corn tortillas griddled with secret juices that provide their signature fire-red color.\n\nTacos are available with chopped red onions, cilantro, and a splash of spicy red salsa made with chile de arbol. Accept all three accompaniments. Vazquez plates tacos with crunchy sliced radishes and squeezable limes. Request a cup of hot consommé chock full of beefy debris for no added charge. Teddy's Red Tacos sets up two tents on the rock-strewn train tracks that provide shade for six communal plastic tables and fold-up metal chairs. Sit and eat to enjoy the food at the height of its powers, and to save your car from splatter."
    }
  ]
}