{
  "place_slug": "the-line-la",
  "sources": [
    {
      "source_id": "src_michelin_guide_2024",
      "publication": "Michelin Guide",
      "title": "The LINE Hotel Los Angeles - Los Angeles Area",
      "url": "https://guide.michelin.com/us/en/hotels-stays/los-angeles-area/the-line-hotel-los-angeles-7091",
      "published_at": "",
      "trust_level": "editorial",
      "content": "When the Line Hotel first opened, in its iconic modernist tower on Wilshire Boulevard, it instantly put the downtown-adjacent Koreatown neighborhood on the map for travelers who might ordinarily have looked elsewhere. It also put the brand-new Line brand on the map. Now, a few years on, it's a fixture on the Los Angeles boutique-hotel landscape, as its stylish minimalist rooms and its buzzing public spaces have quickly become iconic. The interiors, by local designer Sean Knibb, contrasts raw concrete and hard-edged modernist geometry with contemporary colors, unique furnishings, and a surprising amount of plant life. And while the rooms stop short of luxury-hotel extravagant, they're as comfortable as they are eye-catching — and views of the Hollywood Hills through the north-facing full-length windows don't hurt a bit. Of equal importance to the Line's appeal are its restaurants and bars, which have gone through a further evolution: chef Josiah Citrin, who earned two Michelin stars, now helms Openaire, which occupies a dazzling greenhouse-like space on the hotel's second floor. Citrin's offerings are on the menu by the poolside and in the lobby bar as well. Meanwhile a café by Alfred Coffee and a design shop by local duo Poketo round out the package — for an introduction to contemporary Los Angeles creative culture, there's nothing quite like the Line."
    },
    {
      "source_id": "src_the_infatuation_2022",
      "publication": "The Infatuation",
      "title": "Openaire - Review - Koreatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/openaire",
      "published_at": "2022-08-23",
      "trust_level": "editorial",
      "content": "Openaire is the hotel restaurant at The Line in Koreatown in the old Commissary space. The dining room still looks like a greenhouse on a Hamptons estate, but the restaurant is now run by the chef from Melisse and Charcoal, so the food has changed quite a bit. Some of it works - the hamachi crudo and the sirloin steak with a toasted garlic brown butter sauce are particularly great - but other dishes don't quite land, like the shrimp that comes with a weird combination of beans, turnips and an herby sauce. If you're staying in the hotel or happen to be nearby, you'll be pleasantly surprised by this place, but there's also no need to seek it out."
    },
    {
      "source_id": "src_wallpaper_2022",
      "publication": "Wallpaper",
      "title": "Los Angeles' The Line hotel unveils new culinary concept with interiors to match",
      "url": "https://www.wallpaper.com/travel/openaire-restaurant-at-the-line-hotel-los-angeles",
      "published_at": "2022-10-08",
      "trust_level": "editorial",
      "content": "The Sydell Group's ability to iterate has never been more clear than in the refresh it has recently given The Line hotel in Los Angeles. The hotel's recognisable greenhouse restaurant space has been handed over to chef Josiah Citrin, a native Los Angeleno with Michelin stars to boot. Focusing on a cornucopia of Californian ingredients, the new Openaire restaurant showcases shareable seasonal dishes, with a slight Asian predilection. Citrin's approach is informed by the generous, soulful spirit of meals prepared in his home, which he has infused with various global influences. To complement its new culinary direction, designer Sean Knibb has also transformed the space, which is located next to the pool deck, with burgundy mohair banquettes, baskets of fragrant plants like Jerusalem jasmine and rose geranium hanging overhead, and a marble bar that has been finished with mirrored details. Custom-made marble crates containing liquor and apertifs bring a playful spirit to the setting. Citrin's reach continues in the hotel's lobby bar, where a diverse menu of small bites and snacks is in keeping with what's available at Openaire. The lobby area has been updated with Persian rugs, communal tables, mohair banquettes again, and a new site-specific installation created by designer Henry Taylor. A new mural, created by artist-in-residence Brendan Monroe, for the design shop Poketo's storefront also brings a new energy to the space. The bar owes its comprehensive beverage menu to Happy Hour agency, a collective that's locally known for their inventive cocktail pop-up parties. Balancing inventiveness with a refined palette, the Line's newest attributes are set to go down a treat."
    },
    {
      "source_id": "src_fathom_2018",
      "publication": "Fathom",
      "title": "A Review of The Line LA in Koreatown, Los Angeles",
      "url": "https://fathomaway.com/review-the-line-hotel-koreatown-los-angeles/",
      "published_at": "2018-08-22",
      "trust_level": "editorial",
      "content": "The Line LA is the coolest place to stay in Koreatown, Los Angeles' coolest neighborhood. Vibe: Buzzy, at times downright bumping, with a cafe-meets-gallery vibe in the lobby and an industrial-chic aesthetic in the rooms that makes the hotel feel as inviting as it is mesmerizing. Lobby Bar on the first floor sports a sophisticated menu of bar snacks and Mexican- and Korean-inflected cocktails, best enjoyed during their excellent happy hour. Open late is Break Room 86, the speakeasy-style nightlife venue from LA's own Houston Brothers, which features live performances, guest DJs, karaoke suites, a dance floor, and lots of boozy push pops. For the day after, Alfred in the lobby does coffee, their own blend of matcha sourced straight from Japan, and a selection of yummy snacks. Rooms: Custom plush-topped mattresses, oversized desks, low-hanging lamps, loungey tables, and tasteful seating are either sourced or made by designer Sean Knibb in a studio in nearby Venice Beach. Work from local artists hang on the wall. The Speek Suite, one of the hotel's ten suites, was designed by Mark and Jonnie Houston of the speakeasy Break Room 86 downstairs to induce nostalgia, with Malm-style fireplaces, retro wallpaper, and ceiling-high curio cabinets that mimic the '60s and '70s decor of their childhood Koreatown home. Blackout shades guard against rude, early morning awakenings and have fun, exterior-facing pops of color. Mini bars are filled with a combination of Western and Korean snacks. Bathrooms, bright and refreshing with gold fixtures and bath products from local brand Buckler's, recall a more stylish version of one of the area's many Korean day spas. Rates change seasonally and start at $199."
    },
    {
      "source_id": "src_timeout_la_2017",
      "publication": "Time Out LA",
      "title": "The LINE | Hotels in Koreatown, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/hotels/the-line",
      "published_at": "2017-10-28",
      "trust_level": "editorial",
      "content": "For those who place a priority on edgy design and a sense of communality, the sought-after LINE LA makes a fine landing spot. Between the pool, always-packed Commissary restaurant, and quirky art objects displayed in the rooms, there's plenty to love. Location: At the intersection of Wilshire Boulevard and Normandie Avenue, the LINE LA makes it easy to explore the much-touted neighborhood of Koreatown, which is packed with fun bars and restaurants. The Wilshire/Normandie metro station sits across the street, providing easy access to Downtown and beyond. Nearby dining: Park's BBQ ranks as one of L.A.'s best Korean BBQ spots, just two blocks from the hotel. Dan Sung Sa is a low-key Korean diner for small traditional plates, a 10-minute walk from the hotel. Shatto 39 Lanes, a neighborhood favorite located a mile away, has been around since 1954 and offers a roundabout bar, coffee shop, arcade, billiards room and 39 bowling lanes. Time Out tip: Reach over on your nightstand for a copy of Here, a custom magazine created by the hotel for first-timers to L.A. The guidebook is specifically tailored to the kind of guests that stay at the LINE, so count on lush, gorgeous photos, plus insider tips on the best K-town spas, shops and cafes to hit up during your visit."
    }
  ]
}