{
  "place_slug": "the-maybourne-beverly-hills",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "The Cigar & Whiskey Bar at The Maybourne - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/the-cigar-and-whiskey-bar-at-the-maybourne",
      "published_at": "2025-11-12",
      "trust_level": "editorial",
      "content": "The Maybourne has a few spots to pull up for a cocktail, but for something a little dramatic, plan a night at the Cigar & Whiskey Bar. This reservation-only bar is hidden on the second floor (you'll get escorted up a back staircase) with 1,000+ cigars in stock (for hotel guests only, but cool to look at) and a booklet of whiskies sorted by country. There's a $100 per person minimum, but that's not difficult to hit, considering the per-ounce price of some premium bottles. Or, just order off the cocktail list—they make an excellent Penicillin."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The Terrace At The Maybourne Beverly Hills - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/the-terrace-at-the-maybourne-bh",
      "published_at": "2024-02-05",
      "trust_level": "editorial",
      "content": "At $125 per person, afternoon tea at The Maybourne is not a small financial undertaking, but if eating delicious food is your priority, this is our top pick. The menu features bites like chicken paté balls wrapped in raspberry gel, cauliflower panna cotta with caviar, and colorful, over-the-top desserts that look like props from Alice In Wonderland. Plus, if there's a more lavish scene in Beverly Hills than Maybourne's courtyard on a sunny afternoon, we don't know it. Diamonds on diamonds, darling."
    },
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Dante Beverly Hills - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/dante-beverly-hills",
      "published_at": "2023-11-23",
      "trust_level": "editorial",
      "content": "Splashy dining rooms and designer bucatini are popping up all over Beverly Hills, but Dante is the one making sugar babies go ballistic. That's because this rooftop spot sits on the ninth floor of the Maybourne Hotel, where you can get views of the Hollywood Hills from the comfort of a blue velvet booth. Just like the original NYC location, Dante Beverly Hills has a cocktail menu with the breadth and depth of your typical wine list. You'll see sections dedicated to martinis, negronis, spritzes, agave spirits, and zero-proof cocktails. Most drinks cost over $20 and are very good if not a little precious (prepare for your bartenders to spray olive brine mist on the rim of your dirty martini or scorch green chilis for your spicy margarita). Still, the view is Dante's real draw."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "This Italian-inspired spot is officially the best rooftop bar in L.A.",
      "url": "https://www.timeout.com/los-angeles/news/this-italian-inspired-spot-is-officially-the-best-rooftop-bar-in-l-a-040425",
      "published_at": "2025-04-05",
      "trust_level": "editorial",
      "content": "That honor now goes to Dante Beverly Hills, a ninth-floor rooftop at the Maybourne hotel with top-notch cocktails and dreamy views of the hills. The quality of the actual bar-going experience would crumble at most rooftops if you take the \"rooftop\" part out of the equation—but the drinks at Dante are so good that they stand up to L.A.'s best bars, period. \"The panoramic views are stunning, and while I'd still steer you towards Perch for a classic urban skyline, Dante absolutely smokes the competition if you're after quality drinks and ambience,\" says Time Out L.A.'s food and drink editor, Patricia Kelly Yeo. The rooftop takes some of the essentials from its long-running New York originator—a lauded, Italian-inspired neighborhood spot—and adds some 90210 ritziness."
    },
    {
      "source_id": "src_timeout_2025_sup_yoga",
      "publication": "Time Out LA",
      "title": "I tried stand-up paddleboard yoga for the first time—on a Beverly Hills hotel rooftop",
      "url": "https://www.timeout.com/los-angeles/news/i-tried-stand-up-paddleboard-yoga-for-the-first-timeon-a-hotel-rooftop-081425",
      "published_at": "2025-08-15",
      "trust_level": "editorial",
      "content": "The Maybourne Beverly Hills is offering what just might be the most \"L.A.\" workout imaginable. Stand-up paddleboard (or SUP) yoga—a marine-meets-mindfulness workout—is a relatively new concept. The practice in itself feels very L.A.: heading to the water but incorporating a zen workout into your beach day. But when I got an invite to try a new SUP yoga offering at the luxurious Maybourne Beverly Hills hotel—previously the Montage Beverly Hills—my interest was piqued. Rather than in the ocean, a lake or a lagoon, it was being held in a pool, on a rooftop, in the middle of Beverly Hills. I arrived at the hotel for the morning class and took the elevator up to the ninth-floor rooftop, where there's a bar, cabanas and a small, three-foot-deep pool that had been transformed into a floating yoga studio. I saw six paddleboards spaced out evenly atop the water and was relieved to see they were anchored in place. Since each class is limited to only six participants, you can expect some personalized instruction as you move through the different poses. Your $42 ticket gets you a 60-minute class, with all equipment provided, plus a voucher for a juice at the ground-floor Maybourne Cafe."
    },
    {
      "source_id": "src_timeout_2025_luxury_hotels",
      "publication": "Time Out LA",
      "title": "The Best New Luxury Hotels In The World For 2025, According To The Forbes Travel Guide",
      "url": "https://www.timeout.com/news/these-are-the-best-new-luxury-hotels-in-the-world-according-to-the-forbes-travel-guide-021325",
      "published_at": "2025-02-13",
      "trust_level": "editorial",
      "content": "For 2025, 20 five-star hotels which have newly opened were included in the Star Awards, and one of these was The Maybourne Beverly Hills, a decadent place to stay with lovely views which is just around the corner from Rodeo Drive. Every year the publication has 'incognito inspectors' pose as guests to test out a hotel's service, quality and condition, and five-star stays from across the world made the ranks for 2025."
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "These Are the Most Luxurious Hotels in Los Angeles",
      "url": "https://guide.michelin.com/us/en/article/travel/these-are-the-most-luxurious-hotels-in-los-angeles",
      "published_at": "2025-07-28",
      "trust_level": "editorial",
      "content": "As the sister hotel to London's esteemed Claridge's (Three MICHELIN Keys), the luxury here is particularly grand and majestic, with 5,000 square feet of manicured gardens along the palatial Spanish Colonial Revival retreat. Inside, a museum-worthy collection of contemporary art hangs on the walls: a Damien Hirst cherry blossom in the café, a Yoshitomo Nara series on the sixth floor. The bilevel spa is the property's crown jewel, with 17 treatment rooms and a gorgeous mineral pool set in a tiled atrium. Inspector Notes: The interiors are every bit as elegant as those of the Maybourne's English sister hotels, though they're obviously Californian through and through, in a warm and sunny Art Deco–influenced style. As for the comforts, they're pure 21st-century luxury, and the spa and rooftop pool cement the hotel's pleasure-palace status."
    },
    {
      "source_id": "src_timeout_2025_alinea",
      "publication": "Time Out LA",
      "title": "Alinea pop-up in Beverly Hills: Chicago's three Michelin star restaurant is heading to L.A. this summer",
      "url": "https://www.timeout.com/los-angeles/news/chicagos-three-michelin-star-alinea-is-coming-to-beverly-hills-this-summer-021925",
      "published_at": "2025-02-19",
      "trust_level": "editorial",
      "content": "In L.A., the three Michelin star restaurant will take up residency at the Maybourne Beverly Hills from July 17 to August 20. The 20-year-old Alinea is widely credited with popularizing molecular gastronomy. In honor of its 20th anniversary, Grant Achatz is bringing his legendary restaurant on the road. A few tour stops are slated to include pop-ups of the restaurant's cocktail bars, the Aviary and the Office, but it's unknown if that list features the summer residency in Beverly Hills."
    }
  ]
}