{
  "place_slug": "the-airliner",
  "sources": [
    {
      "source_id": "src_resy_2024",
      "publication": "Resy",
      "title": "The Triumphant Return of The Airliner, Now Home to Bar Food Unlike Any Other in L.A.",
      "url": "https://blog.resy.com/2024/09/the-airliner-los-angeles/",
      "published_at": "2024-09-15",
      "trust_level": "editorial",
      "content": "I've lived in Los Angeles for a while now. It's a city filled with superb drinking establishments, but I've never felt the desire to live above any of them. Then I walked into The Airliner. It's one of L.A.'s oldest bars, in one of the city's oldest neighborhoods, with a solid list of tiki-inspired cocktails, natural wines, and craft beers (plus some Miller High Life for good measure). It checks all of my boxes, but what really tips me over is what comes out of the kitchen. The Airliner has one of the most compelling bar menus in the city, courtesy of a chef I crossed paths with back in my East Coast days.\n\n\"The bar here is a sister to the kitchen,\" bar manager Liana Vasserot tells me. \"It's a food-driven cocktail menu, because the food here is really the star.\"\n\nWhat's most important is this: The food at the Airliner is simply, completely delicious.\n\nWhen I say this to the Airliner's chef and co-owner, Vinh Nguyen, his smile widens. \"We serve Asian comfort food here, but, yeah, it's really just a bunch of dishes we love to eat when we're drinking,\" he says with a laugh.\n\nI first encountered Nguyen back in Brooklyn. It was 2007, and I was a Vietnamese American kid homesick for my mom's cooking. Nước Mắm wasn't easy to find back in the aughts. Back then there was only one spot: Silent H. It belonged to Nguyen, a fellow twentysomething Vietnamese American kid, who happened to be a second-generation chef. (To help her family, Nguyen's mother dropped out of school at age nine and cooked in street stalls before moving into restaurant kitchens.) His restaurant's name was a play on how he spelled Vinh for other people: \"V-I-N, silent 'H'.\"\n\nNguyen initially grabbed my attention with a grilled pork chop that was a clever, yet satisfyingly familiar take on one of the ultimate Vietnamese comfort foods: thịt kho, a braised pork dish flavored with caramel and fish sauce.\n\nMany years had passed when Nguyen and I met up again at the Airliner. We had both grown into middle age, started families, migrated all across the country, and worked long hours in the hospitality industry. Nguyen put time in in New York, Los Angeles, and Shanghai, in a variety of popular restaurants, including Selamat Pagi, Father's Office, the Grumpy Pig – along with consulting and \"helping out\" gigs in the mix. He's grown into what we in the biz respectfully call a \"chef's chef.\" These people are talented, well-traveled yeoman who are much-valued for their experience, versatility, work ethic, knowledge, and leadership.\n\nIn an industry currently starved for high-end, accomplished talent, Nguyen could be cooking just about anywhere he wants. I was, quite frankly, surprised to see him at the Airliner.\n\nIn the more recent history of its 100 years, the Airliner had become a real dive. It was better known for hosting the legendary hip hop and dance music club night, Low End Theory, from 2006 to 2018 than it was for cranking out great food and drink. It was also, notoriously, featured as a deeply imperiled fixer-upper on a 2018 episode of \"Bar Rescue.\" In fact, the bar was out of operation before Nguyen and his partners renovated and reopened it in the fall of 2023.\n\nWhat's clear is Nguyen is pleased to be cooking for the hoi polloi again having spent most of the pandemic years private cheffing for Tinseltown's rich and famous. He's amassed a team of contributing fellow chef's chefs in the kitchen. The food they serve is influenced by their collective personal and professional experiences with Nguyen at the helm. The baseline is Asian and touches China, Japan, Vietnam, Thailand, Indonesia, and South Korea, though you'll see some elements of Latin America mixed in too – a reflection of both the kitchen team and the surrounding neighborhood's cultural makeup. (Lincoln Heights is a working class, predominantly Latin and Asian area.)\n\nI've compiled nerdy notes in my head about how sneakily chef-driven the Airliner's food is. I could drone on about how they make just about everything in-house, like their Szechuan pepper málà hot sauce. I could describe Nguyen's hack for mimicking the signature wok hay aroma and flavor you get from stir frying in a hot wok without using the actual equipment. But I won't bore you. Just know that well-sourced ingredients, fermentations, multi-day cooking methods, and high culinary techniques abound in a tiny kitchen that's better suited to short-order line cooks griddling up burgers and pancakes.\n\nBut what's most important is that I tell you this: The food at the Airliner is simply, completely delicious.\n\nThere's the silky smooth chicken liver paté suffused with pho spices, mashing up Brooklyn's Marlow & Sons' famed chicken liver mousse recipe with Mama Nguyen's beefy soup. There's the Indonesian beef rendang between toasted brioche buns. There's the Shanghai triple onion noodles: noodles stir-fried with three distinct varieties of onions—bulb, spring and preserved—and finished with a touch of XO sauce. I know they make their own XO sauce, which usually consists of dried scallops, shrimp and ham fried in oil, but I'm keeping their recipe close to the chest."
    },
    {
      "source_id": "src_lamag_2025",
      "publication": "LA Magazine",
      "title": "EXCLUSIVE: Chef Vinh Nguyen's The Airliner Debuts Revamped Music Venue",
      "url": "https://lamag.com/arts-and-entertainment/the-airliner-lincoln-heights-music-venue-reopening/",
      "published_at": "2025-08-21",
      "trust_level": "editorial",
      "content": "The Airliner in Lincoln Heights is starting a new chapter. Following a two-year renovation, chef Vinh Nguyen and Gary Wang's restaurant and bar is also officially a music venue once again.\n\nThe 100-year-old establishment has deep ties to L.A.'s underground music scene, having once served as the locale for the weekly Low End Theory club night. The stage has been graced by the likes of Tyler, the Creator, Flying Lotus and Thundercat early in their career, and even Prince.\n\n\"When I wear my Airliner baseball cap, people come up to me and wind up sharing a story of a show they went to decades ago,\" Nguyen tells Los Angeles. \"It has always been an iconic underground where many Angelenos fell in love with nightlife and music. These are big shoes to fill.\"\n\nThe chef-owner envisions a musical lineup just as eclectic as the menu, which teems with izakaya bites inspired by Shanghai, Tokyo, Ho Chi Minh City and Los Angeles (such as Hunan barbecue pork ribs, green curry crispy rice, chicken liver paté and Chong Qing chicken wings).\n\n\"Whether they be DJs, bands, comedians, visual artists or chefs, we really want these artists to collaborate with us and bring cultural events to Lincoln Heights and L.A. in a way that's both unique to them and unique to audiences. We deserve it now more than ever.\" He adds, \"Our endeavor is to foster a genuine community for the culturally curious. I'd love for our Airliner to be an intimate venue that would attract folks to come together to celebrate music, food and hospitality all at once. Let's have Radiohead play an intimate show, but then come downstairs afterwards, and enjoy our Hojicha Tres Leches Cake or some Triple Onion Noodles.\"\n\nHelmed by Los Angeles Design Group, the revamp sports fresh wallpaper, new furniture, lighting enhancements and a vintage Hi Fi sound system on the main floor. The second floor, home to the listening room and music venue, went through a complete engineering overhaul. Additionally, the 85-year-old walnut bar remains intact, while custom \"crumpled paper\" acoustic panels add a design edge to the space.\n\n\"It sounds amazing,\" Nguyen says. \"It brings the architectural vision of this space to life — of being inside a giant wooden speaker box and feeling sound waves wash over you.\"\n\nNguyen sees this next step for The Airliner as one that embodies everything that L.A. loves most: music, comedy, cinema, food, wine, cocktails. Above all, he foresees it as continuing to uphold its reputation as a neighborhood gem. \"I think that spending time in this historic bar and restaurant, walking into its hidden backyard garden, and then catching a show in the new upstairs music venue /listening room is a special, transportive experience,\" he says. \"The industrial design is clean, minimal and illuminated by the warmth of natural wood. But it's really a blank canvas for L.A. to usher in a new legacy of intimate shows.\"\n\nThe Airliner is located at 2419 Broadway 90031. It is open Wednesday through Sunday."
    },
    {
      "source_id": "src_infatuation_2020",
      "publication": "The Infatuation",
      "title": "The Airliner - Review - Lincoln Heights - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/the-airliner",
      "published_at": "2020-02-12",
      "trust_level": "editorial",
      "content": "The Airliner in Lincoln Heights has been a dive bar/performance venue for decades, but after closing for a thorough renovation, this classic spot is back. And while the new Airliner is still a neighborhood hangout, they're also a spot where you can get well-made cocktails and good beer, and chat with friends all night on comfy banquettes. This is the kind of place where you stop in for a quick drink and accidentally end up staying the entire night. There's a big back patio, friendly bartenders, and a mixed crowd of long-time regulars and people who are sick of Echo Park - but everyone's here to have a good time."
    },
    {
      "source_id": "src_timeout_la_2023",
      "publication": "Time Out LA",
      "title": "The Airliner | Bars in Lincoln Heights, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/the-airliner",
      "published_at": "2023-09-05",
      "trust_level": "editorial",
      "content": "This 100-year-old dive bar in Lincoln Heights is now a neighborhood izakaya with moderately priced dishes and cocktails that pull inspiration from around the world. Think triple onion noodles inspired by a Shanghai night market, an Indonesian beef rendang roll and Vietnamese-style chicken liver pate."
    },
    {
      "source_id": "src_latimes_2023",
      "publication": "LA Times",
      "title": "Century-old Lincoln Heights bar the Airliner reopens with new owners and a new menu",
      "url": "https://www.latimes.com/food/story/2023-09-04/century-old-lincoln-heights-bar-the-airliner-reopens",
      "published_at": "2023-09-04",
      "trust_level": "editorial",
      "content": "Lincoln Heights' iconic century-old bar the Airliner is open once again — this time as a pan-Asian izakaya, and with a music-focused concept planned for the second floor. Long the scene for live shows and DJ sets that spanned decades and a range of communities, the Airliner closed earlier this year, with many left wondering what was to become of the cherished space. Now a trio of restaurateurs has taken up the mantle, and with the interior newly polished and the back patio set for diners, the Airliner serves as a home for \"pan-Asian izakaya\" dishes and cocktails that nod to the neighborhood and the owners' heritages. \"You go to the Smart & Final here [in Lincoln Heights] and there's Chinese, Vietnamese, Mexican — such a hot, hot mix of people, so that's kind of my vision,\" said chef-partner Vinh Nguyen. Building his career in New York City, Nguyen cooked at popular Southeast Asian-leaning restaurant Silent H, which he then remodeled into the wildly popular Cafe Colette. After that restaurant's constant thrum and the sheer volume at brunch — upwards of 350 people each service — Nguyen traveled to Shanghai for a reset, where he met his future Airliner business partner, Gary Wang. They collaborated on a bar, the Grumpy Pig, before Nguyen returned to New York and opened more restaurants, including Indonesian spot Selamat Pagi, and moved to Los Angeles where he co-founded Chinese pop-up Stay Lucky. Traces of all of these restaurants and bars now can be found at the Airliner — with many dishes hovering around $10 or $15 in an attempt to keep visits affordable. Indonesian rendang slides between toasted brioche buns, noodles get pan-fried with three varieties of onions to evoke Shanghai street food, and crispy rice gets a dousing of Thai Panang curry with wood-ear mushroom salad. Another bar — set to open upstairs in 2024 — is planned as a hi-fi concept with quality sound systems, turntables and a small area for live performances in an ode to the Airliner's legacy as a live-music venue. The Airliner is open Tuesday to Saturday from 5 p.m. to midnight."
    }
  ]
}