{
  "place_slug": "the-tower-bar",
  "sources": [
    {
      "source_id": "src_the_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Tower Bar is ridiculous. That's entirely the point",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/tower-bar",
      "published_at": "2025-11-06",
      "trust_level": "editorial",
      "content": "If anyone tells you they go to Tower Bar \"for the food,\" they're lying. Everyone at this industry hangout inside the Sunset Tower Hotel is here to see and be seen (or, as a friend taught us to call it over cocktails here one night, SABS). Oscar winners float through the dim-edging-on-dark dining room, on their way to their usual table for a pre-awards-night burger. Studio bigwigs hold court at very visible booths, strategically greeting (or ignoring) almost everyone who walks in. Well-behaved children in polo shirts quietly pick at their fries before falling asleep in their parent's lap. Not to mention the low-level agents, aspiring actors, and tourists attempting casual nonchalance, all only half making conversation while on the lookout for someone, anyone, famous.\n\nPerhaps, to you, that sounds horrible. To which we say, lighten up. You will not have a memorable meal at Tower Bar, but you will have a memorable Hollywood night.\n\nThere are a few ingredients to keep in mind, though. Martinis are near mandatory, expertly made, and go very well with a plate of pigs in a blanket in the bar area. If it's daytime, sit in the terrace room, as close to the pool as possible. If it's evening, deny any attempt by the maître d' to seat you in that same terrace room and insist on a table in the clubby, dark main dining room. Come with someone who's ready to gossip and embrace the fun, and who won't be mad when you suggest ordering a $45 burger.\n\nTower Bar is ridiculous. And that's entirely the point. At this point, ordering a martini in a place like Tower Bar is a cliché. Who cares? They taste good, make you feel fancy, and the ones at Tower Bar are excellent. On the other hand, pigs in a blanket are entirely unsophisticated and yet, still, a Tower Bar classic. These are fine, although they do sometimes come out kind of burnt."
    },
    {
      "source_id": "src_michelin_2024",
      "publication": "Michelin Guide",
      "title": "LA's Sunset Tower is a Chic, Comfortable Home Away From Home",
      "url": "https://guide.michelin.com/us/en/article/travel/jeff-klein-the-sunset-tower",
      "published_at": "2024-08-19",
      "trust_level": "editorial",
      "content": "When you're visiting for a few days like I am, plans stack up. And staying at Sunset Tower makes things easy. Because friends and work acquaintances want to come hang at the hotel. It's a great place for a drink. Or dinner at the Tower Bar.\n\nFor this trip I wanted to explore why I'm so drawn to this place. Over the years I've noticed other creatives gravitating to the hotel as well.\n\nIt's a small hotel, not part of a huge corporation. Many of the staff have worked there for years. Back in New York I never eat breakfast but one morning I wandered downstairs on my first stay, to sit out on the patio by the pool. I met a waiter named Angel and he's been my server every morning since. That's not an exaggeration. 17 years. Barbara, the daytime terrace restaurant host, has been there for 8. They both remember me by name. It's something so unusual in today's hospitality world, let alone 3,000 miles away from home.\n\nThe hotel was originally designed as a luxury apartment building by Leland A. Bryant in 1929. John Wayne, Marilyn Monroe, Frank Sinatra, Elizabeth Taylor, and Bugsy Siegel all lived there. The Tower overflows with old Hollywood charm. It's impossible to replicate or manufacture anywhere else. The design is unmistakably art deco with a touch of midcentury modern."
    },
    {
      "source_id": "src_the_infatuation_2025_live_music",
      "publication": "The Infatuation",
      "title": "The 20 Best LA Bars & Restaurants With Live Music",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-la-bars-with-live-music",
      "published_at": "2025-01-27",
      "trust_level": "editorial",
      "content": "This West Hollywood restaurant might be most famous for its debaucherous entertainment industry clientele, but there's also a softer side to Tower Bar. Jazz pianists play for the crowds cozying up to roaring fireplaces, while over on the terrace, a stringed quartet serenades as the sun sets over the city. It's a one-of-a-kind, essentially LA restaurant setting and a place that, regardless of whether you've lived here your whole life or are just visiting for the weekend, never gets old."
    },
    {
      "source_id": "src_the_infatuation_2024_best_bars",
      "publication": "The Infatuation",
      "title": "The 16 Best Bars in West Hollywood",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-bars-in-west-hollywood",
      "published_at": "2024-04-17",
      "trust_level": "editorial",
      "content": "To be clear, you're not coming to Tower Bar on a Saturday night to drink cheap whiskey and go home with somebody who's crying in the corner. You're here on a Saturday afternoon dressed in your weekend's best to mingle with the Hollywood power crowd and pretend you're one of them for a few hours. You'll definitely see a celebrity slugging back martinis and you'll probably order a build-your-own sundae by the pool. Tower Bar is a total classic. The theme isn't Hollywood, it just is Hollywood."
    },
    {
      "source_id": "src_the_infatuation_2022_celebrity_spots",
      "publication": "The Infatuation",
      "title": "Where To Take Someone Who Just Wants To See A Celebrity",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-places-to-see-a-celebrity-in-la",
      "published_at": "2022-12-13",
      "trust_level": "editorial",
      "content": "Located in the heart of The Strip, Tower Bar is an iconic LA establishment where celebutants still want to hang out and pretend to eat tuna tartare. The poolside patio is a certifiable scene, so bring your best pair of sunglasses and sharpen up that side-eye. You don't come to Tower Bar to eat, you come to suck down dirty martinis and watch celebrities yell into their phones."
    }
  ]
}