{
  "place_slug": "the-west-hollywood-edition",
  "sources": [
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "The West Hollywood EDITION | Hotels in West Hollywood, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/hotels/the-west-hollywood-edition",
      "published_at": "2025-08-23",
      "trust_level": "editorial",
      "content": "The 13-story nightlife-oriented Marriott property offers 190 guest rooms, 48 suites and two penthouses and shares a handful of amenities with the adjoining nine-story luxury condo tower. If the thought of paying up the nose for a dusty old room at the Chateau Marmont or the Sunset Tower makes you want to throw something out of a window, the EDITION is the right luxury property for you in L.A. The hotel prioritizes modern comforts and sleek design over Old Hollywood glamour—and attracts an equally monied, see-and-be-scene clientele, whether they're noshing on breakfast on the roof, shooting pool in the lobby or, in some cases, actually staying overnight. The tony streets of Beverly Hills are just a few minutes' drive away, and a West Hollywood homebase serves as a decent middle ground between the Westside and Downtown. (The city-within-a-city's distance from the freeway, however, would make a trip down to Disneyland quite difficult, and I would largely recommend the hotel only if you're planning to confine most of your travels to Central L.A.) The 190 rooms are divided into a few categories: Standard, Deluxe (which offers a view), Deluxe Terrace (a view and a balcony). The hotel's on-site restaurant, Ardor, has the rare distinction of being a hotel restaurant I actually recommend to locals and consider one of the best restaurants in West Hollywood. Before the three-Michelin-starred Somni opened its doors down the street and became the most expensive restaurant in L.A., I even considered Ardor my top dining pick in the neighborhood. The signature onion rings, tomato bread and gooseberry tart are as delicious as ever, but chef de cuisine Patricia Lalu keeps things interesting with seasonal menu additions. The Lobby Bar serves light breakfast, all-day bar bites and tasty, if expensive bespoke cocktails, but it can be difficult to flag down a bartender on a Friday and Saturday evening, when some of L.A.'s most beautiful people storm the lobby in search of one another, or at least a decent night out on the town. The rooftop restaurant and bar, known as the Roof at EDITION, offers a beautifully presented sit-down breakfast and all-day Mexican-inspired dishes. The Spa at the West Hollywood EDITION offers massages, facials and other wellness treatments, including LED light therapy, sound healing and body wraps. The gym, located on the second floor, offers an impressive area of equipment and plenty of room to stretch out. The nightclub, known as Sunset at EDITION, draws design inspiration from Studio 54 and features dozens of disco balls hanging from the ceiling—check the nightclub's calendar for more details. While not particularly pedestrian-friendly—I was nearly mowed down by a careless driver in the parking lot of Pink Dot, a longtime liquor store and late-night delivery go-to—the Sunset Strip is still the Sunset Strip, with all the requisite glamour and Hollywood history. Walk westwards down Sunset and you'll encounter Bar Next Door and Prince Street Pizza, which could comprise a lovely, fairly casual evening of drinks and pizza. Walk eastwards and you'll hit the world-famous Comedy Store and eventually encounter the Sunset Tower Hotel."
    },
    {
      "source_id": "src_timeout_la_2025_ardor",
      "publication": "Time Out LA",
      "title": "Review: Pony up at the EDITION valet for a taste of Ardor in WeHo",
      "url": "https://www.timeout.com/los-angeles/restaurants/ardor",
      "published_at": "2022-02-03",
      "trust_level": "editorial",
      "content": "Flawless cuisine and a glamorous, plant-filled interior elevate John Fraser's Ardor from mere hotel eatery to one of the best new L.A. fine-dining experiences. This review was originally published on February 2, 2022, and has since been been updated to changes in prices and menu structure. Despite its ill-timed initial debut just before the pandemic, Ardor at the West Hollywood EDITION has quietly become one of the most exceptional newer fine-dining experiences in all of L.A. Founded by Michelin restaurant alum and NYC restaurateur John Fraser, the self-described \"vegetable-forward\" lobby restaurant offers astonishingly good food and an air of sweeping romance that'll make you forget all about the fact you'll pay at least $22 for valet parking, if not more. Insulated from the chaos of Sunset Strip traffic, Ardor's separate entrance seamlessly segues to the restaurant's stunning backlit bar, where you might need to sit a spell while waiting for a table to open up. After check-in, conventionally attractive hosts in slinky white dresses and kitten-heeled boots will usher you to your table, while Ardor's servers clad in similar all-white attire move about the modern, greenery-lined dining room. Elegant cuisine and sultry ambience make this fine-dining hotel eatery an easy sell for extra-special occasions. John Fraser's flawless \"vegetable-forward\" fare and beautiful design make Ardor an exceptional L.A. fine-dining locale. The vibe: With a polished staff in white and neutrals, a lush dining room and cinematic lighting, Ardor espouses the kind of modern glamour many restaurants reach for, but never achieve. The food: Vegetarian-friendly, plant-focused fine-dining cuisine that would please even the pickiest omnivores. Must-orders include the milk bread, the onion rings and the tandoor carrots. The drink: Top-notch color-coded cocktails that incorporate California produce, with a few worthwhile non-alcoholic options, as well as a small, interesting and expensive list of wines and beers by the glass. Time Out tip: Book Ardor for your next made-to-impress client meal, anniversary, birthday or other splurge-worthy special occasion, and don't even try to find nearby street parking. (Reservations only open 14 days in advance.)"
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The West Hollywood Edition - Review - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/the-west-hollywood-edition",
      "published_at": "2024-11-14",
      "trust_level": "editorial",
      "content": "If you were the person who won last week's Powerball, listen up. For $15,000, The West Hollywood Edition hotel is offering a Valentine's Day \"Date Night Package,\" which awards a couple with a private three-course dinner in their room, exclusive access to a screening room where you can watch a movie of your choosing, one night in the penthouse suite, and Champagne breakfast in bed the following morning. If this seems doable, congratulations on your life and please text us pictures."
    },
    {
      "source_id": "src_theinfatuation_ardor_2024",
      "publication": "The Infatuation",
      "title": "Ardor - Review - West Hollywood - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/ardor",
      "published_at": "2024-09-19",
      "trust_level": "editorial",
      "content": "Ardor is one of the wildest nights you can have at an LA restaurant. It's technically on the ground floor at The West Hollywood Edition hotel, but walking into its sprawling dining room feels like you've stepped onto a Miami mega-yacht that's been completely suspended from space and time. Staff greets you in floor-length white satin gowns, accent lights jut out from tropical plants—creating the effect of a knockoff Fenty runway, and everyone else will either be watching TikTok or recording something for TikTok. Ardor takes people-watching to Olympic levels, but in the event you tire of witnessing international gazillionaires be monsters to anyone refilling their water glass, the good news is there's solid food. Standouts include pillowy milk bread topped with dried tomatoes, shrimp plancha in a creamy scampi sauce, and some of the best onion rings we've ever eaten. Ardor in West Hollywood is one of the most sceney, over-the-top dining experiences in LA. Ardor isn't for everyone—or every day— but if you're in the market for an over-the-top meal where money isn't a problem, this hotel restaurant is one of the best shows in town."
    },
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "Ardor – West Hollywood - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/west-hollywood/restaurant/ardor",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "If a luxury spa ran a restaurant, it would probably look something like Ardor. Cushy white velvet and leather booths, white and beige staff uniforms, and enough verdant greenery to rival a small forest match the equally chic aesthetic at its parent venue, the West Hollywood EDITION hotel. The prices are high too, not that any hotel guests would even notice. But know that there is plenty of substance and care packed onto this vegetable-forward menu. Tandoor carrots with hummus and paprika vinaigrette or grilled dukkah-crusted ahi tuna with yogurt make for satisfying, clean eating. Dry-aged lamb and steaks cater to heavier appetites, and no meal is complete without a tower of tempura onion rings and at least one dessert (try the mojito pie). It's easy being green—and so enjoyable—in the Golden State."
    },
    {
      "source_id": "src_timeout_la_2025_best_hotels",
      "publication": "Time Out LA",
      "title": "15 Best Hotels in Los Angeles for 2025 | Best Places To Stay In LA",
      "url": "https://www.timeout.com/los-angeles/hotels/best-hotels-in-los-angeles",
      "published_at": "2025-10-13",
      "trust_level": "editorial",
      "content": "Perched atop one of the Sunset Strip's steepest rises, the West Hollywood EDITION sleekly encapsulates modern L.A. You could hole up here all weekend and feel like you've 'done' West Hollywood—there's a guests-only rooftop pool with sweeping views, a stylish (if pricey) spa, and strong food, drink, and nightlife options under one roof. The rooms at the EDITION are polished and comfortable, with floor-to-ceiling windows, crisp linens, and Le Labo bath products that elevate what is, at heart, a well-oiled Marriott experience. Categories run from Standard to Deluxe Terrace and Loft Terrace; suites add living areas, bathtubs, and bigger balconies. I'd recommend booking a Deluxe Terrace facing away from Sunset Boulevard if you're after some peace and quiet. Ardor is that rare hotel restaurant locals actually book, and it brags signature onion rings, tomato bread, and a gooseberry tart but on an always-interesting seasonally-rotating menu which has been expertly designed by chef de cuisine Patricia Lalu. You'll be treated to some seriously impeccable service: it's friendly, well-informed, and proactive, and there are thoughtful touches like digital tipping for housekeeping (because who still carries cash?). The hotel also does a good job of balancing wellness and play. The shallow, sun-splashed rooftop pool with loungers and complimentary sunscreen; a second-floor gym; and a spa menu that stretches from massages and facials to LED light therapy and sound healing are there for when you need to relax. After dark, however, the subterranean nightclub, Sunset at EDITION, channels Studio 54 with a galaxy of disco balls—check the calendar for the upcoming events. Time Out tip: Looking for a more relaxed evening hangout? Head just 3-minutes west and you'll have Prince Street Pizza and Bar Next Door ready and waiting for you. Address: 9040 W Sunset Blvd, West Hollywood, CA 90069 Price per night: Rooms start at $667 per night Transport: It's a 25-minute drive to LAX"
    }
  ]
}