{
  "place_slug": "the-dutchess",
  "sources": [
    {
      "source_id": "src_the_infatuation_2024",
      "publication": "The Infatuation",
      "title": "The Dutchess - Review - Ojai - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/los-angeles-reviews-the-dutchess",
      "published_at": "2024-07-03",
      "trust_level": "editorial",
      "content": "If we lived in Ojai, the people working at The Dutchess would probably know our middle name, favorite song, and daily coffee order by heart. This all-day spot from the restaurant group behind Rustic Canyon is that comfortable. Much like every well-styled photo of a boho cabin in Ojai on the internet, this place is full of antique wallpaper, sturdy wooden furniture, and coat hooks shaped like ducks. Starting at 7am, they serve breakfast, lunch, and pastries, ranging from croque madames to samosa hand pies. If you stop in for dinner, expect a menu of Burmese-Californian dishes you won't find anywhere else in town. They have a walk-in bar with a pool table in the back, so even if you can't snag a reservation, you can still drop by for a fun night out. Truly Excellent: An 8 should be on your must-try list, because 8s are great."
    },
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "The Dutchess – Ojai - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/ojai/restaurant/the-dutchess",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Smack in the center of Ojai, The Dutchess reigns from its perch inside a charming 1920s building. It may be the queen of cool, but prim and proper it's not. Instead, this quirky concept features a bakery/cafe by day and a trendy Burmese restaurant by night. Come hungry, as this heartfelt menu is brimming with snacks, salads, curries and large plates designed for sharing. Begin with a tea leaf salad, piled high with slightly bitter tea leaves balanced by napa cabbage and sungold tomatoes with crispy-crunchy peanuts, fried garlic and shallots. Chickpea tofu is perfectly golden-brown and sided by a sweet and sour tamarind sauce. The contemporary, rustic dishes are bested by the skillfully prepared desserts, like a decadent chocolate-caramel ganache tart."
    },
    {
      "source_id": "src_resy_2022",
      "publication": "Resy",
      "title": "At The Dutchess, Three Bakers and a Burmese-Indian Chef Revive a Historic Ojai Space",
      "url": "https://blog.resy.com/2022/03/at-the-dutchess-three-bakers-and-a-burmese-indian-chef-revive-a-historic-ojai-space/",
      "published_at": "2022-04-26",
      "trust_level": "editorial",
      "content": "In the center of the dining room of The Dutchess, a new restaurant in idyllic Ojai, some 80 miles north of Los Angeles, there sits an imposing cast-iron fireplace. Encased in a sturdy brick wall, its roaring fire belies a storied history for this particular building, whose new tenants both honor its past and gently press toward the future. Before it was a fireplace, the cast-iron structure was used as a brick bread oven, installed by local legend Bill Baker back in 1927. Baker was a German sculptor (born Wilhelm Koch) who immigrated to America during the war, then changed his name after winning a government-sponsored competition to produce the best-quality wheatless bread. When The Dutchess opened in January, Kate's Bread morphed into one part of a multifaceted operation that includes a bakery, café, and Burmese-Indian restaurant. Although the now-fireplace no longer functions as an oven, the original bricks were repurposed in the restaurant's patio, and contemporary steam ovens were installed in the kitchen for Pepper to bake off her signature baguettes, slab breads, and oat porridge loaves. At 10 a.m. on a Wednesday morning, the front room is anchored by an overflowing pastry case. A line of people forms for sticky toffee date muffins, spicy pickled chile cheddar scones, and citrus olive oil tea cake with candied kumquats and Santa Barbara pistachios — all courtesy of Kelsey Brito, The Dutchess' pastry chef and the second of four partners. In the back bar room, officially called The Duke, two regulars play a game of pool against salmon-pink walls and communal tables fashioned from reclaimed wood. Zoe Nathan, the restaurant's fourth partner, is the first to admit that each partner brings a skill and a style that don't make immediate sense when combined. But it works because everyone is making what they love, she says."
    },
    {
      "source_id": "src_latimes_2022",
      "publication": "LA Times",
      "title": "Young restaurateurs are invigorating the dining scene in laid-back Ojai",
      "url": "https://www.aol.com/news/young-restaurateurs-invigorating-dining-scene-130037272.html",
      "published_at": "2022-05-22",
      "trust_level": "editorial",
      "content": "The laid-back enclave of Ojai, tucked within the Topatopa Mountains some 80 miles north of Los Angeles, boasts the unofficial motto, There's nothing to do in Ojai, and not enough time to do it. For some culinary enthusiasts, the phrase nothing doing has pretty much summed up the restaurant scene of this tiny tourist town, but many locals prefer it that way. By day, the Dutchess is a bakeshop run by local sourdough sensation Kate Pepper and Kelsey Brito; by night, it's a Burmese-themed operation presided over by chef Saw Naing, a onetime heavy metal musician who emigrated from Rangoon, Myanmar, to L.A. in 2007 after repeated jailings for the political content of his songs. A decade later, Nathan made him executive chef at Tallula's. Named for Baker's original oven, whose bricks were repurposed last year as the backyard patio, the Dutchess was touted by Vogue — which called it a chic new all-day restaurant and bakery — even before opening day. The proprietors are Zoe Nathan and Josh Loeb, whose L.A. establishments include Rustic Canyon, Milo + Olive, Tallula's and Huckleberry. At the start of the pandemic, the couple moved their family to a 3½-acre farm in Ojai."
    }
  ]
}