{
  "place_slug": "the-peninsula-beverly-hills",
  "sources": [
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "The Peninsula Beverly Hills - Los Angeles Area",
      "url": "https://guide.michelin.com/us/en/hotels-stays/los-angeles-area/the-peninsula-beverly-hills-8073",
      "published_at": "",
      "trust_level": "editorial",
      "content": "The Peninsula Beverly Hills is almost impossibly opulent, even by Hollywood standards, a cinematically pristine Renaissance mansion of the sort that takes offense at sparing expense. A favorite of industry bigwigs, the hotel means it when it boasts of executive-level service — from the fleet of Rolls Royces and BMWs to the lavish \"programmes\" with celebrity stylists and gurus, this is LA at its shiniest. Starting at the top sounds sensible. This isn't just any rooftop, but rather a complex cocktail of spa, garden, pool, and California-cuisine eatery (with, yes, cocktails). An entire line of bespoke products and treatments await in the wellness center, not to mention a premium array of fitness equipment, but we wouldn't fault you for heading straight for the heated, 60-foot pool. At 195 rooms, inclusive of 38 suites and 18 ultra-confidential villas, the Peninsula definitely situates itself towards the Eastern end of grand-scale luxury, and each one of them proves it many times over. The Frette-sheeted beds are almost too comfortable to consider crawling out of, and why bother when the entire room is controlled by a bedside panel, from the climate control to the \"do not disturb\" sign. They're practically glossy cocoons, what with the 40-inch LCD HDTVs, integrated sound systems, Blu-Ray players, and sumptuously outfitted marble bathrooms. Suites and villas extend the cream-toned magnificence with chandeliers, fireplaces, and roomy terraces, more pied-à-terre than room by this point. The Belvedere, one of LA's classic power-lunch destinations, now sports brilliant new duds by EDG, showcasing a formidable contemporary art collection in every direction. There are plenty of vintages, mixological wonders, and microbrews to go around, fear not, though perhaps they're best enjoyed within the Club Bar's dim, leathery confines. One more luxury makes the Peninsula worth the price, this one quite sensible indeed: the 24-hour check-out policy."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The Peninsula Hotel Beverly Hills - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/the-peninsula-hotel-beverly-hills",
      "published_at": "2024-02-05",
      "trust_level": "editorial",
      "content": "Few afternoon teas can rival the posh scene happening daily inside The Peninsula. The ground floor space is named The Living Room, an appropriate title for a room filled with opulent velvet sofas and two giant fireplaces. It's essentially one big parlor room, where the Beverly Hills sets meet to sip bubbles, gossip, and snack on scones, tarts, and egg salad sandwiches. At $125 per person, this isn't a casual affair, but that's the cost of cosplaying as an heiress for 90 minutes."
    },
    {
      "source_id": "src_timeout_2017",
      "publication": "Time Out Los Angeles",
      "title": "The Peninsula Beverly Hills - Hotels in Beverly Hills",
      "url": "https://www.timeout.com/los-angeles/hotels/peninsula-beverly-hills",
      "published_at": "2017-10-31",
      "trust_level": "editorial",
      "content": "In addition to the A-listers you'll encounter while staying here, this 5-star haunt actually lets you pretend to be one. The lush, secluded Beverly Hills property is designed like a glamorous French chateau and attracts a roster of celebs, jetsetters and bon vivants with its destination spa, 60-foot rooftop pool and signature Afternoon Tea program. When you're inside the Peninsula Beverly Hills, with its landscaped gardens and white-capped bellmen rushing to and fro, it's hard to believe the hotel actually has a capacity of nearly 200 rooms and suites. The ambiance is so intimate, so exclusive, it feels like it might just be you and a few other guests. That's kind of the idea. Guests can arrive and depart at their leisure. There are monogrammed pillowcases and a whole fleet of house cars, so if you fancy being driven out to Malibu in a Rolls Royce, it's no problem. In addition to its dazzling amenities (which also include a 60-foot rooftop pool and a high-end spa), the main attraction here is the grounds. Many of the suites offer private patios dripping with ivy and bougainvillea, and there's a lush rooftop garden that makes a jaw-dropping setting for a romantic lunch or dinner. To really complete the fairytale it's recommended to book one of the hotel's signature afternoon teas, which are held in the lobby and accompanied by a classical harpist. Location: At the intersection of Santa Monica and Wilshire Boulevards, this 5-star hotel puts you right at the edge of the Beverly Hills Country Club (to which the concierge would gladly arrange a visit), and half a mile from Rodeo Drive."
    },
    {
      "source_id": "src_hauteliving_2025",
      "publication": "Haute Living",
      "title": "The Peninsula Beverly Hills Unveils a Luxe New Refresh",
      "url": "https://hauteliving.com/2025/11/peninsula-beverly-hills-design-refresh-2025/780148/",
      "published_at": "2025-11-13",
      "trust_level": "editorial",
      "content": "There are luxury hotels, and then there is The Peninsula Beverly Hills — a place that has always felt suspended slightly above reality, like a dream wrapped in rose petals and California sun. Long revered for its privacy and French-inflected charm, the hotel now enters a luminous new era, unveiling a refreshed design across its 195 guestrooms and its iconic rooftop haven. The transformation is subtle, graceful, and deeply Peninsula: a renewal that whispers rather than shouts. To guide this evolution, the hotel turned to the design artisans of Hirsch Bedner Associates, who approached the project with reverence. Nothing here has been \"redone\"; it has been re-considered, re-tuned, and re-enchanted with the sensitivity of someone restoring a beloved heirloom. This was never about modernizing for the sake of it — it was about honoring a legacy of beauty and hospitality that has defined The Peninsula Beverly Hills for nearly 35 years. Above it all, the rooftop — long one of Beverly Hills' most coveted sanctuaries — has been renewed with the same delicate hand. Ten cabanas, dressed in the Peninsula's iconic yellow-and-white stripes, now feel more expansive and more private, each outfitted with luxe comforts: a 50-inch high-definition television, a Bluetooth sound system that invites you to set your own rhythm, and personalized all-day dining service. Additional loungers line the pool's edge, turning the space into a sun-washed tableau of glamour and ease. This refresh is not a reinvention. It's a soft exhale — a continuation of the Peninsula story told through layers of light, texture, craftsmanship, and memory. The result is a renewed guest experience that feels timeless, feminine, and serenely luxurious. It is still, unmistakably, The Peninsula Beverly Hills — only now, its beauty glows a little brighter."
    },
    {
      "source_id": "src_townandcountry_2025",
      "publication": "Town & Country",
      "title": "The Best Room at... The Peninsula Beverly Hills",
      "url": "https://www.townandcountrymag.com/leisure/travel-guide/a69497091/peninsula-beverly-hills-review/",
      "published_at": "2025-12-14",
      "trust_level": "editorial",
      "content": "The Renaissance-style villa offers an unexpected home just a few blocks away from Rodeo Drive. The hotel has become somewhat of a refuge for visitors who value privacy and friendly faces. During recent wildfires, evacuated residents arrived with pets in tow and found staff ready to help without hesitation. Its low-rise layout and quiet corners create a softer, cozier presence than its neighbors, and that atmosphere shapes an experience that feels consistent rather than hurried, or worse, fake. Employees typically stay on board for decades, guests often come back season after season. The Peninsula Beverly Hills hosts 195 guest rooms, including 38 suites and 18 private villas. Comfort and utility guide nearly every choice on the property. From the custom-made Sealy mattresses to private terraces shaded by palm trees, the residential-style suites offer a surprisingly calm refuge in the heart of Beverly Hills. Here, Offer Nissenbaum, the managing director of the Peninsula Beverly Hills, told T&C all about the best room on the property. My two favorite suites are very different from each other. I love the Garden Terrace Suite, which is a more intimate and smaller suite with a beautiful outdoor area that feels private and residential. I also love the Royal Patio Suite. It is an all-white suite with a very large terrace and has the relaxed feeling of a home. Those two rooms capture the way I want guests to feel when they stay here."
    }
  ]
}