{
  "place_slug": "tire-shop-taqueria",
  "sources": [
    {
      "source_id": "src_theinfatuation_2022",
      "publication": "The Infatuation",
      "title": "Tire Shop Taqueria - Review - Historic South Central - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/tire-shop-taqueria",
      "published_at": "2022-01-21",
      "trust_level": "editorial",
      "content": "There are plenty of parking lots in LA where you can pick up a solid order of tacos, but few run as smoothly as Tire Shop Taqueria. The operation at this takeout-only taco spot in South LA involves multiple tents divided into stations for making hand-pressed corn tortillas, grilling carne asada, chopping chorizo, and scooping toppings. While standing in line, you'll inevitably breathe in whiffs of lime juice, charred beef, fresh tomatoes, and fried cheese coming from Tire Shop Taqueria's outdoor kitchen. The experience can be mesmerizing, but actually eating the tacos here is even more incredible.\n\nTire Shop Taqueria makes some of the best carne asada tacos we've ever had–they've got a perfect balance of smoky flavor from the charred edges and richness from the marinade. Each bite involves a mouthful of juicy steak, topped with fresh cilantro, chopped onions, spicy salsa, and a massive glob of guacamole, all wrapped in a corn tortilla that's still warm from the skillet it was made in.\n\nSurprisingly, the tacos aren't our favorite thing about this South LA institution. It's the fact that Tire Shop Taqueria isn't its actual name–people just call it that still because it's in the parking lot of a used tire store. Its official name is Taqueria San Miguel, but no matter how you refer to it, the long lines at this tiny stand should tell you all you need to know about that asada. Trust us, it's worth the wait. Juicy, tender, and marinated to perfection, the carne asada in these tacos will change your perspective on grilled meat. We like it best in the tacos, but you can also order it in a quesadilla, mulita, or whatever other tortilla-wrapped dish your steak-loving heart desires.\n\nIf you're looking for something other than juicy steak to order in your taco, their spicy chorizo is next best thing. We highly recommend you hydrate during your meal, and thankfully, Tire Shop Taqueria always has options like fresh horchata or aguas frescas."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Tire Shop Taqueria | Restaurants in South LA, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/tire-shop-taqueria",
      "published_at": "2025-05-31",
      "trust_level": "editorial",
      "content": "This South L.A. institution slings Tijuana-style tacos absolutely dripping with avocado salsa—and now, you can also find the same excellent tacos at Tire Shop's sibling spot, Tacos Los Poblanos, further down Avalon Boulevard. Like most Tijuana-style taco joints, Tire Shop and Los Poblanos keep it simple with six different mesquite-grilled meats that derive flavor and texture from the smoky char. I particularly enjoy the carne asada and al pastor here. The kicker? Tortillas are made to order, then folded into little paper-wrapped cones that ooze the creamy green salsa out of one end. Of course I'm also partial to the freshly grilled chorizo and the complimentary charred onions and peppers, and the massive mulitas and, well, everything. Make your way through the line, grab your plate and take a seat at one of the large plastic tables."
    },
    {
      "source_id": "src_food52_2019",
      "publication": "Food52",
      "title": "My Favorite Tacos in LA Are in the Parking Lot of a Tire Shop",
      "url": "https://food52.com/story/24012-best-tacos-in-los-angeles-tire-shop-taqueria",
      "published_at": "2019-04-08",
      "trust_level": "editorial",
      "content": "Tire Shop Taqueria is a bustling operation that sets up shop in the parking lot across from a used tire store in South Los Angeles. They make their own tortillas from scratch all night long, and Tijuana-style carne asada is grilled over real mesquite coals. The words \"Tire Shop Taqueria\" don't actually exist anywhere on the premises; it's just the name that ended up sticking, by word of mouth, to this humble and ambitious operation.\n\nYou've found the place when you see the line of eager customers snaking toward gentle wafts of smoke from the tented outdoor kitchen. The line moves quickly and the energy is high: Masa is rapidly being pressed into discs and cooked on a flattop to form new tortillas, while meat is constantly being flipped and rotated on the fiery grill. The cooks responsible for Tire Shop Taqueria are lightning-fast. If they took over the operations at your local DMV, the line would move fives times faster, guaranteed.\n\nEverything moves so quickly that ordering can feel stressful if it's your first time, especially because most people waiting in line are return customers who already know what they want, and the small menu on display contains almost no information whatsoever. You don't want to hold up the line behind you, so the first lesson to learn is that if anyone asks you, \"Con todo?\"—your answer should be a quick, resounding \"Yes!\" (This means \"with everything\" and ensures that your taco comes topped with diced raw onion, fresh cilantro, a little splash of red salsa, and a generous dollop of creamy avocado salsa.) The hardest decision at Tire Shop Taqueria is choosing between carne asada and chorizo.\n\nThere are a few more items on the limited menu, including quesadillas and mulitas. It's always tempting to satisfy your curiosity by trying something else on the menu, but the standout items at Tire Shop Taqueria are truly the tacos and vampiros. For what it's worth, the quesadillas and mulitas are basically the same thing: an extra large tortilla, filled with melted cheese and the meat of your choice, con todo. The only difference is that a quesadilla is one tortilla folded over onto itself, and a mulita is two tortillas pressed on top of each other to create a sandwich of sorts."
    }
  ]
}