{
  "place_slug": "tsubaki",
  "sources": [
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Tsubaki – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/tsubaki",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "First things first: Tsubaki is not a sushiya. Barring a lovely plate of sashimi (kanpachi), the menu at this delicious Japanese gem is comprised of classic izakaya food. Think fluffy whipped miso tofu, topped with marinated cherry tomatoes and pickled scallion kimchi; Salmon Creek Farm pork shumai with braised bacon dashi; and tender grilled chicken \"oysters\" kicked up with yuzu kosho. Dishes are meant to be shared and paired with beer or sake. Beverage lovers will thrill to the excellent selection of local craft and distilled sake—and they'll also get to choose their own cups to enjoy these sips. Reservations and use of the restaurant's valet are highly recommended, especially in the summer when nearby Dodger Stadium is stormed with traffic."
    },
    {
      "source_id": "src_resy_2024",
      "publication": "Resy",
      "title": "Tsubaki is the Perfect Los Angeles Restaurant For Visitors (and Locals)",
      "url": "https://blog.resy.com/2024/07/tsubaki-los-angeles/",
      "published_at": "2024-07-09",
      "trust_level": "editorial",
      "content": "When my boyfriend's teenage sister came to visit us in L.A. last winter, she had one request: to eat well. Naturally, I was excited to introduce her to the many culinary wonders of our city — the crispy watercress salad at Jitlada, burritos at Sonoratown, and uni nigiri at Echigo. It was also imperative, in my book, that we take her to Tsubaki, my go-to restaurant for impressing out-of-town guests. As our party of three ate our way through a Japanese Caesar salad, sweet potato and sprouting cauliflower tempura, charcoal-grilled prawns, pork jowl skewers, chicken oysters dolloped with yuzu kosho, and garlic crab fried rice, I watched as Yaffa's eyes lit up with each bite. Tsubaki is Japanese, but in contrast to the many hushed sushi counters, it's izakaya-style, meaning you're encouraged to chatter away, share, and zip across the menu of raw, steamed, and grilled snacks alongside plenty of sake. It's also distinctly influenced by Los Angeles itself. Chef Charles Namba sources his seasonal vegetables from the farmers' market and his pork from local favorite Peads & Barnetts. And while Tsubaki's minimalist, serene interior nods to a Japanese aesthetic, it feels like a cool-coded Eastside spot, too, with its pops of royal blue, exposed brick walls, and a sceney outdoor seating setup. More than anything else, the reason I put Tsubaki on a pedestal is because the food is consistently spectacular, and so is the sake list. I have never had a bad meal there — not even a subpar dish. In a town full of good salads, Tsubaki's Japanese Caesar, with frilly lettuces tossed in panko and creamy miso dressing, topped with a snowdrift of shredded bonito and nori, is my favorite. The chef's selection of sashimi never fails to showcase what's fresh and good. Everything skewered and/or grilled is phenomenal, from crispy-skinned branzino to snappy chicken gizzards. And the hojicha soft serve parfait with sesame-miso caramel and candied red walnuts — toasty, creamy, and laden with umami — is a showstopper of a dessert. Izakayas are abundant in Los Angeles, particularly as you head south toward Gardena and Torrance. Unlike most of them, however, which traffic in standard-issue fare, Tsubaki's food registers as completely its own. Namba puts his own spin on dishes like potato pancakes, which he calls latkes and pairs with dry-aged salmon and yuzu-scallion crème fraîche; and adds pork ragù and fermented chile-and-bean paste to his yakisoba to make it more dan dan-esque. And then, there is co-owner (and Namba's real-life partner) Courtney Kaplan's sake list, which plays a huge part in Tsubaki's charm. It's divided into sections like fruity, funky, and seasonal, and includes detailed descriptors to make it easy to find something you'll like. Kaplan is a sake savant and there's simply nowhere better to drink sake in this town, save for Tsubaki's next-door sake bar, Ototo, which recently picked up a James Beard Award for Outstanding Wine & Other Beverages. The icing on the cake is Tsubaki's location: tucked off of the scrum of Sunset Boulevard, but within spitting distance of a highly walkable stretch of Echo Park. You could bring your parents to El Prado before, bless your friends with second dessert at Quarter Sheets afterwards, or post up next door at The Douglas for a nightcap. Or just finish with the hojicha parfait, a sweet ending to a perfectly Los Angeles night."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Tsubaki - Review - Echo Park - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/tsubaki",
      "published_at": "2025-05-03",
      "trust_level": "editorial",
      "content": "Located in a half-indoor, half-outdoor space in Echo Park next to their sibling sake bar Ototo, this izakaya works best for one-on-one interactions. Seating is limited and things can get quite expensive quickly. And as you'd expect from a restaurant connected to a sake bar, there are plenty of drink options. In fact, you'll receive an entire booklet full of them. There are super crisp brews from Osaka, bottles covered in disco gold, and glasses filled to the brim with tart plum wine. You'll probably have questions (that's normal), and Tsubaki's waitstaff is there to help. Portions are small, mostly designed for one or two people. And after a few rounds of sake, you'll likely come out to $100 a person. But there's a deftness here, a skill level, you won't find at many other places in town. Nothing is in your face (like Gary Oldman covered in prosthetics and patches of green screen). It's all very subtle. Unlike traditional izakayas, which are usually so smoke-filled they should come with a warning, the dining room here is cozy and inviting. We've tested a million different configurations at Tsubaki—big groups, small groups, meals with our boyfriend's parents—and the consensus is: this is a date spot. Which doesn't necessarily mean romance. As the Greeks once said, there are many different types of love (friendship, family, the joy of living), and Tsubaki understands this truth as well. But if you plan accordingly, you'll eat some of the best Japanese food in the city. A quick glance at the menu, and it's clear yakitori is the star. Japanese skewers come in pairs of two, made with everything from chicken wings, koji-marinated pork loin, and blue prawns slathered in butter to chicken gizzards, hearts, and cartilage."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Tsubaki | Restaurants in Echo Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/tsubaki",
      "published_at": "2025-10-24",
      "trust_level": "editorial",
      "content": "It wasn't until after I experienced the glaring inconsistencies of Venice's RVR that I've come to truly appreciate the chef-driven approach of Charles Namba's California-style izakaya in Echo Park. The seasonal inflection to traditional izakaya fare adds enough intrigue to warrant a visit the next time you're in the general area, especially if you enjoy kushiyaki. The vegetable tempura and skillful spin on silken tofu from Gardena's Meiji Tofu stand toe to toe with homier spots in the South Bay; the charcoal-grilled onigiri and soy-simmered black cod make for an excellent sit-down meal; and who can deny the delight of a Japanese \"latke\" topped with dry-aged salmon, pickled cucumbers and ikura? For more of a deep-fried snacky situation, I prefer OTOTO next door, which serves chicken karaage, heartier versions of tempura and a potato salad perfect for soaking up sommelier Courtney Kaplan's award-winning sake program. Order the cornflake-dusted hojicha parfait for dessert—or at least the slightly cheaper standalone soft-serve."
    }
  ]
}