{
  "place_slug": "villas-tacos",
  "sources": [
    {
      "source_id": "src_michelin_2024",
      "publication": "Michelin Guide",
      "title": "Chef Victor Villa Goes From Humble Street Eats to a Bib Gourmand",
      "url": "https://guide.michelin.com/us/en/article/features/los-angeles-tacos-villas-tacos-michelin-guide",
      "published_at": "2024-01-23",
      "trust_level": "editorial",
      "content": "Tucked away in the corner of a small, unassuming strip mall in Los Angeles' Highland Park neighborhood, Villa's Tacos is quickly making a name for itself. The spot opened about a year ago, in February 2023, and in less than six months, it received a Michelin Bib Gourmand. It's not hard to see why. When I drove up to the restaurant at 3pm the day before New Year's Eve – a bit late for lunch and early for dinner – there was a line out the door, but the incredible smells and buzzing line indicated that the wait would be worth it. I quickly felt at home after being greeted by upbeat employees and a bright neon sign featuring a smiling walking taco wearing a Dodgers hat. Under the glowing sign, employees poured homemade cucumber-lime agua fresca, squeezed fresh lemon juice and cut ripe avocados for guacamole. Chef Victor Villa tied the whole experience together, walking down the line of customers and fist-bumping each and every hungry and eager guest as they anticipated the culinary experience ahead of them. While Villa's Tacos now has a beloved and thriving storefront, it took Chef Victor four years of street vending – and selling pickup orders from his grandma's backyard during the pandemic – to get to where he is today, and he doesn't take it for granted. In fact, he's gone out of his way to create a unique culture for both his staff and diners, setting the groundwork for a fun and unique environment in a particularly small space that only has outdoor seating. While you're waiting in line, be sure to soak in the sights and sounds. As lively music plays through the speakers, you'll spot a collage of beaming customers enjoying their tacos, an impressive salsa and toppings bar, a refrigerator with drinks and a merch section lining the front window. Villa's Tacos has an impressively simple yet creative menu that includes vegan options like a grilled \"soyrizo\" taco with pineapple and onion and a signature queso taco with onion, cilantro, guacamole, Cotija cheese and crema Mexicana. \"The salsa bar had to be vibrant. It had to be fresh,\" Villa said. \"My dad would always tell me growing up, if you go to a restaurant and their salsa isn't good, chances are the tacos aren't going to be good,\" he added. \"But if you go to a restaurant, and the salsa is on fire – it's delicious, it's smoky, it's everything you want in a salsa – then chances are, the food's going to be delicious.\" Chef Victor says he doesn't believe in shortcuts, and it's paying off. \"I started with the goal to make the best taco I could possibly make – and that's exactly what I did,\" he said, adding that both the food and his staff are improving every day. \"Every day, we get a little better and better,\" he said. \"And thank God, there's more and more people coming.\""
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Villa's Tacos – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/villa-s-tacos",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Sweet smoke from a roadside taco stand blows across the Highland Park parking lot, but the crowd gathered in front of Chef Victor Villa's taqueria doesn't budge. This brick-and-mortar marks a milestone for a chef who first started serving out of his grandmother's house. The signature queso taco is instantly recognizable, built on a blue corn masa tortilla stacked with refried beans, onion, cilantro, guacamole, cotija cheese, crema and a melted skirt of Monterey Jack. Variations with asada and chorizo are favorites, with vegan options on offer as well. Colorful, messy and filling, these tacos thrive on their own but also sing with the homemade salsas, some of which are ferociously spicy. Seating is limited to a few picnic tables outside."
    },
    {
      "source_id": "src_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Villa's Tacos - Review - Highland Park - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/villas-tacos",
      "published_at": "2024-07-17",
      "trust_level": "editorial",
      "content": "This Highland Park taquería takes a more-is-more approach with fully loaded tacos. Each one comes on a Dodger-blue corn tortilla layered with crispy griddled cheese, diced onions, cilantro, crema, cotija, guacamole, and a mesquite-grilled protein of your choice. (Oh, and the option to add seven different salsas and hibiscus-pickled onions, too.) If this sounds like a messy mountain to you, you're not incorrect. But it's a mess worth making. Order the Villa's Trio, a cheesy, three-taco sampler that includes grilled asada, chorizo with potato, and chicken with black beans."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Villa's Tacos | Restaurants in Highland Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/villas-tacos",
      "published_at": "2025-05-31",
      "trust_level": "editorial",
      "content": "After years of popping up around Highland Park, Victor Villa has brought his critically acclaimed blue corn tortillas to three storefronts: The original strip mall outpost along Figueroa, a stall within Downtown's Grand Central Market and a third location on Figueroa serving Baja-inspired mariscos. While I wouldn't go out of the way for Villa's Tacos #3, which offers serviceable fish tacos and a market-priced gourmet taco made with A5 Wagyu, the original \"tacos estilo Los Angeles\" served at 5455 North Figueroa and inside Grand Central Market are some of the most unique tacos in the city. Each regular taco ($3.50) consists of finely chopped meats, which you can top with seven different salsas as well as excellent guacamole, which is never extra(!). Most people opt for the quesotacos ($4.50 apiece)—think charred, crispy Monterey Jack soldered to each handmade tortilla, drizzles of fresh snow white crema and a shower of cotija cheese. Three solid vegan taco options further broaden the appeal of Villa's cooking, but the first-timer's go-to order is usually the sampler trio of quesotacos. Lines here usually form early, but these tacos are worth the wait."
    },
    {
      "source_id": "src_eastsider_2023",
      "publication": "The Eastsider LA",
      "title": "Tacos worth waiting for at Villa's Tacos in Highland Park",
      "url": "https://www.theeastsiderla.com/neighborhoods/highland_park/tacos-worth-waiting-for-now-serving-at-villas-tacos-in-highland-park/article_ecbb308a-8f04-11ee-8c89-17611b9e350d.html",
      "published_at": "2023-11-30",
      "trust_level": "editorial",
      "content": "Highland Park -- There are culinary experiences where Being There is arguably more important than Eating There. This may sound downright perverse – heck, it is downright perverse. I have a friend who's traveled around the country, going to ballparks to eat the hot dogs. Were they good hot dogs? It doesn't matter – he gets bragging rights from it. And then, there's the line for Villa's Tacos in Highland Park. It was a rainy day – which just added to the fun. Every now and then, Victor Villa, the gregarious owner would come out to take a cellphone photo of the Taco Acolytes, who'd flash thumbs up, or victory signs. The photos are displayed on the counter at Villa's, and will be a highlight of the new Villa's at the Downtown Grand Central Market. All agree that the Michelin Bib Gourmand plaudit was well earned. It's easiest to choose one of the \"Specialty Sampler Trios\" – \"Don't Know Where to Start?\" asks the menu. The Vegan Trio comes with beans with nopal, beans with potatoes, and soyrizo with potatoes. I much prefer Villa's Trio – a trio of queso tacos with ranchera asada (beef flap steak), chorizo with potatoes, and chicken with black beans. The queso taco is a wonder, with its crusty edge of melted cheese, an unabashed addiction. There are seven salsas, that you get from a nearby counter, putting as much as you can into small plastic salsa containers. There are picnic tables in front, that always seem full of family groups. They're the best place to eat the tacos, which get a little mushy on the way home, thanks to the guacamole and crema Mexicana layered on top."
    }
  ]
}