{
  "place_slug": "walts-bar",
  "sources": [
    {
      "source_id": "src_infatuation_2018",
      "publication": "The Infatuation",
      "title": "Walt's Bar - Review - Eagle Rock - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/walts-bar",
      "published_at": "2018-02-28",
      "trust_level": "editorial",
      "content": "Despite all the bar action that's been happening in Highland Park these days, its next-door neighbor Eagle Rock has been a bit slow on the uptake. But Walt's Bar is here to change that. The new neighborhood spot calls itself an arcade bar, but good news - it's not an arcade bar. It's a retro dive with a row of pinball machines in the back. There's also a great crowd that's down to get rowdy, a popcorn machine that takes quarters, and a late-night food menu that reads like the concessions at a middle school basketball game.\n\nUnrated: This is a restaurant we want to re-visit before rating, or it's a coffee shop, bar, or dessert shop. We only rate spots where you can eat a full meal."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out",
      "title": "Walt's Bar | Bars in Eagle Rock, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/walts-bar",
      "published_at": "2025-03-02",
      "trust_level": "editorial",
      "content": "What happens when a dive bar meets pinball meets meticulous throwback touches? You get Walt's Bar, Eagle Rock's very own pinball bar serving California beer and wine, with pretzels, hot dogs, chips and hot nuts. Stop by on Wednesdays for tournament nights, and don't forget to bring some cash; while there's a change machine, it only takes $1s and $5s. The mood is casual and the vibe is immaculate, and there's almost nowhere in Northeast Los Angeles I'd rather haunt for a glass of beer and a giant pretzel. Hot dogs, vegan dogs and chips are all on offer, too. The casual atmosphere translates into a locals-heavy crowd and plenty of folks with dogs—so if you want a chill place to drink and bring Fido that isn't a rowdy, ultra-crowded brewery, Walt's is one of the best bets in town."
    },
    {
      "source_id": "src_timeout_2018",
      "publication": "Time Out",
      "title": "Walt's Bar is Eagle Rock's new retro-fabulous pinball bar",
      "url": "https://www.timeout.com/los-angeles/news/walts-bar-is-eagle-rocks-new-retro-fabulous-pinball-bar-022018",
      "published_at": "2018-02-21",
      "trust_level": "editorial",
      "content": "Grab your singles, your fives and as many quarters as you can wrangle from between the cushions because Eagle Rock's new pinball and arcade throwback of a neighborhood bar is now open. You'll recognize Walt's Bar by the rainbow of letters spelling \"PINBALL!\" and a few more hand-painted signs yelling \"FINE WINE\" and \"HOT DOGS,\" which is truly all anyone should need to get sucked into a bar, but absolutely not all there is to know about this spot. The space that's previously stood as an ice cream parlor, a Scandinavian home-goods store and an auto-parts shop now sports wood-paneled walls, a taxidermied raccoon, 10 or so pinball machines, a slick orange-colored bar, German pretzels, a high-scores bulletin board, hot dogs, a patio, chips, 11 beers—most of them on draft and local—plus a handful of wines all from California, with the exception of a French rosé. They're also some of the dearest to the owners' hearts—it's what you get, after all, when you grow up tinkering with '60s and '70s machines as brothers Jeff and Brad Johnsen did. The second cabinet in is a '60s gem, Surf Champ, and it's been in the Johnsen family ever since their father Walt brought it home from a yard sale. He's now the Eagle Rock bar's namesake, and his purchase is what kicked off a lifetime of pinball curiosity for both of his sons, eventually leading Brad to open Add-a-Ball in Seattle with friend Travis Echert. Echert and both Johnsen boys went in on Walt's Bar, which opened on Friday night and offers Northeast L.A. pinball, beer and snacks from 11am til 2am every single day. Most cabinets will set you back 50 cents per play—don't worry, there's a change machine for ones and fives—while the EMs only cost a quarter."
    },
    {
      "source_id": "src_infatuation_2023",
      "publication": "The Infatuation",
      "title": "The 25 Best Bars On The Eastside",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-eastside-bar-guide",
      "published_at": "2023-03-08",
      "trust_level": "editorial",
      "content": "Walt's Bar in Eagle Rock calls itself an arcade bar, but good news––it's not an arcade bar. Instead, it's a retro dive that wouldn't look out of place on a beach boardwalk, with a menu full of craft beers and bar food classics like hot dogs and pretzels with a beer cheese dipping sauce."
    },
    {
      "source_id": "src_infatuation_2024",
      "publication": "The Infatuation",
      "title": "The 20 Best LA Bars With Activities",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-la-bars-with-activities",
      "published_at": "2024-02-06",
      "trust_level": "editorial",
      "content": "Walt's Bar in Eagle Rock bills itself as an arcade bar, but it's really just an excellent local dive bar that happens to have a whole bunch of pinball machines."
    },
    {
      "source_id": "src_infatuation_2018",
      "publication": "The Infatuation",
      "title": "13 LA Bars You Aren't Completely Sick Of Yet",
      "url": "https://www.theinfatuation.com/los-angeles/guides/cool-bars-la-you-arent-sick-of",
      "published_at": "2018-10-05",
      "trust_level": "editorial",
      "content": "The gimmick of arcade bars has long worn off. At this point, you'd rather just sit in a bar and talk to your friends instead of germ-swapping with strangers all night while taking turns with the Space Invaders game. Here's the good news - Walt's Bar is not an arcade bar. It's a retro wine and beer bar that also happens to have a row of pinball machines in the back if the wind (read: alcohol) moves you to play a little. The crowd is local and low-key, and if you get hungry, there's a popcorn machine that costs a quarter."
    }
  ]
}