{
  "place_slug": "wine-stop-ecpk",
  "sources": [
    {
      "source_id": "src_voyage_la_2018",
      "publication": "Voyage LA Magazine",
      "title": "Meet Alvaro Cardenas of Wine Stop in Downtown",
      "url": "http://voyagela.com/interview/meet-alvaro-cardenas-wine-stop-downtown/",
      "published_at": "2018-04-07",
      "trust_level": "editorial",
      "content": "Today we'd like to introduce you to Alvaro Cardenas. Alvaro, let's start with your story. We'd love to hear how you got started and how the journey has been so far. I started working part-time at J K Imports, a boutique wine importing company in Pasadena back in 1994. I was translating (Italian-English) for the importer (James Koch) since he was just starting to add Italian Wines to his portfolio. After a few months, I started doing some office work (filing, invoicing, delivering, etc.). A year into the job, I started to taste wines and after a couple of years, I was confident enough to start selling wines to restaurants and shops. After graduating from college, I joined J K Imports full time, at the same time, I took the first Guild Of Sommeliers test. Being at J K Imports for over 20 years has exposed me to a vast number of wines, wineries, wine regions, wine producing countries and an even greater number of experiences that I have taken with me and have applied at my very own project. Wine Stop is a modern take on a traditional wine shop. We offer unique, delicious and affordable wines only available at Wine Stop. Because of our close relationship with J K Imports, we are able to source everything directly from the wineries which are mostly European. The wines are truly coming from the vineyard to the shelf, passing the savings along to our customers. We are very proud to be offering traditional wines, that truly represent the land and the people where they come from. LA is a fantastic city for wine! There is a huge hunger for knowledge about wine. Most of our customers are excited to try something new and that's when Wine Stop comes in, we have a large selection of unique, interesting and delicious wines."
    }
  ]
}