{
  "place_slug": "yamashiro-gardens",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Yamashiro - Review - Hollywood - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/yamashiro-hollywood",
      "published_at": "2025-10-15",
      "trust_level": "editorial",
      "content": "Located on a hilltop overlooking Hollywood, Yamashiro is a straight-up classic, with views of LA most restaurants only dream about. The 100-year-old Japanese restaurant is massive and admittedly a bit over the top, but you won't care."
    },
    {
      "source_id": "src_timeout_2016",
      "publication": "Time Out LA",
      "title": "Yamashiro | Restaurants in Hollywood, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/yamashiro",
      "published_at": "2016-07-29",
      "trust_level": "editorial",
      "content": "Built as a private art museum in the 1920s, this Japanese palace is a spectacular structure with extraordinary views of Hollywood. For years, it was a beautiful building in which to eat bad food, but Jason Park's new kitchen team has made a major difference: the restaurant is now worth a look even if you don't get a table with a view. Japanese, Korean and Chinese traditional items are presented alongside sensible and occasionally daring fusion ideas. Main courses $32."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "15 LA Restaurants With Great Views - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-restaurants-with-views-la",
      "published_at": "2024-05-31",
      "trust_level": "editorial",
      "content": "Located on a hilltop overlooking Hollywood, Yamashiro is an LA classic, with picturesque views of LA that most restaurants can only dream about. The 100-year-old Japanese restaurant is admittedly a bit over the top, but that's exactly why you came here. The menu received a big overhaul a few years ago (which was very needed), and if you're considering another round of those Zen Garden Martinis, the answer is always yes."
    },
    {
      "source_id": "src_theinfatuation_2021",
      "publication": "The Infatuation",
      "title": "The Most Unique Patios In LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/unique-patios-in-la",
      "published_at": "2021-02-20",
      "trust_level": "editorial",
      "content": "In addition to birds-eye views of the city, enclosed tent covers, and lots of heat lamps, Yamashiro also serves dishes like soy ginger pork rib, pork dumplings, skewered yakitori, and hibachi pineapple fried rice."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "The 16 Best Old Hollywood Restaurants - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/classic-los-angeles-old-hollywood-restaurants",
      "published_at": "2024-12-12",
      "trust_level": "editorial",
      "content": "If eating dinner in an over-the-top replica of a Japanese palace, complete with courtyards, a 600-year-old pagoda in the garden, and giant fishbowl cocktails, sounds like something you'd... 16 classic spots indelibly tied to the golden age of tinseltown."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "20 LA Restaurants We're Pretty Sure Are Haunted",
      "url": "https://www.theinfatuation.com/los-angeles/guides/haunted-restaurants-los-angeles",
      "published_at": "2025-10-16",
      "trust_level": "editorial",
      "content": "Built as a private residence in 1914 and converted into its current form in 1960, Yamashiro is a massive Japanese restaurant overlooking Hollywood, and a place where ghosts can truly stretch their legs (the 600-year-old pagoda on the grounds probably helps). The decor is admittedly pretty gaudy, and the food isn't much better than anything you'd find at Tao, but at the end of the day, a tacky ghost is a fun ghost. So order a lychee martini and an oversauced sushi roll and join the party."
    }
  ]
}