{
  "place_slug": "yang-chow-restaurant",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Yang Chow - Review - Chinatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/yang-chow-restaurant",
      "published_at": "2025-03-08",
      "trust_level": "editorial",
      "content": "If there's one constant in Chinatown over the last five decades, it's the people crowding the sidewalk on Broadway outside Yang Chow on the weekends. The main attractions are the namesake fried rice and the slippery shrimp—crispy morsels of tangy, peppery crustacean so good that the staff wears shirts telling you to order them. And while those two things are the foundation of any meal here, almost everything on the classic American Chinese menu is good. Plenty of people get takeout, too, but they line up to dine in because the dining room is a portal to a bygone era complete with '70s-style carpet and upholstery and photos of old celebrity guests lining the walls. Yang Chow even has surprisingly strong—and reasonably priced—cocktails, so you can sip a mai tai or lychee martini while you wait for that pile of golden (well, orangey) shrimp to hit the table.\n\nThe noodles at Yang Chow are a bit one-dimensional, but if you really want them, go for the pan-fried kind, slathered with gravy so that the crispy noodles soften as they absorb the liquid, instead of the lo mein. This dish is so popular that Yang Chow used to give diners a postcard for how to make it at home. Which feels like bragging, because you'll never make it as good as they do here—this combo of ketchup, cayenne, and vinegar is something like alchemy. The limp presentation of this usually flamboyant dish makes us think the crispy rice hasn't seen an actual sizzle since M.A.S.H. went off the air. But it's hard to complain about a little bowl of shrimp, chicken, and bamboo shoots floating in chicken broth. This vegetable dish is as filling as any meat entree, with giant shiitakes and whole bulbs of baby bok choy so shiny they look like they just came back from the spa. If there's any dish that tastes exactly like it should, it's this shrimp and pork fried rice: lightly seasoned, eggy, and covered with a thin veneer of oil. This lands at the table as four large, already-prepared burrito-sized rolls."
    },
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "15 Classic Chinese Restaurants In LA's Chinatown",
      "url": "https://www.theinfatuation.com/los-angeles/guides/classic-chinese-restaurants-los-angeles-chinatown",
      "published_at": "2023-01-20",
      "trust_level": "editorial",
      "content": "After leaving Hong Kong in 1977, five brothers opened Yang Chow, a Mandarin and Sichuan-style restaurant named after their hometown. At the time, it existed below the Bing Wong Hotel, and was a casual, communal place where families could gather over lazy susans loaded with shrimp toast, egg drop soup, and pan-fried noodles. Over the next 40 years, Yang Chow expanded to two other locations (Pasadena and Long Beach) and has become renowned for their slippery shrimp."
    },
    {
      "source_id": "src_timeout_la_2016",
      "publication": "Time Out LA",
      "title": "Yang Chow | Restaurants in Chinatown, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/yang-chow",
      "published_at": "2016-06-01",
      "trust_level": "editorial",
      "content": "For a casual, no-frills approach to Chinese cuisine (and delicious deep-fried shrimp), look no further than this family-owned restaurant that's faithfully served Chinatown for over forty years. Though it boasts two other outposts in Long Beach and Pasadena, the unassuming North Broadway eatery is where the Yun family first began offering a mix of Mandarin and Sichuan specialties with plenty of Hong Kong-style and Americanized dishes, including their legendary slippery shrimp. When it comes time to order, think egg rolls, lo mein and fried rice—and you'll find the sort of well-executed, comforting old-school Chinese fare perfect for a lazy weekday dinner or takeout."
    },
    {
      "source_id": "src_theinfatuation_2020",
      "publication": "The Infatuation",
      "title": "The Chinatown Takeout & Delivery Guide",
      "url": "https://www.theinfatuation.com/los-angeles/guides/chinatown-la-takeout-delivery-best",
      "published_at": "2020-09-08",
      "trust_level": "editorial",
      "content": "Open since 1977, Yang Chow is a classic Chinatown restaurant known for dishes like garlic eggplant, cold sesame noodles, and its famous slippery shrimp - an original dish consisting of deep fried shrimp in a"
    }
  ]
}