{
  "place_slug": "zankou-chicken",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Zankou Chicken - Review - Hollywood - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/zankou-chicken",
      "published_at": "2025-05-03",
      "trust_level": "editorial",
      "content": "Zankou is quick, cheap, sorta healthy, and very satisfying. Regardless of where you fall on the sobriety scale when entering, you're gonna find a shawarma wrap that hits the spot every time. As with almost everything at Zankou, you can either get this in a wrap or as a plate. The wrap is good for a midday situation, but the plate is where you can really sit down and let yourself go. Either way, you're still getting the same great chicken that's been twirling on skewers all day just for you. Even though chicken is king at Zankou, don't skip over their tri-tip. USDA choice cut (or something like that), this is melt-in-your-mouth goodness. A whole chicken? Really? Yes, really. For $17 you get a fantastic rotisserie chicken, pita bread, and all the sauces in the world. The chicken will last you for a few days, making it one of the economically sound choices for stoners in town. There are entire restaurants dedicated to the falafel in this town that do it much better than Zankou. But is it still good? Yes. And you should order them anyways."
    },
    {
      "source_id": "src_timeout_la_2016",
      "publication": "Time Out LA",
      "title": "Zankou Chicken | Restaurants in Hollywood, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/zankou-chicken",
      "published_at": "2016-09-22",
      "trust_level": "editorial",
      "content": "Zankou Chicken has a strong cult following in L.A. With locations dotting the county (and one in Anaheim), there's a chance you'll be able to find the Mediterranean chain in your vicinity when the craving for Zankou's rotisserie chicken hits. The tender chicken can be enjoyed on plates, wraps, skewers or as one giant, half-rotisserie chicken, but there's also shawerma, falafel and a few vegan salads. Whatever you order, be sure to stock up on Zankou's garlic sauce, which has inspired many imitations throughout the years—though none come close to the original."
    },
    {
      "source_id": "src_thetakeout_2023",
      "publication": "The Takeout",
      "title": "Why Zankou Chicken Should Go National, And Why It Most Definitely Won't",
      "url": "https://www.thetakeout.com/zankou-chicken-los-angeles-best-middle-eastern-menu-1849955228/",
      "published_at": "2023-01-06",
      "trust_level": "editorial",
      "content": "Zankou Chicken is the most beloved Middle Eastern food in Los Angeles, a lighthouse of sorts to Angelenos. As soon as you see one, you're immediately grounded by its familiarity. Zankou touts 'delicious mediterranean food made simply,' and while it does certainly read simple, there's a little extra something in many of Zankou's offerings that keeps you coming back. Shawerma is its specialty, as are its marinated chicken Tarna (to which it owns the trademark), falafel, both lule and chicken kabobs, hummus, and tahini, each with amazing textures and bursts of flavor you aren't getting from your average Middle Eastern combo plate. The combo plates, by the way, hover around $15, and most wraps fall under $10—not bad for a sandwich in Los Angeles. At Zankou you're somehow getting absurd quality from a fast-casual chain. It's well documented how good Zankou's garlic sauce is. Zankou's stings of garlic and lemon, but still beams with freshness. It's a shame that anything (not to mention something so tragic) kept this place from expanding, because the food does taste quite different from your average shawerma and pita joint. Zankou is full of bold flavor, refreshing nuance, and dope technique that just isn't happening everywhere, and it has what other fast-casual spots don't: deep history, character, and personality."
    }
  ]
}