{
  "place_slug": "all-time",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "All Time makes simple food shine—at any time of day",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/all-time",
      "published_at": "2025-10-02",
      "trust_level": "editorial",
      "content": "Then there's All Time, a quirky Los Feliz spot that's been so popular for so long, it's developed its own cultural ecosystem: A meeting ground where former BFAs come to discuss ceramics class, point out Charlie Day, and brainstorm script ideas while saying things like, \"This Good Ass Salad hiiiiiiits.\" But All Time is more than just a sceney backdrop. It's a place where you can show up at any time of day—breakfast, lunch, or dinner—and eat food that is both excellent and seemingly effortless. A place that feels like being invited over for a rustic backyard meal by your coolest friend, the one who has a design studio in their garage, a strict farmers market hierarchy, and somehow knows how to carve a whole leg of serrano ham.\n\nWho you see at All Time will likely depend on when you show up, which in turn will depend on your employment status and/or how large your sunglasses are.\n\nTo experience All Time at its best, though, go for dinner. They take reservations (lunch is walk-in only), the string-lit patio is conducive to sipping wine and hanging with friends, and the handwritten menu pivots to big platters of roasted vegetables and meats—the kind of uncomplicated cooking that All Time excels at. Here's what an essential order for four looks like: the \"Good Ass Salad\" that more than lives up to its name, burrata toast, the banquet-sized \"Big Steak Event,\" and an order of the seasonal cobbler. The wine list is pricey (bottles start at $80), and everybody complains about it. You'll order some anyway, because it's good, and because you're eating charred broccolini outside in January without a jacket on. Let's not take that for granted.\n\nMost sceney lunch spots in LA have some kind of bowl like this on their menu, a vaguely nutritious hodgepodge of vegetables, proteins, and in-house sauces. All Time's version with crispy rice (that's actually crispy) and hot sauce (that's actually hot) beats the pants off most of them.\n\nWhen All Time opened in 2018, this was the dish that everybody talked about. And they're still talking about it now, because it's still fantastic. Piled high with tomatoes, burrata, basil, and balsamic, it's basically caprese toast and a non-negotiable way to start your meal.\n\nIf you're going to name a bowl of lettuce something as cocky as \"Good Ass Salad,\" it better deliver. This one does. The mix-ins change with the seasons, but two ingredients are constant: the freshest greens from the market, and a punchy lemon dressing that brightens up every bite.\n\nPurists might scoff at a frosting-less cinnamon roll, but pay no mind. This brioche bun is so moist, so sticky, and so cinnamon-filled that you won't notice the absence of anything.\n\nIt doesn't matter what the seasonal fruit is (it's always delicious), or how serious your meat sweats are, dinner here needs to end with this gooey cast-iron cobbler.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_timeout_2020",
      "publication": "Time Out LA",
      "title": "All Time, sometimes: The Los Feliz cafe's new to-go restaurant, Part Time, is now open",
      "url": "https://www.timeout.com/los-angeles/news/all-time-sometimes-the-los-feliz-cafes-new-to-go-restaurant-part-time-is-now-open-012320",
      "published_at": "2020-01-30",
      "trust_level": "editorial",
      "content": "L.A. is already chock full of restaurants, but one thing it feels like we can't get enough of is new quick-service dining—especially when it comes from one of the best cafés in the city. Los Feliz treasure All Time already serves some of our favorite all-day fare, then flips to a romantic and candlelit restaurant in the evening, and this week it's bringing those salads, roast meats and dinner vibes to a new spot down the block at its new rotisserie and to-go venture, Part Time. Think: whole and half rotisserie chickens with choices of sides; porchetta; 12-hour–braised brisket; fresh fish; market vegetables and plenty of comforting baked goods at Part Time, all wrapped up in biodegradable and recyclable packaging and available for pickup and to-go only.\n\nMuch like at All Time, be on the lookout for the long sheet of butcher paper with a handwritten menu each night to see whether you'll be having items like the Japanese sweet potatoes with sour cream and herbs or the mac and cheese bedecked with golden breadcrumbs. You can place orders in person, or ahead of time online, by app or by phone (323-407-6758).\n\nIt's been a busy week for roast birds in the area; just last Wednesday, Kismet launched its own fast-casual rotisserie concept—but again, if there's anything it feels like L.A. can't get enough of, it's new, quality, quick-and-casual dining. Especially when it comes from a trusted team.\n\nPart Time is now open weekdays only from 5 to 9pm at 2044 Hillhurst Ave, available for takeout only."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "15 Best Los Feliz Restaurants for Breakfast, Lunch and Dinner",
      "url": "https://www.timeout.com/los-angeles/restaurants/best-los-feliz-restaurants",
      "published_at": "2025-01-03",
      "trust_level": "editorial",
      "content": "Looking to start your day off on a high note? This all-day Los Feliz cafe serves light, sunshiny breakfast and lunch fare such as avocado toast; eggs on toast; a whipped-feta breakfast sandwich; squash farro and market salads—ideal fare for that spacious wooden patio."
    },
    {
      "source_id": "src_timeout_2018",
      "publication": "Time Out LA",
      "title": "All Time",
      "url": "https://www.timeout.com/los-angeles/restaurants/all-time",
      "published_at": "2018-01-05",
      "trust_level": "editorial",
      "content": "This all-day Los Feliz cafe serves light, sunshiny breakfast and lunch fare such as avocado toast; eggs on toast; a whipped-feta breakfast sandwich; squash farro and market salads—ideal fare for that spacious wooden patio."
    }
  ]
}