{
  "place_slug": "baby-bistro",
  "sources": [
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Review: Baby Bistro serves irreverent California cuisine out of a beautifully restored Victorian bungalow",
      "url": "https://www.timeout.com/los-angeles/news/review-this-chinatown-adjacent-bistro-serves-california-cuisine-out-of-a-beautifully-restored-victorian-bungalow-080625",
      "published_at": "2025-09-24",
      "trust_level": "editorial",
      "content": "In a city of sun-bleached asphalt, minimal shade cover and other hostile urban features, it feels downright heavenly to step into Alpine Courtyard. By day, Angelenos pick up plant-based pastries at Bakers Bench, specialty caffeinated drinks from Heavy Water Coffee and gourmet banchan from Perilla LA. After 4:30pm, when Perilla closes up shop, the only eatery left standing is a satellite outpost of Cassell's Hamburgers, which operates out of the same space as Bakers Bench. Finally, at 5:30pm, Baby Bistro opens its doors, offering veteran chef Miles Thompson's wonderfully unorthodox approach to farm-to-table cooking, a reasonably priced natural wine list by Lolo Wine Bar alum Andy Schwartz, and one of the most delightful restaurant back patios in all of Los Angeles.\n\nChef Miles Thompson delivers cleverly executed seasonal fare at the edge of Downtown L.A. Chef Miles Thompson's bistro delivers cleverly executed, seasonal wine bar fare at the border of Chinatown and Echo Park.\n\nThe narrow, sparsely decorated 35-seat space still feels like the house it once was. In many ways, the restaurant is similar to Tomat in Westchester and Vin Folk in the South Bay; all three eateries serve a more accessible version of chef-driven cuisine at a price point more palatable for weekly date nights and group special-occasion dinners.\n\n\"If you were in Europe, you would stumble into it, have an incredible meal and never remember what it's called and try to figure it out for the rest of your life. That's the idea of this restaurant,\" Thompson told the Los Angeles Times in 2023, describing the concept behind Baby Bistro. Sure, I find that romantic, but the reality is that Baby Bistro isn't located in Europe. It's in one of the most car-centric cities in the United States, where \"stumbling\" (or, for many, driving to a more walkable part of town) is largely premeditated and a semblance of social media and marketing strategy is essential to a new restaurant's success.\n\nFrom the get-go, there's the warm hospitality offered the minute you check in with the host—wait too long for your reservation, and you'll likely be offered a free glass of wine while killing time outside—and pint-sized open kitchen, where Thompson can be found working most nights of service. Though Baby Bistro's six-item menu is ostensibly offered à la carte, the menu is designed to be ordered in its entirety and split between two people (yes, like a tasting menu), which ends up costing somewhere in the neighborhood of $110 per head including sales tax and tip. That price is before drinks get involved.\n\nPersonally, I consider that a little on the pricey side for what is, at the end of the day, mere seasonal wine bar fare, but the endearing bungalow atmosphere more than compensates, and the chef's culinary talent translates into some of the most deliciously irreverent California cuisine in the city. I loved the housemade onion bread, piled high with bright orange Liptauer cheese, and the clever, salt-forward cucumber squid salad, but Thompson lavishes every seasonal dish with the care and attention it deserves. Given the cute atmosphere, however, I'm happy to overlook a few shortcomings and circle the block for parking. Baby Bistro earned four stars—\"great\"—from us."
    },
    {
      "source_id": "src_the_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Baby Bistro's smart seasonal cooking feels at home in a cozy bungalow",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/baby-bistro",
      "published_at": "2025-07-11",
      "trust_level": "editorial",
      "content": "Baby Bistro, nestled in a bungalow on the Chinatown/Echo Park border, makes dinner for two feel like a weekend getaway on the Central Coast. 1027 Alpine St, Los Angeles, CA 90012. $$$$ American. Chinatown.\n\nA cutesy Craftsman on a hilly side street. Low-intervention wines with descriptions like \"finding a flower you tucked away in an old journal.\" Couples discussing regenerative coffee farming. A night at Baby Bistro can feel like an Echo Park porch party where someone named Whisper sells you on their farming co-op. Maybe this new-school bistro is a cliché for this part of town, but with an easygoing but knowledgeable staff, a menu dominated by of-the-moment produce, and a dining room that feels like a Cambria rental cottage, it's also a great place to take a deep breath and have a nice dinner.\n\nBaby Bistro is built for couples. And we don't just mean dates—though all the cozy nooks make it perfect for that as well—we literally mean parties of two. The short menu is around six dishes (plus a few add-ons), and unless you're there to sip Mendocino sauvignon blanc on the patio, plan to order everything.\n\nBaby Bistro's seasonal menu changes frequently. Here are some highlights from our most recent meal.\n\nThis soft slab of griddled bread with cheese spread and onion is your first peek into what Baby Bistro is all about: deliciously simple, unfussy dishes that'll make you look into the eyes of the person across from you and hope that they're tasting exactly what you're tasting.\n\nThere's a lot going on here: house-made tofu, pickled turnips, crushed pistachios, and raspberries in a salted plum vinaigrette—and it mostly works. Are the slightly sour berries a tad distracting? Sure. But this dish is basically the kitchen saying, \"We got a lot of fresh shit from the market back here\" and that's a flex we appreciate.\n\nOur server said to think of this plate as a palette cleanser. We'll call it something else: our favorite dish. One person at our table marveled at the texture difference between the soft, slightly gummy five-day-aged squid and the crunchy-fresh cucumber.\n\nIf there's one dish we want to be eating as the sun sets behind Baby's backyard banana trees, it's this summery plate of plump prawns in an impossibly sweet sungold tomato sauce. Note the breaded mushrooms on top doing their best shoestring potato impression.\n\nThe last time we saw chicken sausage on a menu, it was at a friend's Trader Joe's-only potluck. We're thrilled to see it elevate to a new level though, particularly in an unlikely form: lathered in a thick, smoky eggplant pureé and a windowsill garden's worth of botanicals. There's also a bed of tender grains with a sour pickled relish hiding underneath. Make sure they all end up on the fork together.\n\nIf this chunky pine nut cookie squiggled with savory-tart cucumber cream and candied rhubarb existed at a stand-alone bakery, there'd probably be a line of TikTokers standing outside."
    },
    {
      "source_id": "src_eater_la_2025",
      "publication": "Eater LA",
      "title": "Baby Bistro in Alpine Courtyard",
      "url": "https://la.eater.com/maps/best-new-restaurants-los-angeles-heatmap",
      "published_at": "2025",
      "trust_level": "editorial",
      "content": "It's a charming 100-year-old Victorian bungalow that seats 35 in the same Alpine Courtyard complex as Perilla and Baker's Bench. The duo's new restaurant is where Thompson brings a new menu showcasing farmers market ingredients at their peak, accompanied by Schwartz's wine selections. Though the set-up seems somewhat close to a tasting menu format, Thompson insists it is not. Always check the menu to see what Thompson procured and prepared, like the turnip tofu dish that uses Gardena's artisan Meiji Tofu, and bread baked in a hotel pan with Walla Walla onions, butter, and onion seeds; deglazed with mirin; and finished with a light soy sauce. — Mona Holmes, editor, Eater Southern California/Southwest"
    },
    {
      "source_id": "src_infatuation_october_2025",
      "publication": "The Infatuation",
      "title": "The Best Things We Ate In LA This Month - October 2025",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-dishes-infatuation-la-october-2025",
      "published_at": "2025-10-31",
      "trust_level": "editorial",
      "content": "I was the last person on the team to visit Baby Bistro and, like everyone else, I immediately fell in love with Echo Park's coziest little bungalow. We fired the whole menu, everything was exceptional, but this grilled mackerel blew me away. The salt-cured mackerel is mellowed out with a spritz of calamansi and poached quince, and the fish's thin and crispy skin crackles like chicharrón when you cut into it."
    }
  ]
}