{
  "place_slug": "baby-battista",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Baby Battista - Review - Atwater Village",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/baby-battista-atwater-village-la",
      "published_at": "2024-02-15",
      "trust_level": "editorial",
      "content": "Baby Battista is a secret Atwater Village wine bar. You'll find the entrance in Nico's wine shop. A basement bar pouring natural wine immediately sounds cool, but that's only part of Baby Battista's charm. The bar's nondescript entrance sits at the back of Nico's wine shop in Atwater Village, where you'll find stairs descending into a roomy cellar. It's decorated like a lo-fi lounge from the 1970s, complete with beaded curtains. The soft, ruby-hued lighting makes everyone look 40% more mysterious. And there's a separate black box theater where you can catch a comedy show or live music. Keep Baby Battista in mind for when you want to sip chablis and make flirty eyes with a date from the comfort of a decades-old loveseat."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "The 15 Best Wine Bars In Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-wine-bars-la",
      "published_at": "2025-07-16",
      "trust_level": "editorial",
      "content": "This Atwater Village wine spot is a hybrid shop-slash-bar, complete with a small theater where a few times a week you can catch a comedy show or live music. The entire bar glows red like a darkroom at a photo studio and the clog-clad clientele treats the roomy cellar like a lo-fi lounge. At Baby Battista, the short, rotating wine list is filled with bizarre-sounding options like \"hipster animal\" and \"jauma disco,\" but you can also snag that bottle of chilled red you already love from the shop upstairs for a $20 corkage fee. They've also got charcuterie you can snack on while watching whoever is on stage from the comfort of a decades-old loveseat."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The 17 Best Restaurants In Atwater Village",
      "url": "https://www.theinfatuation.com/los-angeles/guides/where-to-eat-drink-in-atwater-village",
      "published_at": "2024-08-26",
      "trust_level": "editorial",
      "content": "A basement bar pouring natural wine immediately sounds cool, but that's only part of Baby Battista's charm. The bar's nondescript entrance sits at the back of Nico's wine shop, where you'll find stairs descending into a roomy cellar. It's decorated like a lo-fi lounge from the 1970s, complete with beaded curtains. The soft, ruby-hued lighting makes everyone look 40% more mysterious. And there's a separate black box theater where you can catch a comedy show or live music."
    }
  ]
}