{
  "place_slug": "bar-chelou",
  "sources": [
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Review: Bar Chelou is Pasadena's coolest restaurant in ages",
      "url": "https://www.timeout.com/los-angeles/restaurants/bar-chelou",
      "published_at": "2025-02-19",
      "trust_level": "editorial",
      "content": "Since January, Bar Chelou has produced some of L.A.'s most exciting cooking, all from a rather unlikely neighborhood: Pasadena, home of countless chains and good-for-the-area restaurants. Helmed by Douglas Rankin, previously of Silver Lake's now-closed Bar Restaurant and Ludo Lefebvre's Petit Trois, the globally inspired European bistro occupies the same theater-adjacent space that once held Dominique Crisp's Saso, another chef-driven endeavor that critics (including me here at Time Out) welcomed, but nearby residents evidently didn't.\n\nThe fact that my recent weekday visits have found the Pasadena Playhouse space quite busy indicates that this new restaurant isn't likely to suffer the same fate. Far from it, actually. Against all odds, Bar Chelou has turned into the rare restaurant that functions as both an upscale locals spot and citywide dining destination.\n\nThe restaurant holds its own when compared to the most interesting restaurants in Silver Lake, Frogtown and other \"hip\" neighborhoods, so ignore the sleepy address; Bar Chelou is a dining experience worth going out of the way for.\n\nThe vibe: Slightly fancy and dim-lit, though you can also casually drop in and grab a few bites at the bar.\n\nThe food: Eclectic, globally inspired bistro fare and excellent desserts. Standouts include the rainbow trout, ibérico pork chop and lemon-chamomile semifreddo.\n\nThe drink: An array of mostly French wines, plus a small menu of apértifs and non-alcoholic drink options. Time Out tip: Don't be afraid to nibble on the bones of the pork chop or short rib at the table—they're bone-in for a reason.\n\nBar Chelou's strengths lie among the (non-vegetarian) cooked vegetables and entrées, as well as in desserts, where Morales tops a delectable lemon-chamomile semifreddo with an intricate floral fritter, marigold petals and calamansi gastrique. Other seasonal fruity desserts like a deconstructed strawberry shortcake and raspberry-sumac sorbet are equally worthy of attention.\n\nAs with the food, Bar Chelou's wine and cocktail program leans French, but not overly so. A modest wine list includes skin-contact, red and pink wines, and there's a short list of house apértifs like the Chelou 75, which adds a touch of raspberry liqueur to the classic champagne cocktail.\n\nOn my first visit to Bar Chelou, I left absolutely delighted with my meal; on the second and third times—visits I usually reserve for a menu's B-side—pleased but slightly less so."
    },
    {
      "source_id": "src_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Bar Chelou - Review - Pasadena - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/bar-chelou",
      "published_at": "2025-04-09",
      "trust_level": "editorial",
      "content": "But then there's Bar Chelou, an upscale French-ish bistro on the grounds of the Pasadena Playhouse where the food is spectacular enough to be its own attraction, regardless of whether you have tickets to the show or not.\n\nDishes are titled things like \"crispy potatoes,\" \"white asparagus,\" and \"cheese.\" Additional flavor details like apple vinegar, garlic broth, and sichuan au poivre follow in the menu descriptions. It's tricky to summarize—we still struggle to describe to friends exactly what kind of food Bar Chelou serves—but if you were able to get to the chef's first restaurant, the unfortunately named Bar Restaurant, you might already know that's part of the fun.\n\nThis isn't a fussy experimental restaurant where enjoying dishes requires long periods of self-reflection. Instead, dishes here tend to be the result of unconventional but bold combinations that taste great together. That might include a heap of shaved carrots topped with shoestring potatoes that'll remind you of a Thai crispy rice salad or a butterflied rainbow trout bathing in a color-swirled garlic chive pil-pil sauce.\n\nAt some point in your meal, you'll probably find yourself trading thoughts about the new Sondheim show or how the beige drapery in the dining room kind of makes it feel like you're on a date in a Parisian circus tent. It won't last. The discussion will inevitably be broken up by unbridled verbal affection for what's in front of you: briny clam toast, floral martinis, and a brûléed cheesecake that'll have you booking another table as soon as the bill lands.\n\nBut stealing the spotlight—and putting butts in seats—are what stars are supposed to do. And on this block in Pasadena, Bar Chelou is definitely a star.\n\nMake this dish the first thing that hits your table. Not only is it easily shareable for two, the intense acidity of the leek escabeche mixed with the buttery, briny clams is a good introduction to the level of flavor you're going to experience here.\n\nThis might be one of the most eye-opening dishes at Bar Chelou, because there's actually nothing complex about it. It's perfectly crunchy potato wedges on a bed of garlicky aioli that's been dusted with nori flakes. Nevertheless, you'll probably be thinking about it for three days after.\n\nWith a name like \"carrots,\" it's not completely clear what you're going to get with this dish, so we'll just tell you: an orange-colored crispy rice salad. We won't bore you with the how and why, but just know that with coconut dressing, lime leaf, peanuts, and crispy shoestring potatoes on top, this is a crispy rice salad somehow made out of carrots and a damn good one at that. Don't leave without ordering it."
    },
    {
      "source_id": "src_latimes_2023",
      "publication": "LA Times",
      "title": "Weird and delicious Bar Chelou is the next place you should eat",
      "url": "https://www.yahoo.com/lifestyle/weird-delicious-bar-chelou-140008763.html",
      "published_at": "2023-05-25",
      "trust_level": "editorial",
      "content": "Bar Chelou, housed in the same 98-year-old Spanish Colonial Revival building as the Pasadena Playhouse, brings a welcome jolt of eccentricity to local — and really, regional — dining. The beauty and intensity of pastry chef Raymond Morales' citrus bomb may conclude a meal, but after spending the previous hour or two with chef Douglas Rankin's savory counterparts, you're anticipating something a little eye-opening as a finale.\n\nChef Douglas Rankin's modernist plates and 1980s Deco Revival mood recall his work at the maddeningly named, now-closed Bar Restaurant in Silver Lake. It was among the last places reviewed before the 2020 shutdowns.\n\nChelou is a French word that across various online translation apps can be interpreted as \"weird,\" \"strange,\" \"unexpected,\" \"shady\" or \"dodgy.\" You get the picture. It's a declaration of roguish intent. In a time of exorbitant food costs and labor shortages, when many operators are composing safe, broadly appealing menus to comfort rather than provoke, plenty of engaged diners still yearn for some individualism, some surprise. Having a knack for offbeat abstractions can be a sound business strategy.\n\nBar Chelou seems to have stayed busy since opening in January, for good reason. In Silver Lake, Rankin's style pointed to his time in the kitchen with Ludo Lefebvre at Trois Mec and Petit Trois. He had absorbed a key aspect of Lefebvre's aesthetic: Arrange a plate's main ingredient in a precise, nearly flat geometry and then, for a feral \"Grey Gardens\" effect, pummel it with mulchy greens and grains and sprays of seed and spice.\n\nThe first half-dozen dishes on the menu could be billed as Things That Crunch: the clam toast on exceptionally crackly bread inspired by Catalonian pan de cristal (glass bread); shattering phyllo \"cigars\" filled with mild morcilla to be dunked in herbed apple cider vinegar; crisp potatoes in a close huddle, smeared with aïoli and dusted with aonori (dried seaweed).\n\nFrom the start, it's clear that Rankin's spin-the-globe imaginings know few borders. He bounces across continents in his bravura approach to vegetables. Not all of them shout \"plant-based.\" Snap peas wallow in anchovy cream under a shower of grated cured egg yolk and crumbled chistorra, a thin Basque sausage. The gist is Bacos and vitello tonnato out together on a farmers market run; the result is uncanny and delicious.\n\nLayers of Meyer lemon curd and chamomile sherbet are set into a frozen disc. The flavors shine bright and sunny; the textures lean more creamy than icy. A rosette-shaped fritter crowns the top, arranged with a circle of marigold petals."
    },
    {
      "source_id": "src_lamag_2023",
      "publication": "Los Angeles Magazine",
      "title": "Bar Chelou, Where Creativity Meets Wanderlust",
      "url": "https://www.lamag.com/digestblog/bar-chelou-is-a-perfect-blend-of-creativity-and-wanderlust-2/",
      "published_at": "2023-04-05",
      "trust_level": "editorial",
      "content": "At first glance, the dishes at Bar Chelou, the busy new restaurant in the iconic, nearly century-old Spanish Colonial-style Pasadena Playhouse building, are gorgeous, eye-catching bouquets of ingredients. Warm, sultry lighting gives a romantic glow to dishes like sugar snap peas buried in a blanket of cured egg yolk or an expertly cooked butterflied trout splayed atop a pond of white pil pil sauce surrounded by a swirl of bright green garlic chive oil. Underneath the fish is a treasure of delicate rice that has been cooked in corn juice to give it a pleasing crunch.\n\nChef Douglas Rankin has worked with many great chefs, including José Andrés and Ludo Lefebvre, with whom he served as chef de cuisine for the wildly popular Trois Mec and Petit Trois. He was honored with Zagat's \"30 Under 30\" at age 27 and opened his own Bar Restaurant in Silver Lake, which closed in 2022. Rankin's food is both surprising and delicious.\n\nThe name \"Chelou,\" French slang for \"unexpected,\" \"strange,\" or \"weird,\" suits this refreshingly relaxed bistro that also serves well-balanced cocktails and a rotating list of small-production wines. The menu, which Rankin describes as \"haute Parisian cuisine,\" embraces the European sensibility in four parts: tapas, smaller plates, larger mains, and desserts. The prices allow for frequent visits, and the food certainly does, too."
    }
  ]
}