{
  "place_slug": "baroo",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Baroo mixes Korean tradition into a relaxed tasting menu that clicks",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/baroo",
      "published_at": "2025-04-29",
      "trust_level": "editorial",
      "content": "A lot of tasting menus are like TED Talks—a little self-important, prone to dramatic pauses, and marked by a couple of overrehearsed movements. But at Baroo, a Korean tasting menu spot in an understated loft-like space in the Arts District, dinner is more like a lovely handwritten note than a showy speech. Thoughtful and delicious dishes lean more into comfort than novelty, service is relaxed, and there's enough guidance and backstory to bring the dinner to life without making it feel like a seminar. There are only six courses on the $125 tasting menu, but it's a lot more substantial than it sounds due to the way Baroo borrows from homestyle Korean bansang traditions (where dishes are meant to be eaten together, not in succession). Most courses arrive with multiple elements meant for mixing, matching, and alternating bites. Baroo has moved far beyond its early days as a grain bowl counter spot in East Hollywood, but even with a rice wine pairing and a coursed-out menu, the scrappiness hasn't gone away completely. Which is probably the point. Baroo might qualify as fine dining, but it doesn't always feel like it—and we mean that as a compliment."
    },
    {
      "source_id": "src_ediblela_2024",
      "publication": "Edible LA",
      "title": "baroo 2.0",
      "url": "https://www.ediblela.com/baroo-2-0",
      "published_at": "2024-12-06",
      "trust_level": "editorial",
      "content": "baroo 2.0 opened in September, 2023. It had just been named the Los Angeles Times 2024 Restaurant of the Year when I arrive to chat with Kwang Uh and Mina Park in October. Walking into the new baroo's larger and softer space, it can be hard to remember the old beloved but stark restaurant. The new space is more open and relaxed, filled with wooden tables bathed in a mix of natural and warm light that shows off the muted neutral tones of the room. The faint smell of salt in the air is from lamps made of seaweed hanging above. Intended to be cozy, the new space is inspired by hanoaks, or traditional Korean homes with contrasting dark wood and light-colored interiors and is filled with vintage Korean pieces curated by Park. When baroo opened in 2015, word spread among foodies and those of us working in kitchens: You had to get to baroo. Many Los Angeles restaurants can be heavy on \"atmosphere\" for the dining area, pouring money into sconces and other trimmings; instead, here was fluorescent lighting, blank walls, and functional dining sets in a Hollywood strip mall. As its only real flair, the kitchen overflowed with ferments on display, along with a massive collection of cookbooks. The new baroo offers a tasting menu with seven courses and drink pairings that change with the seasons. Though the food is different, it retains the same signature playfulness, depth, and boldness of flavors found on the first baroo's a la carte menu. Among many standout dishes, the soy-braised wild black cod with dongchimi, lemongrass, buttermilk, and papaya will live rent-free in your mind after one unctuous bite."
    },
    {
      "source_id": "src_resy_2024",
      "publication": "Resy Blog",
      "title": "The New Baroo Opens in Los Angeles",
      "url": "https://blog.resy.com/2023/09/new-baroo-los-angeles-restaurant/",
      "published_at": "2024-11-02",
      "trust_level": "editorial",
      "content": "For a restaurant that began as a 16-seater in an East Hollywood strip mall with no signage, reappeared down the street as a pop-up in a now-razed flea market, then ceased to exist for several years, Baroo has made an indelible imprint on Los Angeles. Local and national acclaim was immediate, but it was near impossible to fathom how Kwang Uh and his business partner during Baroo No. 1, Matthew Kim, layered unique ingredients to create such gustatory depth without visiting yourself. There was nowhere else in America like it, and though you knew Baroo as a place that experimented with fermentation in their Korean-inflected menu, their meticulous-yet-humble bowls evoked flavors and textures that were simultaneously familiar and revolutionary. Through its many iterations and locations, Baroo has always meant thoughtful food, with sometimes advanced techniques that nevertheless result in deeply comforting fare. Now, they finally have a space that matches their ambitions, and L.A. is more than ready to welcome the team home. The new Baroo, in the Arts District, opened in fall 2023 after years of meticulous planning and much anticipation. It's tasting menu-only, but still embodies that unpretentious whimsy that so many Baroo loyalists came to love in the restaurant's earlier versions."
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Baroo – Los Angeles",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/baroo",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Married couple Kwang Uh and Mina Park are behind this modern Korean dining room in DTLA. The look is sleek (think concrete floors and black-and-white walls) and the seats to be had are at the chef's counter, where you can watch the team at work. The format is tasting menu only, with options for wine and non-alcoholic pairings. Items may include a nicely seared Hokkaido scallop in a pool of watercress sauce with cubed seaweed jelly and puffed rice. Silky, soy-braised wild black cod is served in the center of a wide-rimmed bowl that is filled with a creamy buttermilk sauce that's poured tableside."
    },
    {
      "source_id": "src_finedininglovers_2024",
      "publication": "Fine Dining Lovers",
      "title": "Kwang Uh is deconstructing Korean cuisine at Baroo in Los Angeles",
      "url": "https://www.finedininglovers.com/explore/articles/kwang-uh-baroo-interview",
      "published_at": "2024-12-18",
      "trust_level": "editorial",
      "content": "Named Restaurant of the Year by LA Times food critic Bill Addison, Baroo is a Korean fine-dining restaurant marked by intention. Uh draws inspiration from chef René Redzepi of Noma and Seoul-based chefs Hee-Sook Cho and Mingoo Kang, but the most salient influence on this unique restaurant is Buddhist nun Jeong Kwan. Uh developed an interest in cooking from a young age, majoring in food service management and working in prestigious kitchens like Picholine, Daniel, and Nobu before pursuing a master's in food anthropology, where he did his dissertation on Korean fermentation. After staging at Quique Dacosta and Noma, he worked on research and development with Mingoo Kang at Mingles Seoul, before opening the original Baroo in 2015 with Park, who transitioned into the restaurant industry after a successful career as a corporate lawyer. After the 2018 closure of the original Baroo, which was a small operation located in a Hollywood stripmall, they started looking for a site that met their ambitions to open a much larger space with a proper team."
    }
  ]
}