{
  "place_slug": "birrieria-nochistlan",
  "sources": [
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Birrieria Nochistlan - Review - Boyle Heights - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/birrieria-nochistlan",
      "published_at": "2023-11-23",
      "trust_level": "editorial",
      "content": "You won't need to see a menu at this down-home spot in Boyle Heights. The specialty here is birria: earthy, tender Zacatecas-style goat birria prepared with a third-generation family recipe that's more prized than the Colonel's eleven herbs and spices. Unlike some specialists that are only open weekends, Nochistlan serves daily. They do great birria tacos, but what you want is their birria plate served in a pool of rich, fragrant consommé. On the side are thick housemade corn tortillas, chile de arbol salsa, onions, cilantro, and limes for assembling your own personal goat symphony. Slurp, chew, and repeat. Cash only. Truly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_lamag_2013",
      "publication": "Los Angeles Magazine",
      "title": "Essential T: Birrieria Flor del Rio's Goat Birria Tacos",
      "url": "https://lamag.com/news/vitamina-t-birrieria-flor-del-rios-goat-birria-tacos/",
      "published_at": "2013-04-02",
      "trust_level": "editorial",
      "content": "At a true birriera there should be nothing else on the menu—not carnitas, carne asada, or anything else. Flor del Rio is the best birria house in L.A., and one of the many unique restaurants that makes L.A.'s diverse Mexican food scene the country's richest. Javier Moreno learned to make birria, a traditional roasted goat dish, from his grandfather in Nochistlan, Zacatecas. At his Boyle Heights birrieria, Flor del Rio, Moreno has been specializing in this tradition for more than a decade. In its purest form birria is cooked in a pit, but these days—on both sides of the border—it's most often prepared in an oven on a rack. The drippings are then used to make the fragrant tomato and dried red chile sauce that's poured over the meat. At Flor del Rio, Zacatecas-style young goat birria is roasted in the oven and brought to the table covered in sauce (you can order it dry, too), then paired with the classic condiments: cilantro, onion, a fiery salsa made with chile Yahualica (regional variety of chile de arbol), and corn tortillas made to order. Ask for you birria plate \"bien dorado\" and it will arrive nicely crisped on a flattop, which provides added texture and flavor—there's no attempt to hide the powerful goat gaminess here. Birria is the type of food that is best done by a specialist."
    },
    {
      "source_id": "src_lamag_2015",
      "publication": "Los Angeles Magazine",
      "title": "Essential T: The State of Regional Birria in L.A.",
      "url": "https://lamag.com/food/essential-t-state-regional-birria-l/",
      "published_at": "2015-02-25",
      "trust_level": "editorial",
      "content": "Another one of our legacy birrierias on this list, the Boyle Heights branch of an authentic birrieria from the Mercado in Nochistlan, Zacatecas, delivers the small-town experience of Mexico. The most austere practice of Javier Moreno's birria puts the focus on the goat, with minimal condiments; you can get it dry here, but wet, with the birria sauce ladled over it, is the way to go. It's always the year of the goat in Los Angeles, home to the most diverse birria specialization in the world. Underground pit cooking is one of the treasured practices of pre-Hispanic Mexico. The state of Jalisco (where the largest Mexican migrant groups in L.A. come from) is the recognized originator of pit-roasted goat birria, and no visit to the birthplace of tequila is complete without a hot bowl of birria de chivo served with a stack of corn tortillas. Birria is the name given to the preparation: A messy adobo rub of dried chiles, spices, and vegetables like tomatoes and onions are rubbed on the goat or lamb that's traditionally wrapped in maguey spines and cooked underground over a stock pot to catch the drippings for the sauce."
    },
    {
      "source_id": "src_discoverlosangeles_2025",
      "publication": "Discover Los Angeles",
      "title": "Dine LA Taco Trek",
      "url": "https://www.discoverlosangeles.com/tacotrek",
      "published_at": "2025-09-08",
      "trust_level": "editorial",
      "content": "The late Silverio Moreno helped establish LA as a mecca for birria with the opening of Birrieria Flor Del Rio (renamed Birrieria Nochistlan) in Boyle Heights. For more than two decades, Moreno served the traditional Birria de Chivo (goat birria) of his wife Amparo Luis Bustos' family from Nochistlán, Zacatecas. The family's next generation now helms the beloved East LA restaurant. Cash only."
    },
    {
      "source_id": "src_gayot_2024",
      "publication": "GAYOT",
      "title": "Birrieria Nochistlan Restaurant Los Angeles LA CA Reviews",
      "url": "https://www.gayot.com/restaurants/flor-del-rio-los-angeles-ca-90063_2la151112.html",
      "published_at": "",
      "trust_level": "editorial",
      "content": "Oven-roasted goat birria in the style of Nochistlan, Michoacan, is the focus of this Boyle Heights eatery. Don't even bother to look at a menu. Tender goat is available dry or submerged in broth, and on the bone or boneless. Regardless, roast goat arrives juicy, with crusty coats. Try the tacos with goat meat, on steaming corn tortillas with minced onion and cilantro, a squeeze of lime and spicy fire-red salsa made with Yahualica chiles. Each plate comes with chile-studded, protein-rich goat consommé that has flavor that builds in intensity with each bite. To drink, expect soda and Mexican lagers like Corona and Negra Modelo, which help to extinguish the spice. If you're seeking dessert, consider a nearby panaderia. Note: The former Flor del Rio was renamed Birrieria Nochistlan and moved across the street to this address."
    }
  ]
}