{
  "place_slug": "botanica-restaurant-and-market",
  "sources": [
    {
      "source_id": "src_the_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Botanica",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/botanica",
      "published_at": "2024-03-18",
      "trust_level": "editorial",
      "content": "Unlike parents who sneak grated zucchini into their kid's birthday cake, Botanica proudly shows off vegetables. This Silver Lake restaurant works well for a brunch or dinner that feels like you're eating half the produce at the farmers market in one sitting. Even your tequila cocktail will have beets in it.\n\nThe healthy-leaning dishes on the Levant-meets-California menu change seasonally, but expect to snack on the sort of simple, three-ingredient plates you'd see in a Flamingo Estate newsletter. A standard hummus, for example, has a pool of tart pickled white beans in the middle. White beet salad gets punched up with sour cherries, and seared snap peas hide under a layer of crispy sea moss.\n\nMost importantly, Botanica has two lovely patios, making this a great weekend brunch spot when you want to eat spicy Turkish eggs in the shade after a hike."
    },
    {
      "source_id": "src_time_out_la_2025",
      "publication": "Time Out LA",
      "title": "Botanica",
      "url": "https://www.timeout.com/los-angeles/restaurants/botanica-1",
      "published_at": "2025-06-14",
      "trust_level": "editorial",
      "content": "Health-conscious, airy and bright (but with a tad bit of grunge), this all-day eatery is essentially Silver Lake incarnate. Since opening Botanica in 2017, owners Emily Fiffer and Heather Sperling have built a dedicated following with flavorful, light dishes like Turkish eggs and white bean hummus by day and shaved celery root salad and roast chicken with romesco by night.\n\nThrow in the cute, well-curated market out front for natural wines and gourmet goods, the occasional author talk or wine tasting event and a bevy of floral, herbaceous-leaning cocktails and you've got the recipe for an ideal Silver Lake neighborhood restaurant with a little bit of something for everyone.\n\nFor a little sweet treat during the day, order the \"cake for breakfast,\" a gluten-free coconut cake with passionfruit cream and jam."
    }
  ]
}