{
  "place_slug": "budonoki",
  "sources": [
    {
      "source_id": "src_the_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Budonoki - Review - Virgil Village - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/budonoki",
      "published_at": "2025-09-26",
      "trust_level": "editorial",
      "content": "Budonoki started out as a roving pop-up, landing a permanent space on the ground floor of a newly constructed condo complex at the end of 2023. You'd be forgiven, though, if you thought the grungy space had been around for decades. And that's a compliment. Black walls make it feel like you accidentally stumbled into a sticky K-town basement, while a fluorescent Orion beer sign casts a pink glow over booths filled with friends ripping sake bombs. Dates at the bar sip from cute penguin mugs filled with rice milk and plum sake, or blood orange shochu slushies. Don't be surprised after a few rounds when you and surrounding tables start gyrating in your seats to old-school Missy and 90's Kylie. (The music here is so good we once asked our server for the playlist. They had it ready.) Any debauchery you partake in here is the furthest thing from manufactured.\n\nThis Japanese izakaya in Virgil Village delivers an uncommon combination of strong drinks, spicy playlists, and tremendous food. Which makes it the kind of party you should find an excuse to show up to as often as possible.\n\nThe fairly straightforward menu at Budonoki doesn't veer much from the traditional izakaya formula. There are a dozen or so \"snacks\" designed to go well with drinks, plus two kinds of oshisuzhi (pressed sushi) meant to be shared, plus some very good soft serve. The term \"snack\" isn't quite accurate though, as these plates are designed to be passed around the table. A few dishes lean Thai as much as they do Japanese, none more so than the naem, a sour-savory fermented pork sausage with crispy rice and slaw that's easily the best thing on the menu. Most plates fall in the $12 to $18 range, so if you're with a big group, it's wise to load the table with things like juicy chicken oyster skewers, yakisoba noodles, and a charred sweet potato with miso butter that tastes like warming your feet by the fireplace. Even the pressed sushi—the least exciting thing on the menu—has its place.\n\nUnlike your typical clubstaurant, a night at Budonoki isn't weighed down by the performative act of \"going out.\" You don't have to put on uncomfortable clothes, consider bottle service, or stand outside while someone carrying a ring light gets in before you. The most high-stakes decision of the evening will be whether you want another order of pan-fried noodles, chicken wings, or both. And that's the kind of party restaurant we'll happily celebrate.\n\nIf there's an essential dish at Budonoki, it's this one. Fermented Thai sausage, crispy rice balls, and a snappy cabbage slaw come separate on the plate, so the best way to put it all together is to cut each rice ball in half and stack a little bit of sausage and slaw in the middle like a bite-size sandwich at high tea. The second dish on your to-eat list? These grilled chicken skewers made with the tender \"oyster\" section of the thigh. Here's the thing about the pressed sushi at Budonoki: It's solid. And if you're at a table full of moderately intoxicated people, it's really solid. But when lined up against the more unique dishes here, it's closer to a nice plate of rolls you'd find at a fusion-y sushi spot. Every time we've eaten at Budonoki with friends, this has been the runaway hit of the night. And how could it not be? Thick, pan-fried noodles, pickled ginger, and tender pieces of wagyu are tossed in a savory, umami-rich bulldog sauce, then squiggled with kewpie mayo and sprinkled with nori flakes. We're breathless just writing that. We've said it before: If you're planning to skip the soft serve at the end of a meal, don't bother inviting us. Especially when it's as silky as a neck scarf. There's usually two flavors here—black sesame and pandan-coconut, recently—but you can also order a swirl of both (yes, obviously)."
    },
    {
      "source_id": "src_resy_2023",
      "publication": "Resy Blog",
      "title": "Budonoki Brings a New Kind of Izakaya to Los Angeles",
      "url": "https://blog.resy.com/2023/10/budonoki-izakaya-los-angeles/",
      "published_at": "2023-10-31",
      "trust_level": "editorial",
      "content": "When college friends and industry vets Eric Bedroussian and Josh Hartley decided to open a restaurant of their own, they knew they had the front of house on lock: their combined resumes include stints at Alinea, Hillstone Restaurant Group, Helen's Wines, and Majordomo. But it wasn't until they connected with chef Dan Rabilwongse that it all coalesced into Budonoki, a fun, freewheeling izakaya that started out as a pop-up and is now a permanent addition to Virgil Village.\n\nBedroussian grew up amongst a large Japanese community in Vancouver, where izakayas are in abundance. \"They're sprawled across the city like Sweetgreens are in Los Angeles,\" he says. Starting at 18 (the legal drinking age in Canada), he'd frequent izakayas to throw back beers and share skewers with friends. \"It's a style of dining that I'm particularly fond of, and I knew I wanted to open that type of restaurant,\" he says. When he and Hartley were introduced to Rabilwongse, an Angeleno with Thai ancestry who had worked at Tsubaki and Ototo (along with Hayato and Tartine) — who was also interested in opening an izakaya — the pieces clicked into place.\n\nThe concept that they landed on is traditional in some ways, and nontraditional in others. Like a typical Japanese izakaya, the food is meant to be eaten alongside plenty to drink, and designed to be shared. Where Budonoki is unique is in the kitchen's aptitude for fusion. Rabilwongse incorporates Thai flavors, like a galangal-and-tamarind sauce he pairs with the chicken oyster-and-negi skewers and the habanero chili dip that goes with the shrimp-and-scallop katsu. Meanwhile, their chef de cuisine Justin Vu is Vietnamese — hence the fish sauce caramel with the chicken meatball skewer.\n\nAnother thing that's immensely popular in Vancouver is oshizushi, which is essentially a sushi roll that gets pressed into a rectangular shape, with fish in the middle and on top. It's something that Bedroussian knew he wanted on the menu from day one. So, in addition to the snacks section of the menu, which includes raw, grilled, and fried dishes, plus noodles and rice, there is a dedicated oshizushi section with combinations such as kanpachi with daikon and shiso and king salmon with shiro miso and serrano. The menu at Budonoki is also tighter than at most izakayas — it's small enough that for a group of four, Hartley recommends \"ordering everything and getting one or two oshizushi.\"\n\n\"We have cold beer, fun drinks, and awesome sake,\" Hartley says. Classic Japanese lagers — Sapporo, Asahi, and Orion — are served on draft in frosted mugs. Because Budonoki is bound by their type 41 license (beer and wine only), they can't use liquor in their cocktails. Still, they put a lot of care into crafting cocktails using sakes and fortified wines to build flavor. There's a slushy machine to make a frozen drink, Hyoketsu (sake, soju, koji, lychee, Calpico, and Capelletti), that's served in an animal mug, while the Daitoshi is a nod to a Manhattan, with sake, cocchi Torino, sherry, and cherry vanilla bitters. They even can some of their cocktails in-house, then pour the Budonoki-branded cans into chilled wine glasses.\n\n\"I feel like every restaurant you walk into these days is so bright and airy. White oak is everywhere,\" Bedroussian says. In contrast, a richly hued walnut is featured throughout Budonoki's interior, including in the slotted window covers, which creates a dark, cozy, and intimate feeling when you step inside the space.\n\nA soft serve machine behind the bar powers Budonoki's straightforward dessert program. It dispenses two flavors: a mint green pandan-coconut and a Disneyland-inspired pineapple number with an added dash of koji. As an added whimsical touch, in lieu of spoons, the soft serve is served with miniature plastic shovels. \"It's simple and delicious, and all you could ever want at the end of a filling meal,\" Hartley says. \"A lot of people are having two or three beers and some fried things and grilled things,\" Bedroussian adds. \"You're not trying to have this indulgent, decadent dessert [afterwards], but there's always room for soft serve.\"\n\nNow with a built-in local following and a handsome restaurant space to call their own, Budonoki is open for business, and taking reservations on Resy."
    },
    {
      "source_id": "src_resy_2025",
      "publication": "Resy Blog",
      "title": "How to Get a Reservation at Budonoki in Los Angeles",
      "url": "https://blog.resy.com/2025/05/budonoki-los-angeles/",
      "published_at": "2025-06-02",
      "trust_level": "editorial",
      "content": "We dare you to dine at Budonoki and not have a great time: from its bumping late '90s R&B soundtrack to its vibey neon lighting, to the colorful bear-shaped mugs filled with craft cocktails on every table, dining here feels like a celebration every night of the week. Accordingly, it's been wildly popular since opening in Virgil Village in late 2023. The creative pan-Asian izakaya comes from college friends and hospitality veterans Eric Bedroussian and Josh Hartley. It started out as a roving pop-up in 2021 after the duo met chef Dan Rabilwongse (an alum of Tsubaki and Hayato) via a mutual friend. Rabilwongse, who grew up in nearby Historic Filipinotown, put together the cuisine-melding menu, filled with signature dishes like pressed sushi, naem (a fermented Thai pork sausage), and creative cocktails.\n\nEd. note: Budonoki recently opened for service seven days a week, so you'll have an even better chance of snagging a table on Mondays and Tuesdays, which were previously dark.\n\nA party of six is the maximum you can book on Resy. 35% of our business comes from parties of eight or more. We actually make it really easy for people to book large parties. You just email me (hello@budonoki.la) and give your requirements and all you have to do is coordinate a set menu with us. It's about eight of our most popular dishes served in an abundant family style for $65 per person, which is pretty reasonable. No beverage minimum. We can do that for groups of up to 30; after that, it becomes a buyout situation.\n\nIn your opinion, what's the best seat in the house? It's the two tables in the corner right of the restaurant (if you're looking into the house from the entrance). If not there, I think any seat at the bar is the best seat. You're in the center and you have a bird's eye view. You're closest to the kitchen.\n\nIf it's someone's first time at Budonoki, what should they definitely order? They should get the naem (Thai pork sausage) for sure, the negima (aka the chicken oysters), and the curry pan. Those three for sure, then whatever your preferences are. Oh, and also get the budo-gnocchi and the grilled sweet potatoes."
    },
    {
      "source_id": "src_timeout_2023",
      "publication": "Time Out LA",
      "title": "Budonoki",
      "url": "https://www.timeout.com/los-angeles/restaurants/budonoki",
      "published_at": "2023-10-31",
      "trust_level": "editorial",
      "content": "A good izakaya is hard to find in L.A.—and while we can always count on Little Tokyo's Kinjiro and Echo Park's Tsubaki for an excellent booze-centric Japanese meal, this moody addition to Virgil Village is a worthy newcomer to the scene with excellent sake-based cocktails, a selection of pressed sushi and other chef-driven drinking fare. Think chef's salad brimming with country ham and lemon-miso vinaigrette, Thai-style pork sausage alongside a refreshing herb slaw and yakisoba topped with drizzles of kewpie mayo and a shower of dried seaweed flakes. Look to the daily specials to see where executive chef Justin Rabilwongse (Tsubaki, Urasawa) and chef de cuisine Justin Vu (previously of Morihiro) are getting creative."
    }
  ]
}