{
  "place_slug": "chi-spacca",
  "sources": [
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Chi Spacca – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/chi-spacca",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Chi Spacca – a MICHELIN restaurant. The carnivorous heart of Nancy Silverton's \"Mozzaplex\" is as strong as ever. A modern Italian take on the old-school steakhouse, the restaurant boasts a steady menu of classics that seem to have only gotten better with age. Is there a better beginning than the indulgently cheesy focaccia di recco? Is there a chicken more compelling than the 24-hour brined and marinated pollo alla diavola? The team makes the most of smoke and live fire, as big proteins pass through the wood-burning oven. Indeed, this is hearty cooking that is seasoned boldly and keenly seasonal, served in a space that is intimate and energized all at once. A superb wine list celebrates the vast talents of Italy, and an astute, welcoming staff keeps everything flowing with ease."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Chi Spacca - Review - Hancock Park - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/chi-spacca",
      "published_at": "2025-07-03",
      "trust_level": "editorial",
      "content": "Being a healthy and reasonable human feels good - but only if you balance it out with a night of complete excess every now and then. When you're due for your throw-down meal of the highest \"f*ck it\" variety, go to Chi Spacca, a meat-centric restaurant where excess isn't just encouraged, it's mandatory. And damn does it feel good. Chi Spacca is one of the three restaurants inside the Mozza complex at Melrose and Highland. But unlike the well-known Osteria and Pizzeria Mozza next door, Chi Spacca feels like the mysterious younger brother in the family. If you want a sprawling Sunset Strip steakhouse with neon water walls and people you recognize from an old season of Vanderpump Rules, Chi Spacca is not your spot. The easily missable entrance is hidden inside of the Mozza 2 Go pick-up area and the small red dining room has only 10 or so tables total. In a time when every restaurant in the city recommends 3-4 small plates per person, eating at a place that drops gigantic trays of red meat on your table like it's tap water feels revelatory. Most people in Los Angeles don't want to eat like this most nights - but Chi Spacca doesn't care about your Tupperwares full of quinoa. And when you're eating here, neither will you. This isn't just one of Chi Spacca's signature dishes, it's one of LA's. Arriving to the table looking like a crispy bread pizza, the focaccia is salty, cheesy, and the kind of thing you take one bite of and involuntarily scream \"Is this fcking real?\" If you're with a group and looking to get some of the best charcuterie in LA, this is a must-order. For $38, you get a sampling of six different meats, including speck, capicola, and the butcher's pate which will disappear within seconds. When you're eating at a place with as much red meat on the menu as Chi Spacca, seafood because the equivalent to vegetables. And these are really good vegetables. Looking like something from a Sweeney Todd prop table, this giant meat pie should absolutely make it onto your table. If you're able to finish this by yourself, we'd be impressed, but also a bit worried. Enlist the help of some friends. Available once a night Monday through Thursday, Chi Spacca's pig's head dinner offers a spectacle: a whole roasted pig's head, presented tableside to gawk at, then taken away and chopped into crackly, fatty hunks of porky goodness. Yes, you can also get this dessert at Pizzeria Mozza, but who cares? This salty pudding-like dish is still a top dessert in the city and we'd buy the rosemary cookies on the side in bulk if we could."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Chi Spacca | Restaurants in Hancock Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/chi-spacca",
      "published_at": "2025-03-01",
      "trust_level": "editorial",
      "content": "With one of the best charcuterie programs in the city and a stunning open kitchen, Osteria/Pizzeria Mozza's younger sibling flame-grills tomahawk porkchops, cures fennel salami and dry-ages massive Flannery Beef steaks so big they almost feel like they rock the table when they land. This is a rustic Italian steakhouse that's worth the meat sweats, and it's worth the splurge; you may be spending $200 on a steak, but don't think about skipping the sides of roasted sustainable veggies—nor that focaccia di recco, which oozes stracchino cheese. The expertly trained staff mans the open grill like nobody's business, so whatever you order, you'll be in good hands. And while I wouldn't recommend going out of your way for the burger—only available at the counter on Monday and Tuesday nights—I do think Chi Spacca is the best steakhouse in Los Angeles."
    },
    {
      "source_id": "src_foodgps_2023",
      "publication": "Food GPS",
      "title": "Chi SPACCA Milk Roasted Pork Loin - Food GPS",
      "url": "https://foodgps.com/chi-spacca-milk-roasted-pork-loin/",
      "published_at": "2023-12-16",
      "trust_level": "editorial",
      "content": "Roasting pork in milk is a traditional Italian preparation that The Minimalist author Mark Bittman credits Marcella Hazan with popularizing, based on her recipe in the \"Essentials of Classic Italian Cooking.\" At Chi SPACCA, the meat-focused arm of the Mozza Restaurant Group compound in Hollywood, Colby takes a bone-in pork loin and slow-cooks the meat in a wood-burning oven in a bath of milk and shallots, resulting in juicy slices of pork rimmed with melting fat, which get draped with fresh, aromatic sage. The pork emerges pale pink, but the milk accumulates color, caramelization and sweetness. If you're missing fennel pollen, Colby even dusts the loin with more of that porcine pixie dust. For $65, this is another costly beast on Chi SPACCA's menu, but certainly worth ordering with a group. I get it. The tomahawk pork chop at Chi SPACCA has the catchy name, and it's certainly an impressive serving of meat. Chad Colby's signature dish, weighing in at 42 ounces, combines the loin and belly, grills over almond wood, and gets seasoned with fennel seed and fennel pollen. Earlier this year, I named Chi SPACCA's chop to the dineLA list of The Best Pork Dishes in Los Angeles. However, in retrospect, that's not even my favorite pork dish at Chi SPACCA. I would now bestow that title to their Milk Roasted Pork Loin."
    },
    {
      "source_id": "src_michelin_2022",
      "publication": "Michelin Guide",
      "title": "California Continues to Lead the Way in Sustainable Gastronomy",
      "url": "https://guide.michelin.com/ca/en/article/sustainable-gastronomy/michelin-guide-2022-green-star-sustainability-dining-chi-spacca-harbor-house-single-thread",
      "published_at": "2022-12-06",
      "trust_level": "editorial",
      "content": "Green gastronomy isn't new, however, it's fitting that the Sunshine State, that would be California, leads the way with 11 MICHELIN Green Star restaurants. From Elk (it's near Sonoma) to Los Angeles, the Green Star restaurants champion sustainable practices while also acting as leaders in their profession continually innovating the dining experience from farm-to-table quite literally. With this in mind, we asked Chef Nancy Silverton of Chi Spacca, Chef Matthew Kammerer of Harbor House, and husband and wife duo Chef Kyle and Katina Connaughton of SingleThread on what can be implemented to shift the needle forward towards a more ecologically friendly dining experience and what sets each apart in the space. Sustainability is part and parcel with the food we make thanks to the decades-long relationships we've had with our purveyors who grow produce, raise and slaughter animals, with the same care we put into turning them into your dinner at Chi Spacca. We have some incredible meat dishes on the menu, but the food I want to eat every day is all over the Chi Spacca menu—seasonal salads layered with flavor and texture, vegetables simply seasoned and selected for their abundance and exuberant taste, and of course, the focaccia di recco. If we have a calling card, that's it."
    }
  ]
}