{
  "place_slug": "combo-a",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Combo A - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/combo-a",
      "published_at": "2024-10-26",
      "trust_level": "editorial",
      "content": "Combo A has quietly been Echo Park's go-to Chinese spot for years. That's because it's super-fast and affordable, and their soups have been known to brighten even the worst days. Get the hot and sour or the wonton soup. And whatever you order, they'll bring it right out to your car in the parking lot, so you don't even have to take your seatbelt off to eat it. We haven't been here yet, but want you to know this spot exists."
    },
    {
      "source_id": "src_theeastsiderla_2017",
      "publication": "The Eastsider LA",
      "title": "Echo Park Chinese restaurant serves up a makeover",
      "url": "https://www.theeastsiderla.com/eastsider_on_the_go/echo-park-chinese-restaurant-serves-up-a-makeover/article_32b53058-1ac3-577d-b712-b5693d07349e.html",
      "published_at": "2017-05-01",
      "trust_level": "editorial",
      "content": "ECHO PARK — Much has changed in Echo Park since Wichhica Nhim's parents, who fled to the United States from Cambodia in the 1970s, opened Chinatown Express in an Echo Park Avenue minimall 15 years ago. The pace of gentrification took off, rents and real estate prices have spiked and new restaurants, bars and shops have opened. Now, Nhim's family restaurant has changed, too. This weekend, a grand re-opening ceremony, complete with with Chinese dragons dancers, marked the transformation of Chinatown Express into Combo A – a sleek, contemporary version of the the old restaurant. The new name was inspired by the restaurant's popular lunch combination that's long been a staple at the restaurant: rice and/or noodles, plus two items from the steam table. Despite the new look, much remains the same. Nhim and his family remain in charge, and, and most of the food selection — including the Combo A deal — hasn't changed but some new additions are possible. The new appearance in a way reflects the ongoing changes in the surrounding neighborhood. \"Today's Echo Park includes familiar face alongside new faces, but it remains the same tight knit neighborhood that houses the differences in each of us,\" Nhim said. Combo A is located at 1411 Echo Park Avenue. \"Everything was updated from the floors, tiles, paint, and décor to all the furniture,\" Nhim said."
    },
    {
      "source_id": "src_theeastsiderla_2021",
      "publication": "The Eastsider LA",
      "title": "Echo Park Chinese restaurant stays loyal to its community",
      "url": "https://www.theeastsiderla.com/neighborhoods/echo_park/echo-park-chinese-restaurant-stays-loyal-to-its-community/article_78e515a4-6293-11eb-a51c-2f96319b1b76.html",
      "published_at": "2021-03-17",
      "trust_level": "editorial",
      "content": "Echo Park -- A few years ago the restaurant that used to be called \"Chinatown Express\" went through a big make-over, leaving it with new decor, signage and name: Combo A. Wichhica Nhim has helped run the family-owned Chinese place since he graduated from Downtown Magnets High School. After his parents fled Cambodia to the U.S. in the 1970s, Nhim and his three siblings grew up on the Eastside, becoming a part of the community they serve. In a Q&A, Wichhica Nhim shares his experience running the business: It was like early 2000s. My parents, they've always worked in the food industry. The opportunity came up to get this restaurant; Chinatown Express was for sale. They kind of came over, took over, they switched-up the recipes and whatnot. I was still in high school so I really didn't have much of a role here until after school when I actually came to the restaurants to work with my parents. A couple years back, I'm sitting here at the restaurant with my fiancé, thinking of trying to revamp the restaurant. I wanted to redo the floors, because I thought the floors were kind of old fashioned. And then my fiancee, Jamie, she said, \"You know what, if you're going to do it, don't do the floors. Do everything, just a whole makeover.\" And I'm just sitting there like wow, could we hold it? And then one of my regulars, he comes in and he says, \"Hey Wich, let me get a Combo A.\" So I get up and I serve him a plate, which was rice, noodles and two items, bring them up. He takes off and I go back to the table and I have a seat. And then my fiancé says, \"How about changing the name to Combo A?\" Automatically, the light bulb just lit. That's a pretty good ring to it. As funky as it sounds, that kind of works: Combo A. There you go, we kind of went with that. I'm the owner and operator here. I make sure that the food and the quality is up to my standards and I keep a pretty high standard. I'm not just a worker, I have to make sure that everything is great. If I'm not going to eat it, there's no way that I'm going to sell it. At other places, people are there just to collect a paycheck. They're there just to fill the role as a chef, as a cashier. They're just selling food. But I'm here, and I make sure the quality is top notch. The great thing is that the business was kind of modeled as a to-go business. Now, everything is to-go, and thank God for the tablets. Obviously, we try to minimize as many people as we could have in the restaurant at one time."
    }
  ]
}