{
  "place_slug": "ferrazzanis-pasta-market",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Ferrazzani's Pasta & Market - Review - Pasadena",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/ferrazzanis-pasta-and-market",
      "published_at": "2024-05-31",
      "trust_level": "editorial",
      "content": "If you can't find Ferrazzani's, just listen for the sound of Italian dudes fighting about the proper thickness of bucatini. Nearly everyone in this tiny Pasadena market is buying fresh pasta, and you should be, too—noodles are made daily in an attached temperature-controlled room. But if you leave without grabbing a sandwich, too, you've made a grosso errore. The five sandwiches on the menu are simple (i.e., four ingredients maximum), built with quality imported meats and housemade spreads on chewy Bub & Grandma's baguettes. We love the spicy salami with arugula and Calabrian chili butter, but if you're only getting one, make it the mortadella. The combo of mortadella/stracciatella/pistachio has become a fancy Italian sandwich shop standard these days, but the pesto-y one at Ferrazzani's has our full allegiance.\n\nPretty Good: You'll likely be satisfied by a meal here, especially for a specific situation."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "The 16 Best Restaurants In Pasadena",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-restaurants-pasadena",
      "published_at": "2025-03-27",
      "trust_level": "editorial",
      "content": "While we'll forever adore the timeless classic that is Roma Market, the best Italian deli sandwich in Pasadena these days comes from this tiny pasta shop and market in North Pasadena. Ferrazzani's makes five simple sandwiches (i.e., four ingredients maximum), built with quality imported meats and housemade spreads on Bub & Grandma's baguettes. We love the spicy salami with arugula and Calabrian chili butter, but if you're only getting one, make it the mortadella. The combo of mortadella/stracciatella/pistachio has become a fancy Italian sandwich shop standard, but the pesto-y one at Ferrazzani's has our full allegiance."
    }
  ]
}