{
  "place_slug": "gjusta",
  "sources": [
    {
      "source_id": "src_infatuation_2023",
      "publication": "The Infatuation",
      "title": "Gjusta - Review - Venice - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/gjusta",
      "published_at": "2023-12-07",
      "trust_level": "editorial",
      "content": "Unless you're new to eating in Los Angeles (in which case, hi there, we hope you like crudo and little gem salads), you probably don't need us to tell you about Gjusta. You've likely read about the Venice deli/marketplace on some guide, or saw a micro-influencer post about it on Instagram. Or perhaps you've already eaten here yourself. Either way, you probably also know that Gjusta can be a complete and utter scene—a wasteland of the tannest, most attractive people on earth, all of whom are currently standing between you and that beautiful tuna conserva sandwich. Lines are long, the ordering system is archaic and complex, and there's not a discernible parking lot in sight. So, is Gjusta worth the hype? Short answer, yes. But that love is conditional, the way you feel about a television show that keeps hinting it might kill off your favorite character.\n\nThere's a correct time and place to come to Gjusta—show up on a weekend or particularly sunny Friday, and expect a significant wait. Although there was a brief moment when they offered table service, Gjusta has gone back to its roots, a semi-chaotic ordering system where you take a number, wait to be called, then order at the counter. Although, real pros know to order ahead on Toast. Gjusta has also greatly expanded their patio in the last few years, which used to only be a small section at the back of the restaurant. Now, it's an entire parking lot affair, which means there are a ton more tables to snag. Be warned though, we've seen people go full Battle Royale over these highly coveted seats.\n\nImagine the most charming bakery or deli you've been in, either in real life or in your dreams. Now multiply that by ten. Cases here are piled high with smoked fish, pastries, salads, and pizzas that change depending on the day. Sandwiches are almost second to none, especially our favorite, the tuna conserva. And if you can get past the roast chicken's high price tag—$36—it'll ruin every other rotisserie in the city for you. You can order almost anything at Gjusta and be confident that it will taste extremely good, even after all the fuss it took to get it to your mouth. So, yes, Gjusta is a hassle. You'll curse the Westside whenever you roll up at 1pm on a Wednesday and see a long line snaking down the block. You might break down the moment someone beats you to a table. But we also know that we've never taken a bite of the tuna conserva and thought, \"Eh, this wasn't really worth it.\" If we could only eat one sandwich for the rest of our lives, it would be this. It's a slick, oily sandwich packed with roasted peppers, olive tapenade, and crunchy sprouts that will make you question if you've ever really eaten sprouts before.\n\nOf course Gjusta makes good bagels—they're blistered and golden on the outside, and dense and tender on the inside, with a strong malty smell that brings to mind freshly brewed beer. Served open-faced, there's an entire farmers market's worth of produce on here and house-made gravlax stacked on top, a testament to why Gjusta has so many devotees. In addition to a full food menu, this Venice establishment has a huge variety of bialys, bagels, and sourdough loaves and baguettes. You'll want to try everything, and their baguettes are hard to beat, but focus on the pumpernickel and olive loaves if you haven't had them before. Even the butter you hopefully spread on top will be in awe of their herby notes and spongy texture.\n\nAs the undisputed king of the Westside, it should come as a surprise to no one that Gjusta has a top-notch selection of meat and cheese. Big, marbled hunks of prosciutto are sliced to order. Come any day of the week, and you'll find cases filled with citrus-flavored goat cheese, rich rounds of the Bay Area's Cowgirl Creamery, and pâté de Campagne – a delicious country ham studded with nutmeg, allspice, and ginger. A nice, simple sandwich topped with roasted tomatoes—shriveled up and full of flavor—plus a bit of burrata, salt, and pepper. The only problem with eating the tuna sandwich for eternity is that we couldn't eat this one. These people know how to smoke a fish. You pick from the case (we like the herb gravlax and trout collar), then they'll make you a plate with labneh, pickled vegetables, and some very tasty toast. This massive, whole chicken arrives either rubbed in chili or herbs, and accompanied by a trio of sauces—tzatziki, harissa, and chimichurri."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Gjusta | Restaurants in Venice, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/gjusta",
      "published_at": "2025-03-09",
      "trust_level": "editorial",
      "content": "Brought to you by the same folks behind Gjelina, you might miss this upscale brunch spot if you don't know what you're looking for. Operating out of a nondescript warehouse near Gold's Gym, this high-end deli and bakery usually has a small crowd waiting outside.\n\nStep inside and you'll find a long, narrow corridor with glass cases of sweet and savory treats on the left, and a working bakery behind it. On the sweet side, slices of fruit are folded into sugar-glazed dough for a morning indulgence; a banana chocolate tart, while pricey, is worth a post-lunch splurge. On the savory side, sandwiches and salads make for an ideal lunch spot, with cuts of meat and fish, whether served to-go or in Gjusta's limited indoor seating or quaint, plant-filled patio area.\n\nNote: There's also a mandatory 20% service charge for dining in, as well as 15% for takeout orders, though you don't need to tip on top of that."
    },
    {
      "source_id": "src_michelin_2024",
      "publication": "Michelin Guide",
      "title": "Bread 101—MICHELIN Guide Chefs on the Perfect Loaf and Where to Get Them",
      "url": "https://guide.michelin.com/gb/en/article/features/michelin-guide-how-to-choose-bread-pastries",
      "published_at": "2024-09-16",
      "trust_level": "editorial",
      "content": "A combination of deli, bakery, cafe and market, Gjusta was initially meant to serve as a commissary kitchen that provided bread and pantry items to Gjelina. Since 2014, however, this bakery has evolved into a restaurant of its own. Through sourcing from Southern California farmers and local ranchers and fisherman, Gjusta is home to a highly seasonal menu filled with the bounty of Southern California."
    }
  ]
}