{
  "place_slug": "holcomb",
  "sources": [
    {
      "source_id": "src_the_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Holcomb - Review - Highland Park - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/holcomb",
      "published_at": "2024-08-05",
      "trust_level": "editorial",
      "content": "Holcomb is the kind of wine bar you walk into and immediately wish it existed on your block. With a long wooden bar, leather booths, and plenty of floral wallpaper, it's nice enough to ace a first date, but also casual enough for a weeknight wine run in sweatpants. Holcomb is run by the same people as the equally excellent Bar Covell in Los Feliz, which means you can expect a tremendous wine list, solid bar snacks, and bartenders who'll happily let you taste-test until you find the right glass. Bonus: There's a front patio that's entirely dog-friendly.\n\nUnrated: This is a restaurant we want to re-visit before rating, or it's a coffee shop, bar, or dessert shop. We only rate spots where you can eat a full meal."
    },
    {
      "source_id": "src_timeout_2021",
      "publication": "Time Out LA",
      "title": "Holcomb | Bars in Highland Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/holcomb",
      "published_at": "2021-09-29",
      "trust_level": "editorial",
      "content": "Alongside Highland Park's many dive bars and taprooms, natural wine-oriented Holcomb offers the kind of vibe that's ideal for casual meet-ups and weekday evenings. With wood finishes and accent lighting, the space manages to be warm, welcoming and undeniably cool all at once. Though the food offerings are limited to cheese, charcuterie and snack plates, the wine list is extensive enough to keep any pet-nat lover in good spirits—think small-producer picks from Austria, Greece, and Czechia, though you'll find plenty of French and Californian vintners on the menu."
    },
    {
      "source_id": "src_wine_spirits_2023",
      "publication": "Wine & Spirits Magazine",
      "title": "WSLA: Holcomb",
      "url": "https://www.wineandspiritsmagazine.com/reviews/restaurant/wsla-holcomb",
      "published_at": "2023-04-20",
      "trust_level": "editorial",
      "content": "Holcomb is named for a mountain valley in the Angeles National Forest near Big Bear, a pristine place which proprietor Michael Blackman wanted to keep top of mind for the vibe of his wine bar on York Boulevard in Highland Park. An alumnus of Bar Covell, Blackman partnered with CalArts friend Dustin Lancaster (Bar Covell, L&O Oyster Bar, Augustine) and Ross Stephenson to open this homey place dominated by a long bar and lined with cozy teal booths, a back patio if you've brought your pup, and—in a first (I think) for LA wine bars—a free \"take-a-book-leave-a-book\" library. The menu is modest and filling, cheese and charcuterie plates and its signature Highland Park Pulled Pork sandwich with tomatillos and pickled white onion. Blackman's wine selection is small, focused, and natty-inclined: He's got Folk Machine and Workbook wines on tap, and blends for the curious, like Vins aux Liens's Alsatian pétillant Wait Wait Wait, or Monte Rio's coferment of sauvignon blanc and petit verdot. Holcomb is part of our Top 30 LA List of 2023."
    }
  ]
}