{
  "place_slug": "homage-brewing",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Homage Brewing - Review - Chinatown - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/homage-brewing-chinatown",
      "published_at": "2024-02-13",
      "trust_level": "editorial",
      "content": "Homage, a brewery and restaurant in the middle of industrial Chinatown, has a lot to love: excellent beer, destination bar food (get the burger), and a dancefloor where people get down. On weekend afternoons at this Chinatown brewery, you might spot toddlers with their saison-drinking parents on the pleasant front patio. But the real scene is in the garage, which has a long bar, a disco ball, and, often, a DJ spinning vinyl. Most people come here to sip housemade IPAs and snack on masa-battered chicken wings during the day, but on Friday and Saturday nights, the dance floor is packed until 1am. Head there the next time you're looking for a place to appreciate dry-hopped saisons and meet someone with a color-coordinated tote bag."
    },
    {
      "source_id": "src_theinfatuation_2024_best_breweries",
      "publication": "The Infatuation",
      "title": "The 15 Best Breweries In LA - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-places-to-drink-craft-beer-in-los-angeles",
      "published_at": "2024-02-13",
      "trust_level": "editorial",
      "content": "There's a lot to love about Homage: excellent beer, destination bar food (get the burger), and a dancefloor where people get down. On weekend afternoons at this Chinatown brewery, you might spot toddlers with their saison-drinking parents on the pleasant front patio. But the real scene is in the garage, which has a long bar, a disco ball, and, often, a DJ spinning vinyl. Most people come here to sip housemade IPAs and snack on masa-battered chicken wings during the day, but on Friday and Saturday nights, the dance floor is packed until 1am."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Homage Brewing | Bars in Chinatown, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/homage-brewing",
      "published_at": "2025-08-13",
      "trust_level": "editorial",
      "content": "A few years back, Homage Brewing opened a second, larger location in Chinatown, which features 21 house taps plus guest beer selections, natural wines and ciders. Located just a few minutes' walk from Highland Park Brewing and the Metro station, the Chinatown location offers a breezy outdoor patio and a DJ playing records inside, which makes for a surprisingly lively taproom experience conducive to dancing and group hangouts. There's also a small food menu that includes burgers, wings, cheese plates and other light snacky fare. Time Out tip: Don't be surprised if you drop in on a random evening and find the place absolutely rammed—Homage's DJ sets often draw sizable crowds."
    },
    {
      "source_id": "src_timeout_la_2025_breweries",
      "publication": "Time Out LA",
      "title": "17 Best Breweries in Los Angeles for Craft Beer",
      "url": "https://www.timeout.com/los-angeles/bars/best-breweries-in-la",
      "published_at": "2025-08-12",
      "trust_level": "editorial",
      "content": "Why we love it: Since 2016, Matthew Xavier Garcia's Homage Brewing has produced a creative array of lagers, hazy IPAs and sours that—true to the brand's name—pay homage to European brewing culture. A few years back, Homage Brewing opened a second, larger location in Chinatown, which features 21 house taps plus guest beer selections, natural wines and ciders. Located just a few minutes' walk from Highland Park Brewing and the Metro station, the Chinatown location offers a breezy outdoor patio and a DJ playing records inside, which makes for a surprisingly lively taproom experience conducive to dancing and group hangouts. There's also a small food menu that includes burgers, wings, cheese plates and other light snacky fare. Time Out tip: Don't be surprised if you drop in on a random evening and find the place absolutely rammed—Homage's DJ sets often draw sizable crowds."
    },
    {
      "source_id": "src_timeout_la_2024_chinatown",
      "publication": "Time Out LA",
      "title": "26 Best Chinatown Restaurants and Bars For Dining and Drinks",
      "url": "https://www.timeout.com/los-angeles/restaurants/best-restaurants-in-los-angeles-guide-to-chinatowns-best-food",
      "published_at": "2024-07-01",
      "trust_level": "editorial",
      "content": "Since 2016, Matthew Xavier Garcia's Pomona-based microbrewery has produced a creative array of lagers, hazy IPAs and sours that, true to the brand's name, pays homage to European brewing culture. In 2021, Homage Brewing opened a second larger location in Chinatown, which features 21 house taps plus guest beer selections, natural wines and ciders. Located just a few minutes' walk from Highland Park Brewing and the Metro station, the Chinatown location offers a breezy outdoor patio and a DJ playing records inside, which makes for a surprisingly lively taproom experience conducive to dancing and group hangouts. There's also a small food menu that includes burgers, wings, cheese plates and other light snacky fare."
    },
    {
      "source_id": "src_theinfatuation_2024_day_drinking",
      "publication": "The Infatuation",
      "title": "The LA Day Drinking Guide",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-day-drinking-los-angeles",
      "published_at": "2023-06-15",
      "trust_level": "editorial",
      "content": "Homage, a microbrewery in the middle of industrial Chinatown, is made for people who love beer but also maybe want to dance a little. There's a pleasant patio out front where you might spot a few toddlers with their tattooed parents. But the real scene is inside the garage, which has a long bar counter, a spinning disco ball, and a DJ spinning vinyl records behind a monochromatic booth. Most people come here to sip housemade IPAs and snack on things like chicken wings and birria brisket tacos during the afternoon, but it's worth noting that on weekend nights, the dance floor is packed past midnight."
    }
  ]
}