{
  "place_slug": "kissaten-corazon",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Kissaten Corazon - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/kissa-corazon",
      "published_at": "2025-09-15",
      "trust_level": "editorial",
      "content": "Have you ever thought, \"Gee, I wish there was a quiet café with wifi, cute antiques, and great matcha\"? Well, that's Kissaten Corazon, a tricky-to-locate coffee shop north of Chinatown that's inspired by Japanese cafés known as... Loop Espresso Club, the place looks like the Rose Bowl flea set up inside a coffee shop. There are mismatched antique rugs, lamps older than Clint Eastwood, and a (fake) fireplace you can cuddle up to with your laptop. Café Tropical, and there's a tasty breakfast burrito with a Japanese omelet if you're hungry, but most people are here for the sweet signature drinks. We're fans of the iced latte with nutty sesame paste and a swirl of strawberry coulis, and a matcha-coconut concoction of pink coconut water with a cap of matcha foam (when you get a sip of both, it tastes like Fruity Pebbles). Between the bar, the fireside nook, and the semi-outdoor patio, Kissa has ample space for you and your thoughts, so use this café whenever you need a spot to focus on. Unrated: This is a restaurant we want to re-visit before rating, or it's a coffee shop, bar, or dessert shop. We only rate spots where you can eat a full meal."
    },
    {
      "source_id": "src_annenberg_2025",
      "publication": "Annenberg Media",
      "title": "Kissaten Corazon: A Japanese coffeehouse with an L.A. twist",
      "url": "https://www.uscannenbergmedia.com/2025/10/07/kissaten-corazon-a-japanese-coffeehouse-with-an-la-twist/",
      "published_at": "2025-10-07",
      "trust_level": "editorial",
      "content": "Straight off a busy highway in Los Angeles's Chinatown lies Kissaten Corazon, a newly opened coffeeshop and workspace. But it's not just a coffeeshop — it's an homage to tradition. Kissaten Corazon is inspired by Kissatens — traditional Japanese coffee houses or tearooms, known for pairing coffee with light meals and desserts. They were gathering spots for intellectuals and artists, places meant for quiet conversation and relaxation. Today, though, many Kissatens in Japan are vanishing — preserved only by an older generation of owners. Dominic Abat, Kissaten Corazon's owner, first fell in love with Kissaten culture on his visit to Japan in 2023. \"There are no Kissatens in Los Angeles, let alone the U.S.,\" he said. \"I wanted to bring that piece of Japan here and create a place where people could work during the day and catch up with friends at night.\" Two years later, he brought that same spirit to Los Angeles. The space feels intimate — a reflection of the owner's vision. \"I didn't promote this place at all because I wanted to keep that speakeasy feel. It's either you knew about it or you didn't, and you'd hear from word of mouth,\" Abat said. The design leans Victorian: decorated mirrors, antique lampshades, old school pianos. Abat credits his time working at L.A.'s Arts District restaurant standouts Bavel and Bestia for influencing the space's European touches. Yet, the atmosphere still feels like a kissaten, with soft jazz music, plush seating and retro décor. Abat wanted to reflect the traditional dining experience. From coffees made with sesame paste and strawberry coulis to melon soda floats, each brings Japanese flavors to the forefront. He plans to debut seasonal specialities too, so expect a pumpkin latte to make its menu debut soon. The menu also features the typical light bites that you'd find at a Kissaten. But Los Angeles finds its way onto the menu too. \"One of our most popular items is the breakfast burrito, and when we had more local Japanese people coming in, they'd look at the menu and raise an eyebrow,\" he said. \"Like what is a burrito doing at a Kissaten? But in L.A., it just works.\" The blend of cultures is what makes Kissaten Corazon stand out. Customers get both the nostalgic flavors of Japan and the familiar comforts of Los Angeles. While the menu experiments, Abat himself keeps things simple when it comes to coffee. \"I always start my morning with a cappuccino and end with a midday americano over ice,\" he said. He highly recommends trying one of their uniquely brewed pour-over coffees. Abat's vision doesn't just end with coffee. One of the main reasons he chose the Chinatown location was that it came with a liquor license. Soon, the café will be open late, turning into a speakeasy that serves wine, beer and sake. \"The goal is live jazz,\" he said as he stared up at the amplifier speakers above his head. Kissaten Corazon is bringing a new experience to the L.A. coffeeshop scene. One that is rooted in culture and tradition, while also adapting to modern trends of Los Angeles. For those seeking a cozy, atmospheric spot, Kissaten Corazon is worth the detour."
    },
    {
      "source_id": "src_eater_la_2025",
      "publication": "Eater LA",
      "title": "Semi-Secret Japanese Coffee Hangout Kissaten Corazon Opens in Chinatown",
      "url": "https://la.eater.com/restaurant-openings/287869/287869",
      "published_at": "2025-08-05",
      "trust_level": "editorial",
      "content": "A kissaten is a type of Japanese cafe that came to prominence during the 20th century, characterized by its Old-World charm and relaxed atmosphere. Although Abat sticks to tradition in many ways, he wanted Kissaten Corazon to reflect its surroundings in Los Angeles. \"A lot of them are dark and moody,\" he says, \"I feel as though my kissaten is definitely an iteration that fits LA culture.\" The interior offers cozy corners with seating areas illuminated by natural light, a staple of many LA establishments, alongside a menu inspired by Los Angeles and Japan. Abat stumbled upon his first kissaten while exploring Tokyo during a 2023 trip and fell in love with the concept. \"What's special about them is that a lot of them are hidden. They're not really present on social media, so not a lot of people know about them,\" he says. \"It was just something that felt very curated that you had to find, and that was something that I really connected with and loved.\" His dream is to live in Japan, so he created this space to bridge that gap. Kissaten Corazon is open from 8 a.m. to 5 p.m. Tuesday to Sunday, and is located at 1640 N Spring Street, Suite A, Los Angeles, CA 90012. Kissaten Corazon comes from the owner of the now-closed Loop Espresso Club with antique furnishings, coffee, and more. Abat, whose resume includes cooking at AOC, Bavel, and Pizzeria Sei, hopes that Kissaten Corazon will provide a flexible space with great service where people can come work during the day, or meet up with friends. \"Working at those establishments has allowed me to bring that kind of hospitality to coffee,\" says Abat of his work history. \"I think that's probably one of our most important things, is giving people that next level in the coffee industry.\" The interior of the cafe hews closely to what would be found at kissaten in Japan, with homey antique furniture. The name, design, and logo for the cafe are an homage to Abat's late grandmother. \"I wanted a Spanish word for the name because we're in LA and I felt it was fitting,\" he says. \"My grandma's name just so happened to be Cora – Corazón [heart, in English] – and I felt like it was perfect for being in the heart of LA,\" says Abat."
    },
    {
      "source_id": "src_barista_magazine_2025",
      "publication": "Barista Magazine",
      "title": "Coffee in Cool Places: 2 Hidden Gems in Los Angeles",
      "url": "https://www.baristamagazine.com/coffee-in-cool-places-2-hidden-gems-in-los-angeles/",
      "published_at": "2025-12-31",
      "trust_level": "editorial",
      "content": "Warehouse raves have long been a part of Los Angeles' underground culture, but now, it seems the city has entered the era of \"warehouse coffee.\" Kissaten Corazon, a coffee shop tucked within the warehouses right outside of the Arts District, is the type of place that you want to keep to yourself; this cozy, speakeasy-inspired café is the perfect place to hole up on a rare rainy day in L.A. Walking into the coffee shop feels like stumbling through a portal into the past. Vintage furniture, including a piano, dimly lit chandeliers, and velvet curtains adorning the walls, make this spot feel like a quiet, jazz-filled oasis at the epicenter of the city. Founded by Dominic Abat, who visited his first kissaten (traditional Japanese coffee shop) on a trip to Tokyo back in 2023, the shop is the perfect blend of Eastern and Angeleno culture. Standout menu items include the Kissa soda float and cantaloupe milk matcha, along with a selection of wine and pastries from nearby Cuban bakery Cafe Tropical. The good news is that the space is expansive, with ample seating both indoors and outdoors, making this the perfect place to bring a book and stay awhile."
    }
  ]
}