{
  "place_slug": "la-azteca-tortilleria",
  "sources": [
    {
      "source_id": "src_the_infatuation_2025",
      "publication": "The Infatuation",
      "title": "La Azteca's chile relleno burrito warrants the hype",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/la-azteca-tortilleria",
      "published_at": "2025-08-21",
      "trust_level": "editorial",
      "content": "Dating back 50-plus years, La Azteca Tortilleria in Boyle Heights makes some of the city's best flour tortillas by hand: soft but flaky, thin yet substantial, and stretchy enough to be wrapped into burritos the size of overgrown guinea pigs.\n\nIndecisive return customer? Don't overthink it, get this gooey burrito. You'll get a mouthful of cheese, sweet-smoky chile, and pico de gallo in each bite (ask to add their seared asada if you're feel flush). The star is Azteca's tender fat-enriched tortillas, which live in the sweet spot between sturdy and nearly translucent.\n\nMuch to our surprise, the chicharrón in this burrito is not the soft, salsa-stewed variety, but crunchy, rough-chopped pork cracklings that are swaddled in a tortilla with beans and pico de gallo.\n\nLa Azteca's chicharrón is delicious, but unless you drown the whole thing in salsa, it makes for a pretty dry burrito.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for.\n\nHead to this Boyle Heights landmark for the gloriously simple bean and cheese burrito."
    },
    {
      "source_id": "src_kevineats_2020",
      "publication": "kevinEats",
      "title": "La Azteca Tortilleria (Los Angeles, CA)",
      "url": "http://www.kevineats.com/2020/05/la-azteca-tortilleria-los-angeles-ca.html",
      "published_at": "2020-05-09",
      "trust_level": "editorial",
      "content": "La Azteca Tortilleria\n4538 East Cesar E Chavez Avenue, Los Angeles, CA 90022\n323.262.5977\nwww.laaztecatortilleria.com\nSat 05/09/2020, 03:00p-05:00p\n\nThis free-flowing coronavirus traffic afforded me the opportunity to visit the vaunted La Azteca Tortilleria, an East LA institution that's only open during the day.\n\nI'd wanted to try this spot for a while, but it sort of fell off my radar until it was recently recommended to me by a friend.\n\nA bit of background: The history behind the place is cloudy and often contradictory, but as far as I can tell, the restaurant first opened its doors in 1945. It was originally located in a different building nearby, but had to move to its current address (well, an address on Brooklyn Ave, the predecessor to Avenida César Chávez) sometime before 1965 on account of the construction of Interstate 710.\n\nLa Azteca has gone through multiple generations of ownership. The business was apparently sold to a Maria Gonzalez in 1992, while the current owners, Michoacán natives Candy and Juan Villa, took over in 2010. Their daughter Cynthia helps run the business, and son Chris is also involved.\n\nSince the Villas began running the show, La Azteca has won numerous awards for its burritos, specifically the signature chile relleno variant. Some of these accolades include \"Best Burrito\" by LA Weekly in 2012, the #1 position on The Daily Meal's \"The 35 Best Burritos in America\" list in 2014, and a spot on \"Jonathan Gold's 5 Best L.A. Burritos\" ranking in 2015, among others.\n\nThe dining room is quite tiny, and is most known for its colorful mural depicting an elaborately dressed Aztec woman. La Azteca's menu features numerous burrito options, in addition to quesadillas and tacos, naturally.\n\nChile Relleno Burrito + 1 Choice of Meat - Carnitas [$9.00]\n\nNaturally, we have to begin with La Azteca's signature dish. The meat was rather tasty, mostly thanks to its aggressive seasoning that was a mix of lingering heat and sweet, as well as its tender consistency that nevertheless still offered up enough chew. The stretchy tortilla here was on point as well, and worked to moderate the considerable potency of the pork.\n\nAl Pastor Taco - Flour [$2.50]\n\nAccording to a sandwich board placed smack dab in middle of the restaurant, al pastor was a new option at La Azteca, and thus I felt compelled to give it a shot. The meat was rather tasty, mostly thanks to its aggressive seasoning that was a mix of lingering heat and sweet, as well as its tender consistency that nevertheless still offered up enough chew. The stretchy tortilla here was on point as well, and worked to moderate the considerable potency of the pork.\n\nSausage, Potato, and Egg Breakfast Burrito [$6.50]\n\nLa Azteca also presents a full slate of breakfast burritos, which deserves attention in its own right. I went with the sausage, and it didn't disappoint. The tubed meat had a wonderful snappiness to it, along with cozy, classic flavors that just made sense when combined with potato, all while the fluffy egg tempered that interaction. The burrito was even better with a splash of the salsa below, and once again, that homemade flour tortilla lent a much appreciated heft to the dish."
    },
    {
      "source_id": "src_eater_la_2025",
      "publication": "Eater LA",
      "title": "La Azteca Tortilleria Relocating from Boyle Heights",
      "url": "https://la.eater.com/2025/5/30/285870/los-angeles-restaurant-bar-closings-june-2025",
      "published_at": "2025-05-30",
      "trust_level": "editorial",
      "content": "A more-than-50-year-old restaurant and tortilleria is relocating from its longtime Caesar Chavez Boulevard spot on June 13 to a permanent second location less than two miles away at Atlantic and Beverly Boulevards, signaling the end of an historic Boyle Heights space rather than a full closure. The family-run operation — purchased by Cynthia Hernandez and her parents Candy and Juan Villa in 2010 — is known for long lines, a massive flour tortilla-making operation directly behind the ordering counter, and its signature chile relleno burritos; the family opened the second location in 2023."
    },
    {
      "source_id": "src_theeastsider_2021",
      "publication": "The Eastsider LA",
      "title": "East LA tortilleria attracts loyal customers and Michelin recognition after a decade of hard work",
      "url": "https://www.theeastsiderla.com/neighborhoods/east_los_angeles/east-la-tortilleria-attracts-loyal-customers-and-michelin-recognition-after-a-decade-of-hard-work/article_971ee716-3cd1-11ec-9d18-fb83411ae162.html",
      "published_at": "2021-11-04",
      "trust_level": "editorial",
      "content": "East Los Angeles -- When Juan and Candy Villa purchased La Azteca Tortilleria in 2010, they had no idea how to make handmade tortillas or how to run a business. What they knew is that they wanted to do things the right way: Serve high-quality, fresh food without reheating items or saving a few dollars with cheap ingredients.\n\nJuan continued his job as a truck driver for the first five years because they didn't have much business. What they did have in those days were plenty of obstacles: Tough competition and a badly outdated restaurant in need major refurbishment.\n\n\"Fue difícil al principio,\" Juan said. \"It was hard at first.\"\n\nBut all that hard work has paid off. Loyal customers travel for miles for La Azteca's flour tortillas and chile relleno burritos. The couple has turned down offers to buy the business as it has prospered. And recently, La Azteca was added to Michelin's California Bib Gourmand Guide, which showcases more casual and lower-priced restaurants.\n\nJuan recalled working long days and late nights at the Cesar Chavez Avenue tortilleria, trying to figure out how to keep up with the restaurant's expenses. Some family members thought they made a big mistake. There were times the Villas had doubts, too. But the couple kept reminding themselves that if they did things right, they could succeed.\n\nLa Azteca is located in a strip of colorful small storefronts on Cesar Chavez Avenue. Initially, the main items on the menu were handmade flour and corn tortillas. But the only one who knew how to make them was Candy. \"I was not a chef, nor did I know how to cook,\" Juan said."
    }
  ]
}