{
  "place_slug": "lucia",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Lucia looks stunning, but the Caribbean food shines, too",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/lucia-la",
      "published_at": "2025-11-26",
      "trust_level": "editorial",
      "content": "There's also decadent, spice-enriched food, classic cocktails with interesting twists, and a waitstaff that gives every person who walks through the door the attention of a Grammy winner—elements that prove Lucia is more than just looks. It's also a helluva place to have a glammed-out dinner.\n\nLucia does have its clubby touches. There's a DJ booth next to the kitchen, there's an option to add a caviar bump to any dish, and the dress code forbidding shorts or baseball caps is actually enforced. The place is one champagne bottle and a sparkler away from being a full-on clubstaurant. That said, the restaurant parts are equally memorable: crunchy saltfish croquettes or tuna tartare wrapped in giant shiso leaves, margaritas made with jerk-spiced agave, or a show-stopping oxtail pot that'll have your entire table gnawing on bones with complete disregard for their new, conversation-stealing top.\n\nThe menu does have a few weak spots, but one thing Lucia consistently nails is its vibrant sauces, so prioritize dishes that feature a pool of something colorful on the plate (because it's easier to forgive a slightly underseasoned piece of fish when you're sopping up silky coconut butter with a thick piece of milk bread).\n\nWith a fun drink list featuring moscow mules dusted in masala or a smoky tom collins made with mezcal and Red Stripe, you could make a whole night out of the on-theme cocktails at Lucia. And since the bar is open until midnight (and 2am on weekends), it's a great nightcap option in the area when you want something more than well drinks at Kibitz Room.\n\nOn their own, these are solid croquettes with a nice crunch and deep savoriness from the salted cod. When dipped in the spicy peruvian cheese sauce on the side, though, they become a must-order.\n\nShrimp toast is a S-tier appetizer in our books and Lucia's version mostly lives up to those ceiling-high expectations. It's crunchy and sweet, while the chado beni sauce (a popular Trini condiment) dripping over the edge adds a fresh cilantro punch.\n\nThis is the one real miss on Lucia's menu. The mac is dry and stodgy, and the puddle of creamy cheese sauce is oddly lacking in seasoning or spices.\n\nThe best dish at Lucia and the centerpiece to any proper dinner here. The oxtails are cooked down in warm spices to the point where you don't even need a fork to peel them from the bone—they just slip off like naturally into the the rich butter bean sauce below."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Lucia",
      "url": "https://www.timeout.com/los-angeles/restaurants/lucia",
      "published_at": "2025-07-01",
      "trust_level": "editorial",
      "content": "This stylish Fairfax lounge and restaurant serves a tightly curated menu of Afro-Caribbean cuisine unlike anything else in Los Angeles. Unlike many spots in nearby West Hollywood, Lucia manages to capture the glitz and glamour without much of the same pretension—and the restaurant's culinary game is on point as well.\n\nFounded by serial restauranteur Sam Jordan, the upscale restaurant isn't just a dinner destination, it's also a late-night cocktail lounge for those looking to get dressed up for a lively night on the town. Jamaica-born head chef Adrian Forte, who's also worked as a private chef for Black visionaries like Drake, Alicia Keys and Virgil Abloh (as well as appeared on Top Chef Canada), has put together an elevated, lounge-style menu of dishes and drinks that nod to traditional Caribbean fare.\n\nThink a martini topped with pickled okra, jerk-marinated rib eye and a sorrel (a.k.a. hibiscus) lychee ceviche. Not every dish totally wowed me—the coconut fried chicken was a bit dry, and the $30 trio of wagyu patties were comically small—but paired with the excellent drinks and stunning ambience, Lucia easily earns a spot on my list of this summer's must-visit restaurants. This summer, look out for Forte's late-night bites menu for the after 10 o'clock crowd."
    },
    {
      "source_id": "src_wallpaper_2025",
      "publication": "Wallpaper*",
      "title": "Lucia, Los Angeles review: smoke, spice and roots",
      "url": "https://www.wallpaper.com/travel/restaurants/lucia-los-angeles-review",
      "published_at": "2025-06-21",
      "trust_level": "editorial",
      "content": "A stylish Afro-Caribbean dining destination has landed in Los Angeles's Fairfax District. The eatery, called Lucia, is the project of hospitality entrepreneur Sam Jordan, who previously worked on LA's Issima restaurant and Oakland's Kissel Uptown hotel. With Lucia, a labour of love that took three years to develop, Jordan is shining a glamorous spotlight on an under-represented cuisine.\n\nAlexis Readinger of LA-based hospitality design firm Preen, Inc. imbued Lucia with a seductive Caribbean atmosphere. The vibes start at the front door, which features a snake-shaped handle, and continue into a golden mirrored chamber. You'll be tempted to linger over a round of okra martinis at the central white terrazzo bar, which is framed by three towering verdigris palms fabricated by local multi-media artist Guerin Swing, or nestle into the shell-like domes ensconcing five plant-patterned velvet booths.\n\nBeverage director Melina Meza draws on spices and native fruits from St. Lucia and Trinidad and Tobago, paired with Caribbean rums. The Oxtail Old Fashioned blends oxtail-washed bourbon with sweet potato, sugar cane and Creole and Angostura bitters. Wines by the glass include selections from South Africa and Red Bear Winery in Sonoma, which Jordan co-founded with his father.\n\nNight owls take note: the kitchen will remain open until 2 am – a welcome late-night addition to this area.\n\nLucia is located at 351 N Fairfax Ave, Los Angeles, CA 90036, United States."
    }
  ]
}