{
  "place_slug": "lupes-burritos",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Lupe's Burritos - Review - East LA - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/lupes-burritos",
      "published_at": "2025-08-21",
      "trust_level": "editorial",
      "content": "Founded in 1972, Lupe's is an old-school Chicano lunch counter (and Al & Bea's rival) where the combo burrito with shredded beef, shredded cheddar, refried beans, and stewed green chiles is king. If you're trying to find Lupe's #2 in East LA, just look for the double-parked cars and red picnic tables packed with families and city workers most afternoons. The blistered tortilla is elastic and nearly translucent, with beans glowing through the folds and fillings erupting like lava from every seam. Make sure to drip a little of their orange salsa on every bite—the spice flares up right away, but then mellows out before you start to sweat. Pretty Good: You'll likely be satisfied by a meal here, especially for a specific situation. These are handy back-up restaurants and beloved local spots."
    },
    {
      "source_id": "src_theinfatuation_la_2025",
      "publication": "The Infatuation",
      "title": "The 10 Best Burritos In LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-burritos-in-la",
      "published_at": "2025-08-21",
      "trust_level": "editorial",
      "content": "If you're trying to find Lupe's #2 in East LA, just look for the double-parked cars and red picnic tables packed with families and city workers most afternoons. Founded in 1972, Lupe's is an old-school Chicano lunch counter (and Al & Bea's rival) where the combo burrito with shredded beef, shredded cheddar, refried beans, and stewed green chiles is king. Case in point: their Burrito 2.0, which features the same smoky, charcoal-grilled meats and buttery housemade flour tortillas, just bulked up with stewed pintos, shredded jack, and a fiery chiltepín salsa that burns hot and fast. If you're less into spice, their classic bean and cheese and chivichangas with shredded chicken are fantastic, too."
    }
  ]
}