{
  "place_slug": "majordomo",
  "sources": [
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "majordōmo – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/majordomo",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Sequestered inside a former warehouse on the industrial fringe of Chinatown, majordōmo pulsates with energy, especially from the open kitchen. Reservations can be a challenge to land online, but gamblers can test their luck by trying for one of the few counter seats on a walk-in basis. Is it worth the hype? You know it. Its singular take on Asian cuisine delivers hit after hit. The menu zigs and zags through numerous sections; enjoy the refreshing melon salad bobbing in a fish sauce vinaigrette from the snacks section and go for the spicy fusilli with kimchi sauce, pork jowl and parsley from the noodles menu. It's easy to make a meal from the many smaller courses, while the main dishes are designed for sharing. From California to New York, the Momofuku founder has been a pioneer in Asian cuisine in the United States."
    },
    {
      "source_id": "src_the_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Majordomo's Korean-ish fusion still impresses, especially with a crew - Review - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/majordomo",
      "published_at": "2025-10-02",
      "trust_level": "editorial",
      "content": "When Majordomo opened in 2018, it was a big deal. Not only was it the first West Coast expansion of the Momofuku empire, it also plopped a massive indoor-outdoor warehouse restaurant with a big string-lit patio into an industrial area north of Chinatown, a stretch previously populated by auto body shops and shipping companies. A lot has changed since then, but many things at Majordomo haven't—the fusion-y, Korean-leaning food is fun and inventive, the cocktails are refreshing, and that big string-lit patio is great for rounding up a group and spending the night passing around smoked meats and lettuce wraps. Any meal here should start with an order of bing, Majordomo's puffy-soft flatbread that's paired with dips like roasted eggplant with pine nut gremolata that tastes like a supercharged babaganoush, or whipped ricotta decorated with a splat of fruit jam and chili crunch. The best move at Majordomo is to come with at least four people, just so you can take down this massive plate of smoked short rib. Carved tableside and accompanied with various sauces and leafy greens for wrapping, its the kind of dish that quiets a table down quickly once everyone digs in. Bonus: it also comes with beef fat rice made with the leftover trimmings as a second course. Considering it feeds four grown adults, the smoked bo ssam's $125 price is actually quite reasonable. The sweet-salty pork shoulder is so tender that all you need to cut it is a pair of tongs, plus's plenty of banchan and a side of steamed rice comes with it. If a chocolate mousse crash-landed into a pile of toasted corn flakes, you'd get this dessert. Beneath the crispy feuilletine shell is a caramel-y, chocolate-y pudding-like layer that packs a nice dark chocolate bitterness."
    },
    {
      "source_id": "src_opentable_blog_2025",
      "publication": "OpenTable Blog",
      "title": "The Insider: Why LA's JBF-nominated Majordōmo remains a blockbuster hit",
      "url": "https://www.opentable.com/blog/majordomo-los-angeles/",
      "published_at": "2025-05-13",
      "trust_level": "editorial",
      "content": "Ever since it opened in a sweeping, indoor-outdoor space in the Arts District in 2018, superstar chef David Chang's Majordōmo in Los Angeles has been a blockbuster hit. Often full of big groups digging into noodle dishes and giant platters of short ribs from the eclectic, shareable Asian menu, the restaurant has landed on The Los Angeles Times's 101 Best Restaurants list every year since it opened—and has evolved along the way. \"From a culinary standpoint, you see this thumbprint of all the people who have made a mark in the kitchen, which is not dissimilar to LA itself,\" general manager Jared Hill says. \"There's a lot more to discover than what first meets the eye.\" The smoked whole short ribs have been a menu staple since Majordōmo opened. We recently caught up with Hill and executive chef Tim Mangun to hear what makes this restaurant within the Momofuku restaurant universe so unique. Majordōmo in Los Angeles is David Chang's only restaurant in the city and a JBF nominee. When we first opened, we were finalists for the James Beard Best New Restaurant. I still have the certificate. Opening up a restaurant is one of the most difficult things a human can do, so the fact that James Beard recognized us was one of the highlights of my kitchen career. Plus every year we've been open, we've been on The Los Angeles Times 101 Best Restaurants list. To me, it's like, okay, there are something like 26,000 restaurants in LA, and we're in the 101 best. Our culinary community is so diverse and excellent, so I'm proud to be on that list every year. The backbone of our menu is the large-format smoked whole short ribs. David Chang wanted to open with this as the focus. The marinade is based off of his mother's recipe, but we've tweaked it to feed up to six people. It's carved tableside and served ssam-style. The mushroom crispy rice, which made its first menu appearance in 2022, has also become one of the staples. I love starting with fresh seafood. I avoided our tuna carpaccio at first because there have been so many other disappointing examples at other restaurants. But ours is a real standout. It's a beautiful, simple presentation, with avocado, sesame, and yuzu. The seasoning really sets up the rest of the meal."
    },
    {
      "source_id": "src_resy_2022",
      "publication": "Resy",
      "title": "The Five Dishes You Must Order at Majordōmo",
      "url": "https://blog.resy.com/2022/10/majordomo-best-dishes/",
      "published_at": "2022-10-19",
      "trust_level": "editorial",
      "content": "When Majordōmo opened in an industrial corridor in Chinatown in 2018, it made a major splash as the first (and still the only) restaurant from David Chang's New York-based Momofuku universe to open in Los Angeles. Today, Majordōmo remains steadfast in its role as the California representative of Chang's inventive Asian-American empire. With chef Jude Parra-Sickels at the helm, the kitchen leans on a combination of exclusive ingredients developed in the Momofuku lab and seasonal California produce to keep things fresh while staying true to the spirit of Majordōmo. That ethos is best described as a desire to create dishes that hit at the delicious intersection of multiple cuisines and cultures. \"We try to land in the overlap in a Venn diagram of different cuisines,\" says Parras-Sickles. The large-format short rib, which references both Korean and Texas barbecue in its own singular fashion, is probably the best example, which is why it's been on the menu since day one. Majordōmo always has two crispy rices on the menu: one seasonal and one mushroom, which was developed by the restaurant's chef de cuisine, Tim Mangun. There are upward of eight mushrooms in the dish, including maitakes, enokis, and creminis. The \"Market & Snacks\" section of the menu changes constantly, but one of its mainstays is a lettuce and greens salad. A little gem salad is practically de rigeur on Los Angeles menus, but Parras-Sickels tries to tweak the formula to make Majordomo's version more unique."
    },
    {
      "source_id": "src_the_joy_of_food_2023",
      "publication": "The Joy of Food",
      "title": "Majordōmo",
      "url": "https://thejoyoffood.life/majordomo/",
      "published_at": "2023-05-18",
      "trust_level": "editorial",
      "content": "Majordōmo's location in a warehouse district north of downtown L.A. is recognizably Changish, designed to screw with you before you even walk in the door. You'll undoubtably ask yourself if you're in the right place as you meander down gritty, graffitied back alleyways, passing a soy sauce factory and a parking lot of trash trucks on the way. A neon-colored sign is what you're looking for featuring, of course, a peach. David Chang's bigger, better known global brand, Momofuku, means \"lucky peach\" in Japanese. If you know anything about Majordōmo's chef-owner, David Chang, none of this is surprising. The chef's first venture into California, with a myriad of super-popular restaurants including the Michelin-starred Momofuku Ko in New York, was a long time coming. He's been making inroads ever since opening Majordōmo in 2018, named a Bib Gourmand in the Michelin Guide California and a semi-finalist for Restaurant of the Year from the James Beard Foundation. In L.A., he aims to make food in the spirit of East-Asian and California cuisines. It is a mashup of traditional Korean cooking, European fine dining, and southern California flair. It is an amalgam and represents Chang's evolving appreciation for the region's food, which he once stereotypically reduced to \"figs on a plate.\" Of course, now at Majordōmo, they put fruit on a plate and call it dessert. Vegetables are a highlight at Majordōmo, more so than at Chang's other restaurants."
    }
  ]
}