{
  "place_slug": "melody",
  "sources": [
    {
      "source_id": "src_lamag_2021",
      "publication": "Los Angeles Magazine",
      "title": "How Melody Went from Struggling Restaurant to Pop-Up Hot Spot",
      "url": "https://lamag.com/featured/melody-pop-ups/",
      "published_at": "2021-09-22",
      "trust_level": "editorial",
      "content": "When husband-wife duo Eric Tucker and Paloma Rabinov first opened Melody inside an aging bungalow on Virgil Avenue in 2017, they had a chef, a menu, and a plan. But when the going got tough, they scrapped it all and went in a different direction. What he wound up finding was an old house in Virgil Village that was previously home to Guatemalan restaurant Amalia's. He hired chef Hunter Pritchett, and they developed both brunch and dinner menus. When it opened, Melody was a straight-forward restaurant: vegetable-focused, seafood-centric, French coastal cuisine. It didn't connect. \"We were going down the can hard,\" Tucker recalls. \"We were down to essentially $3,000 dollars in our bank account after paying people. And my wife and I said fuck it, we got to let people go. Let's pay them, and let's let them go. Let's run it as a wine bar with pop-ups. That's our only hope.\" At the end of 2018, Tucker and Rabinov had to strip down Melody to zero food cost. They couldn't afford a staff. For eight months, they ran front of house themselves. VZLA, which serves Los Angeles-inspired Venezuelan food, takes simple sweet corn on the cob and tops it with miso butter, goat cream cheese, chives, and shichimi togarashi. La Sorted's serves expertly crafted brick-oven pies and focaccia sandwiches. You could go to Melody three nights a week and have three different explosive experiences. The pop-up dining wave might seem like a trend, but for Melody it was a survival strategy–and keeping things fresh just keeps working. \"Every restaurant copies each other. Why do we do that?\" Tucker wonders. \"Make something unique. Have an attitude. Have a point of view.\""
    },
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "Melody - Review - Virgil Village - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/melody",
      "published_at": "2023-12-11",
      "trust_level": "editorial",
      "content": "Melody is in a converted bungalow opposite Sqirl, and is good for many situations. Date night? Sit in the dimly lit main room, and get some wine and French-ish food (like a chicken cordon bleu sandwich) to share. Group dinner? There's a big side patio with heaters, blankets, and more wine. After-work drinks? They have a \"wine down\" Happy Hour from 5-7pm (5-11pm on Mondays). With friendly service and a neighborhood feel, it's the kind of place Virgil Village people will end up at regularly for drinks and snacks."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Melody | Bars in Virgil Village, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/bars/melody",
      "published_at": "2025-07-14",
      "trust_level": "editorial",
      "content": "This Virgil Village wine bar has one of our favorite patios in the city—and the ever-changing list of small-producer and organic wines offers a compelling introduction to the now-ubiquitous world of pet-nat."
    },
    {
      "source_id": "src_voyagela_2019",
      "publication": "Voyage LA Magazine",
      "title": "Meet Paloma Rabinov and Eric Tucker of Melody",
      "url": "https://voyagela.com/interview/meet-paloma-rabinov-eric-tucker-melody-east-hollywood/",
      "published_at": "2019-02-20",
      "trust_level": "editorial",
      "content": "Melody is a natural wine bar committed to a \"complete\" experience where food, beverage, design, music, service, and energy are prioritized equally. Our wine focus continues to be small producers both local and abroad. We seek out unusual and encourage customers to be adventurous. Our list is concise, approachable and affordable, never overwhelming and constantly changing to reflect our appreciation for relatively unknown varietals, producers and regions. With regard to food, we are fortunate to host and work with two very special kitchen teams, FOG and Restaurant Adia, who pop-up in our kitchen weekly serving seasonal market-driven fare. When it comes to music, all our friends are deejays! The soundtrack for a given service is never predictable and frequently transmitted live by a deejay or playback of a recorded mix from a previous session."
    },
    {
      "source_id": "src_yahoo_2025",
      "publication": "Yahoo News / Forward",
      "title": "A Virgil Village destination for natural wine and pop-up chefs to close permanently",
      "url": "https://www.yahoo.com/news/virgil-village-destination-natural-wine-193255132.html",
      "published_at": "2025-07-09",
      "trust_level": "editorial",
      "content": "Melody, the Virgil Village bungalow that constantly thrummed with diners who settled into its open-air living room and patio to try burgeoning food pop-ups, swill natural wine and jam to owner Eric Tucker's genre-spanning DJ sets, is set to close permanently on July 12. Open for nearly a decade, Tucker wants Melody to be remembered not for its status as a trendy bar, but for its inclusive environment that thrived on the curiosity of its diners. \"We were that cultural [and] gender safe space where you could be whoever you wanted to be,\" Tucker said, \"exposing people to foods that they maybe never had before and giving chefs those chances to shine.\" Prior to Melody, Tucker ran an Italian restaurant and bar in New York City. He opened Melody with his ex-wife Paloma Rabinov in 2017, and at first, the wine bar followed a typical dinner service format with a California- and French-inspired menu. But less than a year later, Melody's financial struggles prompted him and Rabinov to shift to a rotating pop-up format. They began hosting different chefs for days and weeks at a time — Mexican-Jewish pop-up Malli even earned a two-year residency — with a short house menu offering cheese, charcuterie and other bar snacks. Within the first few years of opening, Tucker began growing Melody's wine list, which consists entirely of natural, low-intervention wines sourced from all over the world, with bottles available for retail purchase and many priced under $80. Tucker described that time as Melody's \"golden years.\" Customers drank bottles of wine in the parking lot while waiting for hours to get in, where it was a \"party every night.\""
    }
  ]
}