{
  "place_slug": "night-market-song",
  "sources": [
    {
      "source_id": "src_theinfatuation_2022",
      "publication": "The Infatuation",
      "title": "Night + Market Song - Review - Silver Lake - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/night-market-song",
      "published_at": "2022-01-14",
      "trust_level": "editorial",
      "content": "Night + Market Song is the second location of LA's best Thai restaurant, and it's every bit as good as the original. 3322 W Sunset Blvd, Los Angeles, CA 90026 · $$$$ Thai · Silver Lake · Save To A ListWebsiteDirectionsInstagram(323) 665-5899 · LAReview · photo credit: Jakob Layman · 8.1 · Brant Cox · January 14, 2022\n\nThe second location of the massively popular Thai joint might not have the party vibes and cocktails like its original Sunset Strip restaurant, but its kitschy vibe is the perfect match for Silver Lake. This is some of the finest Thai food in the city (the menu is nearly identical to the original), in a casual setting suited for almost anything, especially if you want to enjoy your pad see ew with some natural wine.\n\nWarning: The bright space isn't particularly big, so waits can get insane. But that crunchy rice salad and those wings are worth it."
    },
    {
      "source_id": "src_timeout_la_2016",
      "publication": "Time Out LA",
      "title": "Night + Market Song | Restaurants in Silver Lake, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/night-market-song",
      "published_at": "2016-07-15",
      "trust_level": "editorial",
      "content": "Night + Market Song is the seoncd-ever outpost of Kris Yenbamroong's distinctive Thai restaurant brand, known for its party-ready pink-and-orange decor; salt-forward, spicy-heavy cuisine; and excellent natural wine list.\n\nIn the last few years, the buzz around Night + Market brand has dissipated to a sensible murmur. Salt-forward signatures like the party wings and pastrami pad kee mao pair well with a glass of beer or wine, though you can find Thai takeout standards like pad thai, massaman curry and som tum (papaya salad) with their flavors cranked all the way up.\n\nCompared to its siblings in West Hollywood and Silver Lake, Night + Market Sahm offers a little more space and a far less hectic crowd. Other standouts include the nam khao tod (crispy rice salad), moo sadoong (startled pig) and three flavor whole fish, the last of which is available only for dine-in customers."
    }
  ]
}