{
  "place_slug": "nnaka",
  "sources": [
    {
      "source_id": "src_michelin_guide_2024",
      "publication": "Michelin Guide",
      "title": "n/naka's New Chapter is a Beautiful Metaphor for Aging with Grace",
      "url": "https://guide.michelin.com/us/en/article/features/n-naka-redesign-california-two-michelin-star",
      "published_at": "2024-09-13",
      "trust_level": "editorial",
      "content": "California Chef Interview Editor's Pick Two Michelin Stars ... After 13 years, this Los Angeles Japanese restaurant has been reimagined to resemble a Japanese tea garden infused with California culture. After a redesign, n/naka is softer and more aligned with the ethos of Japanese heart and California mind. \"It feels like all the clunkiness that was there before has smoothed out, and the rough edges have become softer,\" says Niki Nakayama, chef/owner of n/naka. \"I equate it to a person as when we age, we get softer in certain ways and find a sense in one's self.\" As Nakayama puts it, she and co-chef/owner (and partner in life), Carole Iida-Nakayama, are \"no spring chickens\" — a notion that's clear from the duo's One MICHELIN Star, appearance on Chef's Table, and legacy standing in the Los Angeles dining scene. Even though they have been painted as pioneers among female chefs, Iida-Nakayama says they've outgrown this narrative and there are more sides to showcase now. One of the most notable changes is the new position of the wine cellar. Formerly the focal point upon entrance, it's been replaced by a curved, lighted wall and a shoji screen. Since opening in 2011, the wine wall, says Iida-Nakayama, emerged as a symbol of the restaurant and of their role as women in the kitchen. Although the wine wall is a part of their story, and still lives in the restaurant (now on a back wall), she emphasizes \"it was time to put that story to rest; the focus shouldn't be on that anymore.\" Now, the first thing guests perceive is a soothing palette of cool grays along the tobishi-style entrance path of hand-selected California stone. The new layout guides diners into the restaurant instead of planting them at the center of the dining room. \"It lets guests slow down and reframe their mind before going into the dining space,\" says Nakayama on this intentional decision. The entrance is a riff on the traditional Japanese tearoom where the entire walkway is dedicated to minute details. The slate walls are a nod to Japanese shikkui plaster while the curved lines evoke California's Mission architecture. Since the path is so minimal, \"it allows guests to notice details but not have anything forced upon them,\" says Iida-Nakayama as they begin to \"let the outside world go\" and focus on what's before them. Actually, the first detail shines prior to entering the restaurant; a hand forged door handle by metal craftsman Nagai Toshiaki, founder of Cotrik Studio in Tokyo. The owners discovered Toshiaki and became enamored with his process of heating the hammer before banging it against natural stone so that the hammer is imprinted with the texture of this stone before he continues to inflict that same natural print on the handle. Details extend to the dining room where tsuboniwa, or courtyard gardens, are visible through the windows, and florals are rotated weekly by an Ikebana artist; both aspects that Nakayama says, \"pronounce nature since we don't have windows or access to outside.\" The rounded chairs replace sharp, white edges for lustrous, California black walnut and cater to comfort for longer seatings; the tables line up with the grains of each other. Even though they're all separated, this was a detail that was noticed when two tables were pulled together during friends and family, which Iida-Nakayama says made her \"feel really proud of the space.\" One of the more personal additions is the main dining room's center wall of handmade washi paper by Wataru Hatano. \"Carole put up the wallpaper with the designer [Oyamatsu] by hand,\" beams Nakayama on this special element, adding that the visual texture makes the room feel crafted as opposed to just a minimalist space."
    },
    {
      "source_id": "src_michelin_guide_2019",
      "publication": "Michelin Guide",
      "title": "MICHELIN Guide California 2019 Selection",
      "url": "https://guide.michelin.com/us/en/article/news-and-views/michelin-guide-california-2019-results",
      "published_at": "2019-06-05",
      "trust_level": "editorial",
      "content": "Six new restaurants in Los Angeles have been awarded the two-star status in the MICHELIN Guide California 2019: chef Niki Nakayama's n/naka kaiseki restaurant in Culver City; Michael Cimarusti's seafood-driven Providence in Hollywood; Aitor Zabala and José Andrés's Somni inside the SLS Beverly Hills; Sushi Ginza Onodera in West Hollywood; Urasawa, which inspectors deem \"an exemplary sushi temple\" in Beverly Hills; and chef Jordan Kahn's highly-innovative Vespertine in Culver City. And in San Francisco, chef Srijith Gopinathan's Campton Place in San Francisco's Union Square neighborhood, has been elevated from one to two MICHELIN stars. The 2019 MICHELIN Guide California also features 27 new restaurants with a one-star distinction, 18 of which are in Los Angeles."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "When it comes to service, N/Naka comes close to perfection - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/nnaka",
      "published_at": "2025-05-14",
      "trust_level": "editorial",
      "content": "On our most recent visit to N/Naka, we sat down at 8:45pm and walked out at 12:08am. But at no point did the 13-course kaiseki meal in Palms drag. One moment we were picking out a cup for warm rice milk, the next we were eating uni and crispy shiso leaves like chips and salsa. Everything at this Japanese restaurant of Chef's Table fame operates with pinpoint precision, like an acupuncture session where you're treated with dashi and yuzu instead of a dozen carefully placed needles in the bottom of your feet. Put your spoon down after slurping dashi, and it's already been replaced with a fresh one. Take one second to admire the room's tsubo-niwa, and there will be four glistening cuts of sashimi that snuck onto your plate while you were staring at the miniature indoor Japanese garden. That's the cumulative effect of a waitstaff that, according to our server, have mostly been at N/Naka continuously since it opened in 2011. Calling N/Naka expensive would be a bit of an understatement. At $365 per person—before tax, tip, and something from the well-curated sake list—it's among the priciest tasting menus in LA. It also takes serious commitment to book a table. If you think demand has thinned since owner-chef Niki Nakayama popped up on Netflix a decade ago, think again. Arrive one minute late to their Sunday reservation drops and you'll be out of luck. Is it all worth it? If you can manage the price and like the sound of a finely polished, largely traditional kaiseki meal with faultless service that blows other high-end restaurants out of the water, then our answer is an unequivocal yes. No restaurant is perfect, but N/Naka gets way closer than most. N/Naka releases a week's worth of reservations a month in advance every Sunday at 10am online. These sell out quickly, so act fast."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "When it comes to n/naka, believe the hype",
      "url": "https://www.timeout.com/los-angeles/restaurants/naka",
      "published_at": "2025-03-01",
      "trust_level": "editorial",
      "content": "As of writing, L.A. is awash in expensive tasting menus, an understandable post-pandemic move, given the steadier stream of cash flow and the ability to distill a restaurant team's culinary chops into a single awe-inducing evening. The variety is wonderful for those of certain means or flagrant disregard for personal savings. But if you can only afford one, make it n/naka in Palms. The Japanese restaurant delivers a nontraditional kaiseki meal that (unlike its lackluster follow-up) excites, delights and even soothes across every aspect; in short, it lives up to the hype and the bloodsport level effort involved in snagging a reservation. What kind of effort? For several weekends in a row, my attempt to get a table for this review plagued me the moment I woke up every Sunday morning—the one day a week that n/naka releases its month-in-advance reservations. Fourteen years, one Netflix show and a few Michelin stars later, Niki Nakayama's modern kaiseki restaurant demonstrates its staying power. For high-profile restaurants that survive into an uncertain middle age, the passage of time is a fickle and unknowable beast. Wait long enough and your protégés (and copycats) might usurp you in the end, your own enduring influence taken for granted by flighty diners hungry for novelty. But stay the course a little bit longer, as in the case of n/naka, and you just might have the chance of becoming a timeless classic. The chef-owner's 14-year-old modern kaiseki restaurant—of French tire company and Chef's Table fame—remains an indispensable part of the city's fine dining scene. This review was originally published on July 20, 2022 and has since been been updated to reflect changes in price and n/naka's number of Michelin stars."
    },
    {
      "source_id": "src_timeout_la_2025_guide",
      "publication": "Time Out LA",
      "title": "21 Best Japanese Restaurants in Los Angeles for Sushi and Beyond",
      "url": "https://www.timeout.com/los-angeles/restaurants/best-japanese-restaurants-in-los-angeles",
      "published_at": "2025-10-24",
      "trust_level": "editorial",
      "content": "Nakayama focuses her talent on kaiseki: a classical style of Japanese cooking that dictates a specific progression of textures, temperatures, tastes and seasonal ingredients. À la carte is not an option, and when every dish is this good, that's okay by us. n/naka typically offers a 13-course tasting menu ($365) with a vegetarian option, plus wine and sake pairings. A newer renovation has given the dining room a sleeker look—with a requisite price bump to match—but n/naka still delivers the most delicious, wonderfully serene dining experience in the city. Years in, these are still some of the hardest reservations to land in all of Los Angeles. It's best to follow along on Instagram for announcements and watch n/naka's Tock page like a hawk. Time Out tip: If you're trying to book a reservation for a party of four, you no longer have to go through the whole rigamarole to book a table. Now, you can book up to three months in advance by emailing info@n-naka.com."
    }
  ]
}