{
  "place_slug": "nsoto",
  "sources": [
    {
      "source_id": "src_timeout_2022",
      "publication": "Time Out LA",
      "title": "Review: Mid-City's n/soto isn't worth the time, money or hassle",
      "url": "https://www.timeout.com/los-angeles/restaurants/n-soto",
      "published_at": "2022-05-18",
      "trust_level": "editorial",
      "content": "It gives me absolutely no pleasure to say this, but a visit to the newly opened n/soto—the sophomore effort from the n/naka team—simply isn't worth the financial cost (high) or commitment (significant). As of writing, Niki Nakayama and Carole Iida-Nakayama's highly anticipated eatery has completely booked 28 days out, forcing wannabe patrons who'd rather not jockey for walk-in bar seating to plan for a \"casual\" izakaya meal almost a month before you actually visit. Given the extreme difficulty of booking the pair's original, two Michelin-starred kaiseki restaurant, it's hard to imagine this almost reservation-only state of affairs alleviating anytime soon at n/soto.\n\nThe food: In a sharp deviation from n/naka's controlled kaiseki experience, n/soto's seasonal menu spans nine à la carte sections: starters, salads, raw, nigiri, hand rolls, kushiyaki (grilled skewers), agemono (deep-fried), yakimono and mushimono (grilled/steamed), and shokuji (rice dishes), plus dessert offerings. Highlights include the crudités with mochi flatbread, the agedashi mochi and the Okinawan yam pudding. \n\nThe drink: Sake, wine, cider, beer, cocktails and a few non-alcoholic options. Beverage director Jason Lee's list gives both international and California wines equal treatment, with locally leaning beers. Time Out tip: Avoid the nigiri, hand roll and pretty much all of the raw section; while adequate, they're still no match for any of the city's excellent sushi restaurants.\n\nFor the cost of an average bill at n/soto—in the $200 to $300 range for two guests, including tip—this glaring lack of menu-wide consistency can easily be ameliorated at a half-dozen other upscale Japanese small plates restaurants, including Brentwood's Imari, the Arts District newcomer Kodo, and Little Tokyo's longtime, worth-its-advance-planning Kinjiro. Granted, all three of these, like n/soto, deviate from the traditional izakaya's casual roots, and none carry the prestige attached to Nakayama and Iida-Nakayama. Still, the overbearing weight of years of awards-level recognition creates certain expectations of greatness at n/soto, where even the minimalist-learning indoor-outdoor space invokes aesthetic indifference rather than the designer's most likely hoped-for sense of serenity and calm. For the average Angeleno of finite dining budget, however, these critical accolades matter little, especially in light of so many other wonderful options at the same quite lavish price point."
    },
    {
      "source_id": "src_infatuation_2022",
      "publication": "The Infatuation",
      "title": "N/Soto - Review - Mid-City - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/n-soto",
      "published_at": "2025-04-09",
      "trust_level": "editorial",
      "content": "You might know N/Naka as the fine dining kaiseki spot that 1) was featured on Chef's Table, 2) serves an incredible tasting menu that will cost you several hundred dollars per head, and 3) requires reservations that must be booked at least a month in advance. With all that in mind, you could describe N/Soto, the izakaya in Mid-City from the same chefs, as the more casual cousin of N/Naka—the service is less formal, the a la carte menu is less expensive, and it's far easier to nab a table.\n\nHowever, much like if we stood next to Danny DeVito and said we were tall, that description is really only true by comparison. By any reasonable standard, N/Soto is not particularly causal nor particularly cheap, but it does serve sublime, highly refined Japanese food in a cool and comfortable space. And since it's unlikely you'll be booking N/Naka anytime soon, it's a great way to sample the same level of sophistication at a substantially reduced cost.\n\nThe large, 50-odd item menu at N/Soto is made up of nine sections broken out by cooking method. About half are izakaya standards done straight up—chicken karaage, cucumber and seaweed salad, blue crab hand rolls, and grilled skewers—while the remainder are more distinct, cheffy creations. Among the latter group, there are some clear winners: chewy mochi flatbread with a side of eggplant dip and salted creme fraiche, miso-slathered bone marrow with pickled onions, and a miniature, one-bite flavor bomb of minced toro and caviar on sushi rice. But it's a testament to the kitchen's skill that even some of the more basic-sounding dishes elicit loud wows too, from the perfect ruby cubes of baby bluefin tuna tossed with pickled wasabi stems, to steamed clams swimming in an oceanic dashi broth, to basically anything the kitchen decides to fry in crispy, lighter-than-air tempura batter.\n\nThe best way to think about N/Soto is like one of those old-timey optical illusions with the caption \"young girl or old woman?\"—it all depends on your perspective. Although billed as an izakaya, it doesn't have much in common with beer-swilling pubs. It's more suited for celebratory dinners, or splashy date nights where, with a round or two of drinks and enough plates to make a meal, you'll spend close to $150 per person. That's far from casual, but so is the polished, high-level dining experience that this restaurant is putting out.\n\nWe usually skip the sushi and handrolls at N/Soto, simply because they don't stand out much from what you'd find at most good sushi bars, and there's too much else to try anyway. We make an exception, though, for the toro osetra nigiri: a nugget of warm rice topped with chopped fatty tuna, wasabi, red onion, and a thimbleful of caviar. At $21 for two pieces, it's not cheap, but it's the perfect ultra-luxurious appetizer condensed into a single, stunning bite.\n\nSimple and gratifying, these char-kissed skewers showcase the timeless Japanese art of grilling tasty things on sticks. There's nothing groundbreaking happening here, but ordering a few is a delightful way to fill out your dinner. Favorites include the juicy bacon-wrapped tomatoes, unagi dotted with yuzu kosho, and the beef shoulder with wasabi—just be careful not to go overboard, as the price per stick adds up fast.\n\nNo izakaya experience would be complete without a little drinky-drink on the side, and in the case of N/Soto, it's the unique list of cocktails that we gravitate toward first. Though they shift slightly with the seasons, the best ones tend to highlight sake and shochu as well as fortified wines, making them quite refreshing and lower in ABV. If you see one that includes kakigori, go for it—the bar staff will whip out an antique shaved ice machine and top your drink with fruit-flavored snow cranked to order.\n\nIt's a good thing we didn't know coffee jello existed when we were kids, because we'd have probably never slept. This elegant and not-too-sweet dessert—basically a mashup between Japanese-style coffee jelly and the famed butterscotch budino at Osteria Mozza—is the best way to end a meal here. Along with caffeinated cubes of gelatin, it's got creamy coffee pudding, non-dairy whipped cream, and a superb sweet-salty miso butterscotch sauce."
    },
    {
      "source_id": "src_infatuation_2022_best_new",
      "publication": "The Infatuation",
      "title": "LA's 12 Best New Restaurants Of 2022",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-new-restaurants-la-2022",
      "published_at": "2022-12-07",
      "trust_level": "editorial",
      "content": "Here's the thing about N/Soto: while it's more casual than its tasting menu sibling restaurant, N/Naka, this upscale izakaya in Mid-City isn't exactly a place you slide into on a weekday night. And, frankly, we're fine with that—because sitting at N/Soto's moody, low-lit bar enjoying a shochu cocktail, some grilled wagyu skewers, and a bowl of sake-steamed clams is a chance to sample the same sophisticated Japanese cooking for a substantially reduced cost, and without months of waiting for a reservation. Everything about a meal at this zen-like hideaway feels considered, from the tiny dab of caviar on top of the chopped toro nigiri to the tempura squid legs that come with chile-dusted mayo. There are plenty of great izakayas in LA, but none of them have the power to melt away the stress of the outside world like N/Soto."
    }
  ]
}