{
  "place_slug": "ohana-superette",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Ohana Superette - Review - Silver Lake - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/ohana-superette",
      "published_at": "2025-10-06",
      "trust_level": "editorial",
      "content": "With its minimalist logo and sleek, wood-paneled dining room, Ohana Superette blends in with the high-end boutiques and perfumeries along Sunset. But in this case, they're offering something that Silver Lake actually needs more of: very fresh, very interesting poke. Ohana closed during the pandemic and reemerged one door over from its former home, right next to Bodega Park. Both spots have the same owner, which becomes apparent in Ohana's small, Korean-inflected menu (sides like crab mac salad and ponzu glass noodles are listed as banchan, for instance). Tuna poke is the focus here, and you should prioritize the one with sea salt and shiso over their more popular shoyu flavor—the pepperiness of the shiso adds a bigger punch. And sure, you're not getting massive scoops of poke here (see Jus' Poke for that), but the excellent quality of the fish and its unique sides make Ohana a great casual lunch option, and a fine addition to LA's poke shop scene."
    },
    {
      "source_id": "src_eater_la_2025",
      "publication": "Eater LA",
      "title": "Ohana Superette Review",
      "url": "https://la.eater.com/dining-report/294973/ohana-superette-review",
      "published_at": "",
      "trust_level": "editorial",
      "content": "Silver Lake's poke shop makes a case for heading away from the shore, with a warm, wood-clad dining room centered around a marble ordering counter the color of a matcha latte before it gets mixed. From the team behind Bodega Park, it returns in its own permanent home after pausing its run at sandwich shop Black Hogg in 2020. Poke bowls—available as set choices or build-your-own—dominate the menu, complemented by Spam musubi and sides like seaweed salad and kimchi cucumber. The build-your-own bowl lets you choose one or two poke like shoyu tuna, chile garlic shrimp, spicy tuna, or vegan beet poke over a base of white rice or chopped kale. The bowls are on the pricier side ($19 for the regular) but servings are generous, and the fish is as fresh as it comes."
    },
    {
      "source_id": "src_latimes_2025",
      "publication": "Los Angeles Times",
      "title": "Fan-favorite poke returns in Silver Lake with a new space",
      "url": "https://www.latimes.com",
      "published_at": "2025-07-25",
      "trust_level": "editorial",
      "content": "A Silver Lake poke destination is back after five years away. Ohana Superette, the casual, daytime-only poke shop from husband-and-wife team Eric and Miriam Park, recently returned with its own space and thoughtful, traditional poke. \"I always try to do my version but not mess with it too much,\" chef and co-owner Eric Park said, \"and with the poke I just want to keep it super authentic.\" Spam and shiso musubi are made fresh daily at Ohana Superette. Scoops of ginger-and-soy-marinated tuna, garlicky poached shrimp, macaroni salad and ponzu glass noodles rest on short-grain Koshihikari rice or seaweed salad. The musubi features Spam that's slow-cooked in brown sugar for an almost brûléed crust. Sides of kimchi are made fresh throughout the day to retain crunch. Ohana Superette's first iteration launched in 2015, inspired by the Parks' frequent family visits to Hawaii, and the operation ran as half of a dual concept out of their former sandwich shop, Black Hogg. They closed both restaurants in 2020 when the pandemic began, and though they later opened popular cafe Bodega Park in the space, Eric Park said he always wanted to reprise Ohana Superette in its own form. \"Almost every week there were people like, 'When's Ohana coming back?'\" he said. \"And then one month Miriam's like, 'Let's just open Ohana if a space opens up.'\" When the hair salon next door closed and its space became available, the couple jumped at the opportunity. It took two years to permit and flip the salon into a restaurant, even with a pared-down kitchen that doesn't allow for much cooking. This time around, Park said, he streamlined the menu with fewer add-ons and toppings in an attempt to keep things more traditional — though a few less-traditional specials might sneak in occasionally. Ohana Superette is open Tuesday to Saturday from 11 a.m. to 4 p.m."
    }
  ]
}