{
  "place_slug": "petit-ermitage",
  "sources": [
    {
      "source_id": "src_michelin_guide_2024",
      "publication": "MICHELIN Guide",
      "title": "Petit Ermitage - Los Angeles Area",
      "url": "https://guide.michelin.com/us/en/hotels-stays/los-angeles-area/petit-ermitage-5537",
      "published_at": "2024",
      "trust_level": "editorial",
      "content": "Though the reference is likely lost on some of its visitors, the Petit Ermitage isn't named for just any old hermitage. Here in the heart of West Hollywood is a boutique hotel that doubles as a tribute to Catherine the Great's Hermitage Museum in St. Petersburg (that's the one in Russia, but you knew that). Come for the heavy atmosphere of Tsarist decadence, and stay for the poolside cabanas.\n\nIn actual fact it's pitched at the neo-bohemian crowd, rather than the aristocracy, who'll likely confine themselves to Beverly Hills. West Hollywood is for a more artistic crowd, one that'll appreciate the layers of irony involved in a California hotel that's an homage to a 19th-century Russian version of Venice (the one in Italy, but you knew that too).\n\nThat's not to say these suites aren't comfortable, because they are; from the demi-suites on up to the Masters Quarters they're spacious and plush, the latter serviced by personal butlers.\n\nDiversions include yoga classes or spa treatments delivered en suite, and the jewel in the Petit Ermitage's crown is the saltwater rooftop pool. By day it's the place to catch a ray or two, but by night, in keeping with local custom, it turns into a lounges space full of nooks and crannies, from the private cabanas to the gardens, a haven for butterflies and hummingbirds.\n\nA typical Los Angeles hotel this most certainly isn't."
    },
    {
      "source_id": "src_oyster_2025",
      "publication": "Oyster.com",
      "title": "Petit Ermitage Review: What To REALLY Expect If You Stay",
      "url": "https://www.oyster.com/los-angeles/hotels/petit-ermitage/",
      "published_at": "2025-05-19",
      "trust_level": "editorial",
      "content": "The 80-room, upscale Petit Ermitage is an exercise in off-beat but high-end bohemianism. Artistic and international flair is everywhere: hand-trowled Venetian plaster covers the walls, and Moroccan and South American tiles and hand-woven Turkish rugs line the floors.\n\nThe boutique hotel's best feature is its private rooftop area, with a heated saltwater pool, quirky cocktail bar, stylish fireplace deck, and peaceful garden, where guests can enjoy breakfast, brunch, lunch, and dinner.\n\nLarge suites (most with working fireplaces and pull-out sofas, and some with kitchenettes) feature 50-inch flat-screen TVs, minibars, beds with bamboo mattresses, and loads of ornamental touches. Travelers who prefer a trendy, contemporary aesthetic may want to compare rates with the Andaz West Hollywood and Mondrian Los Angeles nearby -- though neither have in-room kitchenettes or fireplaces, and rooms are larger here.\n\nOverall, the Ermitage meets its goal of feeling like a home away from home. It calls itself an all-suites hotel because even though most rooms don't actually feature a separate bedroom, they all feel spacious, and many boast well-stocked kitchenettes. Even the lowest-level rooms, the 350-square-feet Demi Suites, feature a wet bar or kitchenette and two-person dining table. The intimate public spaces, tiny lobby, and multitasking staff add to the homeyness; in many ways, the Ermitage resembles a bed-and-breakfast (just minus the free morning meal; only Masters Quarters Suites include free breakfast). Formerly known as Hotel Le Petit, the Ermitage markets itself as the \"fashionable alternative to the Chateau Marmont and the Sunset Marquis,\" which are also in West Hollywood.\n\nThe Ermitage's restaurant, Butterfly Bar, is like the hotel itself: small but classy. Buffet breakfast includes French press coffee and fresh-squeezed OJ; breakfast is included in rates for the Masters Quarters Suites. For breakfast, brunch, lunch, and dinner, Executive Chef Russell Platoff's global, health-focused menu hints at Japanese, Italian, and Egyptian cuisines, and features local organic produce and herbs and vegetables from the hotel garden. Guests can eat indoors or outside in the rooftop garden amid not just flora but some fauna, as well -- Petit Ermitage's garden is sanctioned by the National Wildlife Federation as a butterfly and hummingbird sanctuary. If it's too chilly for al fresco, there's also the atmospheric Masters Lounge, which has a fireplace, a candle-covered painted piano, and colorful hand-embroidered Mexican pillows."
    },
    {
      "source_id": "src_a_hotel_life_2023",
      "publication": "A Hotel Life",
      "title": "Petit Ermitage Review - West Hollywood",
      "url": "https://www.ahotellife.com/hotels/petit-ermitage-3/",
      "published_at": "2023-05-05",
      "trust_level": "editorial",
      "content": "AT A GLANCE: Petit Ermitage has been an L.A. institution for the cool kids of the world since it opened in 2009. Exquisitely designed with a thoughtful approach to hospitality, the West Hollywood hotel is a stone's throw away from the city's hotspots. While the rooms are spacious, Petit Ermitage's roof, with a saltwater pool and a fireplace, is a true stunner and the definition of a watering hole. Warm and so so fun, keep this romantic, pet-friendly hotel on your radar.\n\nFull of soul and personality. Warm and so fun at the same time. A home away from home. Petit Ermitage is in L.A.'s dream location of West Hollywood. Just perfect. Culture is everywhere in this one-of-a-kind hotel. Good music at all times. A perfect playlist for each moment of the day, and I find that very rare in a hotel and I personally appreciate it so much. Perfect, and there was so much variety! The produce is also excellent. I especially remember the linguini and the avocado toast for breakfast.\n\nOne of the highlights is the cocktails. I consider myself a connoisseur of espresso martinis, and here you can taste one of the best I've ever tried. The great atmosphere at night makes it one of the hot spots for L.A. cool people to meet.\n\nPetit Ermitage is in a very calm and pleasant spot. Close to the best neighborhoods of L.A. This was our first visit to the city, and West Hollywood is definitely the place to be."
    },
    {
      "source_id": "src_huffpost_2017",
      "publication": "HuffPost Life",
      "title": "A Hidden Treasure: Petit Ermitage Los Angeles",
      "url": "https://www.huffpost.com/entry/a-hidden-treasure-petit-e_b_560222",
      "published_at": "2017-12-07",
      "trust_level": "editorial",
      "content": "What manner of place is this? Well, it's a unique boutique hotel hidden away on a quiet residential street in West Hollywood. This is the world of the Petit Ermitage.\n\nLike it's namesake, the museum The Hermitage in Russia, the hotel contains a fascinating collection of art and furnishings. The hotel is operated by the brothers Ashkenazy. The Ashkenazy family has a rich history in managing luxurious hotels. But unlike some of the other hotels the family has run, the Petit Ermitage, offers the luxury without the five star price.\n\nThere's everything from Indonesian wattle fencing, to a shabby chic table salvaged from the roadside on Pacific Coast Highway. And it works. The combination of the art, the views, the food, and the pool all conspire to deliver a unique experience to the visitor.\n\nMr. Askenazy notes that many local Los Angeles residents check into the hotel as an escape just as visitors from New York and Europe do. Some local residents have even been invited to enjoy the hotel as a private club. As club members, guests can come and enjoy the rooftop pool, the bar and other amenities without checking in.\n\nAlthough it's budget friendly, the Petit Ermitage is not a budget experience. You would not know this is a hotel from passing by it on the street since the facade discreetly blends into the neighborhood. It looks like an apartment building, which at one time it was. Inside the hotel is luxurious. There are Ertes hanging on the walls that most of us have only seen in vintage collections of Harper's Bazaar magazine covers. The Ertes are only a part of the hotel's extensive and beautiful art collection. Art decorates every part of the hotel."
    },
    {
      "source_id": "src_lux_magazine_2024",
      "publication": "Lux Magazine",
      "title": "Petit Ermitage, West Hollywood, Los Angeles Review",
      "url": "https://www.lux-mag.com/petit-ermitage-west-hollywood-los-angeles-review/",
      "published_at": "2024-08-23",
      "trust_level": "editorial",
      "content": "If you didn't know about the Petit Ermitage, you would likely walk past this discreet hotel, in the heart of West Hollywood, without taking a second look. Once you walk in, it's a completely different experience. The hotel exudes an enchanting blend of bohemian chic and European elegance.\n\nThe rooftop, a dreamy oasis, is the crown jewel with its lush garden, cosy fireplaces and red and white striped double lounge chairs surrounding the pool area. Art lovers will be delighted by the curated collection that adorns the hotel, including works by Miro and de Kooning. The ambiance is intimate and full of character—a perfect escape from the ordinary.\n\nThe rooftop pool at Petit Ermitage is one of the best spots for people-watching in LA, especially because it's the city's only European-style pool.\n\nThe rooms at Petit Ermitage are a delightful mix of vintage charm and modern comfort. The Belle Suite, where I was staying, had a floral pink wallpaper, complimented by plush green rugs. The light up vanity and fireplace create a sense of warmth that makes you feel right at home. The bathrooms are equally quirky, with vintage tiles and well-chosen amenities that add to the overall boutique experience.\n\nThe rooftop restaurant offers dishes that blend Mediterranean influences with fresh, local ingredients. The ambiance is enhanced by the garden surroundings, twinkling lights, and the soft hum of conversation. One standout on the breakfast menu is the breakfast burrito—an absolute must-try. Packed with fluffy scrambled eggs, and fresh avocado, all wrapped in a perfectly grilled tortilla, it was the best way to start the day in LA."
    }
  ]
}