{
  "place_slug": "pizzeria-sei",
  "sources": [
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "Pizzeria Sei – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/pizzeria-sei",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Thick or thin. Sauced or left bare. Traditional or irreverent. Pizza is the shape-shifter of the culinary world, with seemingly endless variations and an insatiable appetite for the newest iteration. Enter Pizzeria Sei, where individual pies are made with a Japan-meets-Italy flair. A handful of diners perch at the counter to watch the chefs hard at work prepping these savory treats. Wondering where the Japanese comes into play? It's the cornicione—with its trademark puffy pinch with a mochi-like chew. White pies are more offbeat, as in the Bismarck topped with a poached egg, while red pies lean more Italian. The Margherita is a go-to, topped with simple tomato, basil, fior di latte and olive oil, then cooked in a gas- and wood-fired oven."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "We went to L.A.'s first Tokyo-style pizza omakase. Here's what we thought.",
      "url": "https://www.timeout.com/los-angeles/news/we-went-to-l-a-s-first-tokyo-style-pizza-omakase-heres-what-we-thought-061224",
      "published_at": "2025-09-11",
      "trust_level": "editorial",
      "content": "Updated September 2025: Since we first tried the omakase-style tasting menu at Pizzeria Sei in June 2024, the Pico Robertson pizzeria has been crowned ninth-best in the world. Outside of Italy, Japan and a short-lived pop-up in the Philippines, the idea of a pizza omakase, or chef's tasting menu, hasn't exactly caught on across the globe. Until quite recently, Americans needed to travel outside of the country to experience the likes of Pizza Bar on 38th at the Mandarin Oriental, Tokyo and Pepe in Grani just outside Naples. Now, L.A. is home to one of the country's only pizza tasting menus, courtesy of William Joo, the Korean American pizzaiolo behind Pizzeria Sei in Pico-Robertson. It's evident from the beginning of the meal that Joo, who previously worked at Ronan and Pizzana, has put significant thought into crafting L.A.'s first true pizza omakase. The first welcome bite consisted of a Korean-style amberjack ceviche served out of a pizza dough cone made with rouge de bordeaux wheat flour from the Tehachapi Grain Project, an organic farm in Central California focusing on preserving heritage wheat varieties. From there, Joo offered nine different slices of pizza, including a slice for dessert. The first pizza slice was a marinara made with imported Corbarino tomatoes, directly inspired by Susumu Kakinuma, the legendary founder of Tokyo's Seirinkan. The warm, sweet cherry tomatoes gently popped in my mouth, offset by little more than extra virgin olive oil, Sicilian sea salt, garlic, basil and a touch of oregano. While I don't recall much from my visits to Pizza Hut, and thus cannot make a direct comparison, the complex, umami-rich bites were more than satisfying. The most colorful slice of the bunch came next: the Hailey 1.0, a pizza named after Joo and So's young daughter. Zucchini blossoms, zested citrus, fresh basil and cherry tomatoes marinated in champagne vinegar translated into bites that felt like you'd just run through a lush garden in the Italian countryside. After such a delightful slice, it was a little disappointing to receive a premium version of Sei's classic margherita—and after four slices and a medium-sized cone made of pizza dough, I was starting to get a little full. While I'm sure Joo will work out the portion sizes as Sei's pizza omakase continues to run, I can tell you now the average diner will likely struggle to finish all nine slices plus the welcome bite."
    },
    {
      "source_id": "src_the_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Pizzeria Sei - Review - Mid-City - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/pizzeria-sei",
      "published_at": "2025-07-06",
      "trust_level": "editorial",
      "content": "Pizzeria Sei is a pizza dispensary. It's a sit-down restaurant with a short menu, sure, but really, it's just a bare room with a few small tables, a line of chairs wrapped around a high-top counter, and a big pizza oven on display. You come here for one thing: incredible blistered Neapolitan pies straight out of the oven. It's a straightforward assembly line that churns out some of LA's best pies, which is why this Pico-Robertson spot is a must-try in this city's crowded pizza scene. Dining in means front-row seats to the pizza assembly line, and after you order, everything happens quickly. By the time your water gets refilled, whatever small bites you order hit the table, like the colorful giardiniera or buttery slices of prosciutto cotto or mortadella on the salumi plate. The pizzas arrive shortly after, still smoking hot after traveling ten feet from the oven. Pizzeria Sei's style is inspired by Tokyo's Neo-Neapolitan movement, which mostly means a little less sauce, a touch more salt on the crust, and a crispier/chewier bite. But it's hard to pick out these distinctions unless you squint. What we do know is that this spot knows how to make incredible pizza, wherever the inspiration comes from. Beyond its a la carte menu, Sei offers a special 10-course \"omakasei\" tasting for $150 every other Tuesday, a three-hour celebration of carbs and pizza creativity that requires a separate reservation (with just 16 seats per dinner, it's one of the toughest reservations in town). The menu might include bread pockets stuffed with fried cod and uni, braised wagyu tongue sandwiches, and slices with tom yum-infused sauce and seared yellowfin tuna. At Sei, there's no romantic lighting, supplemental entrees, or extensive wine list—which means whoever you bring here better feel moved by the art of pizza-making. The barebones space mirrors the simple concept and feels like an echoey, unused gallery. Seating is limited, so you're better off bringing just one other person rather than the entire family. And although walk-ins are welcome, they're also risky. The best way to avoid a wait is to make a reservation—which makes sense once you step inside the shoebox of a space. You come to this barebones pizzeria to savor perfect, char-speckled crusts and tart marinara. And once you've wiped the crumbs off your lap and seen the light at the back of the oven, it's time to head out because someone is waiting for your spot at the counter. Reservations are released two weeks out on Mondays at 10am. Pizzeria Sei's 10-course \"omakasei\" costs $150 and is held every other Tuesday night. No matter how much pizza you think you can eat in one sitting, the evening involves a lot of carbs, so there's no shame in not finishing your crust (the chef even tells you so). Dinner starts with a few smaller bites like salmon crudo in lambrusco vinegar and chewy-crisp focaccia before moving on to heartier dishes like a potato and creme fraîche slice with caviar and a wagyu tongue sandwich with ox bone broth for dipping. Reservations are notoriously tough, but the experience is a chance to taste Sei's top-tier pizzas at their most creative."
    },
    {
      "source_id": "src_resy_blog_2024",
      "publication": "Resy Blog",
      "title": "Pizzeria Sei Strives For Perfection in Every Pie",
      "url": "https://blog.resy.com/2024/06/pizzeria-sei-los-angeles/",
      "published_at": "2024-06-14",
      "trust_level": "editorial",
      "content": "You could say I have a problem: there isn't a week that goes by when I'm not trying a new pizzeria in Los Angeles. My particular burden also tells you that L.A. is in the middle of a major pizza boom, where you can discover a different style of pie on seemingly every corner: New York, Sicilian, Roman, Neapolitan, Detroit, Chicago, New Haven, the list goes on. But when my pizza-tasting journey brought me to the only Tokyo-style pizza joint in the city, I quickly realized that I would have to eschew some new openings and return to this one again and again: Pizzeria Sei. A little background: Rooted in Neapolitan tradition, Tokyo-style pizza came about in 2007, when chef Susumu Kakinuma opened Seirinkan in the Nakameguro neighborhood of Tokyo. The restaurant pays homage to Kakinuma's time in Naples, where he studied everything he could about the world's best pies. Pizzeria Sei is, as far as I know, the only place making pizza like this in L.A. And now that they're on Resy—and chef-owner William Joo is debuting an exciting new pizza omakase—I knew I had to check in on the space. Joo is a quiet chef, a native-born Korean who moved to L.A. as a teenager and originally wanted to be a food critic. Joo never went to cooking school, at least not in the traditional sense. He staged for over a year at Providence with chef Michael Cimarusti, worked under Gino Angelini at Angelini Osteria for five years, and has put in stints with Daniele Uditi at Pizzana and Daniel Cutler at Ronan. \"Around the time I was at Ronan, I saw the Netflix show 'Ugly Delicious' with David Chang on Seirinkan and I was like, wow, it's so cool that you can develop your own style,\" said Joo. \"It's unique, but the core is so similar to the traditional Neapolitan. So, I thought, okay, I'm gonna try to do something similar.\" \"At the beginning, I focused on copying [Seirinkan's] style, and I bothered a couple workers over there asking them how they make it. But I couldn't get any of their flour here, so I started with generic flours. To be honest, I was still learning, and some days I was embarrassed to even serve,\" said Joo. Pizzeria Sei opened in 2022, and in the two years since, Joo has experimented with countless flours in an attempt to perfect his \"Tokyo-by-way-of-L.A.\" style. \"I keep tweaking it,\" he admits. \"When it's a good day on the dough – we try to be super consistent, we check the pH, the temperature, everything – the dough is light like Styrofoam. It should be very light, crispy, and airy, with a great flavor, too.\" Pizzeria Sei is housed in a small, nondescript space nestled between kosher restaurants in Pico Robertson. The minimalist atmosphere evokes a sense of calm, with blank white walls and the smell of a wood-burning oven, and the serene vibes extend to the service. The pizza chefs quietly shape their dough, flour flies gracefully around the glass walled bar seating area, and waiters coolly take orders as you sit before the chefs. The menu is deliberately small, fitting for the tiny space, which has only a single wood-fired oven, and a back area with barely enough room for cold storage and for fermenting dough. Antipasti includes a lovely burrata doused in olive oil and sea salt, a bright and bitter tricolore salad, and a handful of charcuterie options. Though Joo has never visited Tokyo before opening his own version of this style, he's come close to mastering it. I've eaten at Seirinkan and Savoy and Pizza Strada and others in Tokyo—and Joo's version is comparable to all of them. \"One of the reasons I changed to Resy was because they have this ticketing system, and I'm trying to do this pizza tasting menu,\" Joo explains. \"I want to serve three different kinds of dough for the tasting menu, with one seating a day, for just 10 people.\" Sei's omakase pizza menu, which just debuted, will run every other Tuesday, when they're traditionally closed, and will feature 8-10 courses for $150 (not including tax or tip). \"If you try to eat eight slices of Neapolitan pizza, it's really hard. But if you incorporate a fried dough or a super hydrated dough, you can finish eight to ten slices, no problem,\" Joo says. As Joo talks, I'm reminded of the Japanese concept of kaizen, in which one strives for continuous improvement toward a greater purpose. When I bite into Joo's Tokyo-style Neapolitan pie, I can taste this desire. I know I will continue to return to Pizzeria Sei time and again, confident in the knowledge that the next pizza I eat will be even better than the last. Paul Feinstein is a Los Angeles-based food writer and the author of the upcoming book, \"Italy Cocktails: An Elegant Collection of Over 100 Recipes Inspired by Italia\" by HarperCollins imprint Cider Mill Press."
    },
    {
      "source_id": "src_resy_blog_2025",
      "publication": "Resy Blog",
      "title": "How to Get Into Pint-Sized Pizza Superstar Pizzeria Sei",
      "url": "https://blog.resy.com/2025/09/pizzeria-sei/",
      "published_at": "2025-09-19",
      "trust_level": "editorial",
      "content": "It's no surprise that Pizzeria Sei is one of Los Angeles' hardest reservations. Helmed by chef William Joo, who was recently named the 2025 pizza maker of the year by industry gatekeepers 50 Top Pizza, Pizzeria Sei is a celebration of the alchemic magic that can take place when you combine flour and water in just the right way. Joo's Tokyo-style Neapolitan pies, with their airy-crisp crusts and unrivaled farmers market toppings, work in two distinct ways: to showcase perfect examples of the classics (like an unbeatable margarita), and the convergence of cuisines that gives Los Angeles its unique culinary style. Last year, Joo debuted a weekly pizza omakase tasting menu as a platform to test some of his more experimental creations; and later this year, Pizzeria Sei will move to a (much-needed) larger location near Palms. But in the meantime, don't let the limited seating at the original Sei stand between you and some of the country's best pizza. In this installment of The One Who Keeps The Books, we sat down with the pizza master himself for Joo's tips and tricks for getting a seat at the table, plus his advice on what to order when you finally make it in. How many seats do you have at Pizzeria Sei? Right now we have about 15 to 26 seats. How many of those are available to book on Resy versus held for walk-ins? We keep about 80-85 percent for Resy and the rest for walk-ins. When are reservations released? Two weeks before the desired day at noon Pacific time. We've changed this to make it easier for diners — reservations used to be released late in the evening, but I think it's just better for the guests now. What's the order that you wish every first-time guest would make at your restaurant? I think the mushroom toast with lardo is a good way to start, and then we have two recommendations for pizza: the margherita and the mala sausage from the special menu. I think those two are fun examples of what we like to do. Your unique Pizza Omakasei experience is entirely different from a normal reservation at Pizzeria Sei. What can guests expect when they book in for this experience? Guests can expect an omakase of six to seven slices of pizza that showcases all of the different doughs and styles of pizza we make, with a fried pasta (or suppli, as the Romans call it), some salad, and a dessert. I am also using it as a way to work on different doughs for the new location. To be honest, we lose some money on these events because we're putting such high quality ingredients into them. From the salt to the pepper, the butter, milk, and cream, everything is the highest quality possible. We order fish from the market in Japan. I make trays of dough and if some proof faster than we want, in the end I will only use the best ones. There can be a little bit of inconsistency on a regular day if we are too busy, but this way, with fewer guests, we can control everything."
    }
  ]
}