{
  "place_slug": "portos-bakery-cafe",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Porto's Bakery - Review - Glendale",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/portos",
      "published_at": "2025-03-08",
      "trust_level": "editorial",
      "content": "Even though the Porto's in Glendale is technically its second location, this legendary Cuban bakery has been in the neighborhood for over 30 years and is every bit as much of an institution as the original in Burbank. Expect the same great guava pastries, medianoche sandwiches, and long lines at pretty much any point in the day. The good news? This place is a well-oiled machine and somehow wait times rarely exceed 15 minutes. If you're in Glendale for even an hour, a visit is mandatory. Flaky, fruity, creamy, and sweet—these iconic pastries filled with guava paste and cream cheese hit all the flavorful notes we want from a baked good, which is probably why they're always the first item to disappear from a box of Porto's. Their name is a nod to Cuban refugees who arrived in the U.S. during the mid-20th century, including the family that founded Porto's. We don't always order the entree plates at Porto's, but when we do, this solid rendition of saucy stewed beef with rice, black beans, and plantains is our go-to."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Porto's Bakery - Review - Burbank",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/portos-bakery-burbank",
      "published_at": "2025-03-08",
      "trust_level": "editorial",
      "content": "The pride and joy of Burbank, Porto's is a straight-up classic. The family-run Cuban bakery has been serving guava and cheese pastries, potato rolls, and every other Latin dessert you can think of for the last five decades, and has built a devoted following in the process (there are now six with locations across greater LA and OC). Come here at noon on a Tuesday and you'll be greeted by 100 other people who had the same idea as you. Their iconic yellow pastry boxes are a fixture at family parties, office break rooms, and even airplane carry-on compartments as Angelenos tend to bring to Porto's along for any occasion. But despite being perpetually busy, Porto's operates like a well-oiled machine. Whether you're picking up a tres leches cake for your cousin's birthday, a plate of ropa vieja for lunch, or just some strudels to eat alone in your car, they never fail at getting you in and out in no time. We don't always order the entree plates at Porto's, but when we do, this solid rendition of saucy stewed beef with rice, black beans, and plantains is our go-to."
    },
    {
      "source_id": "src_theinfatuation_2023",
      "publication": "The Infatuation",
      "title": "The Best Bakeries In LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-bakeries-la",
      "published_at": "2023-02-08",
      "trust_level": "editorial",
      "content": "For anyone who's ever stepped foot in Southern California, Porto's should need no introduction. But just in case you need a quick refresher, the family-run Cuban bakery has been serving guava pastries, potato balls, and everything else under the Valley sun for the last 55 years. They're the pride and joy of Burbank, and you should come here (or any of their other locations) any day of the week to join the line of 100 other people waiting to worship their trademarked papa rellenas, which are deep-fried and filled with more meat than an Arby's tagline. And since Porto's is a well-oiled machine, they'll have you in, out, and eating pastries for lunch alone in your car in 10-15 minutes."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "25 Iconic Dishes That Define Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/iconic-los-angeles-food",
      "published_at": "2025-03-10",
      "trust_level": "editorial",
      "content": "Some people bring wine to parties. Some bring flowers. Angelenos bring a box of Porto's. We could fill an entire caption listing the beloved savory and sweet treats at this Cuban bakery chain, but we'll start with the one that disappears first. Known as refugiados, these decadent pastries are filled with tangy guava jam and rich cream cheese, bound in a flaky crust that will inevitably explode into a million crumbs on your shirt. Not that you'll mind."
    },
    {
      "source_id": "src_timeout_la_2023",
      "publication": "Time Out LA",
      "title": "Porto's Bakery & Cafe",
      "url": "https://www.timeout.com/los-angeles/restaurants/portos-bakery-cafe",
      "published_at": "2023-09-12",
      "trust_level": "editorial",
      "content": "One visit to this Cuban family-owned bakery, which started as a modest cake business in Echo Park in the 1980s, and you'll be making excuses week after week to come back for fresh-out-of-the-oven cheese rolls, decadent fruit tortes and pies, authentic Cuban sandwiches, and flaky chicken empanadas. Perhaps what they're best known for, though, is the potato balls—stuffed mashed potatoes fill with ground beef and fried to a beautiful golden brown. If you're in the market for a birthday cake, Porto's has exceptional deals on cakes as well (the tres leches is tops). Can't make it to the Glendale spot? Other locations include Burbank and Downey."
    },
    {
      "source_id": "src_timeout_la_2016",
      "publication": "Time Out LA",
      "title": "Porto's",
      "url": "https://www.timeout.com/los-angeles/restaurants/portos",
      "published_at": "2016-07-19",
      "trust_level": "editorial",
      "content": "One visit to this Cuban family-owned bakery, which started as a modest cake business in Echo Park in the 1980s, and you'll be making excuses week after week to come back for fresh-out-of-the-oven cheese rolls, decadent fruit tortes and pies, authentic Cuban sandwiches, and flaky chicken empanadas. Other locations include Glendale and Downey, check the website for details."
    },
    {
      "source_id": "src_consumingla_2012",
      "publication": "Consuming LA",
      "title": "Cuban Pastry Crisis",
      "url": "http://www.consumingla.com/2012/05/25/portos-menu/",
      "published_at": "2012-05-25",
      "trust_level": "editorial",
      "content": "Porto's Bakery and Cafe is a loud and lively LA institution selling pastries and awesome Cuban comfort food to Angelenos for decades. All three of its locations (Glendale, Burbank and Downey) have counter service only and the lines are usually long, but move fast. With so many delicious offerings, the only real crisis at Porto's is deciding what to order. Here are my seven favorites: Potato Balls (also known as Papas Rellenas), these are balls of mashed potatoes which have been filled with seasoned ground beef and deep fried; kind of a spherical mini Shepherd's Pie. Rellenitos - small pieces of sweet plantains filled with black beans and coated with sugar. Mariquitas (Plantain Chips) - crispy, salty and slightly sweet. Tres Leches Cake - soaked in three kinds of milk and topped with meringue, this yellow sponge cake is moist and delicious. Malta Soda - sometimes known as 'Children's Beer,' it's a carbonated non-alcoholic malt soda which is essentially unfermented dark beer. Other beverages at Porto's include horchata, mango smoothies, mamey shakes and coffee drinks such as cafe con leche and dulce de leche latte. Porto's Bakery & Cafe is located at 3614 W. Magnolia Blvd in Burbank, 315 N. Brand Blvd in Glendale and 8233 Firestone Blvd in Downey."
    }
  ]
}