{
  "place_slug": "psychic-wine",
  "sources": [
    {
      "source_id": "src_punch_2024",
      "publication": "PUNCH",
      "title": "So Everything's a Natural Wine Bar Now?",
      "url": "https://punchdrink.com/articles/everything-natural-wine-bar-now-wildair-contra-nyc/",
      "published_at": "2024-02-23",
      "trust_level": "editorial",
      "content": "[PAYWALLED]"
    },
    {
      "source_id": "src_infatuation_2023",
      "publication": "The Infatuation",
      "title": "Psychic Wines - Review - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/psychic-wines",
      "published_at": "2023-12-13",
      "trust_level": "editorial",
      "content": "Another Silver Lake wine shop, Psychic specializes in low-intervention natural wines."
    },
    {
      "source_id": "src_sprudge_2018",
      "publication": "Sprudge Wine",
      "title": "World's First Look Inside Psychic Wines In Echo Park",
      "url": "https://wine.sprudge.com/2018/07/31/worlds-first-look-inside-psychic-wines-in-echo-park/",
      "published_at": "2018-07-31",
      "trust_level": "editorial",
      "content": "Quinn Kimsey-White has created Psychic Wines—a new Los Angeles wine shop at 2825 Bellevue Avenue, open today—with the intention of building community. As with any fringe group gaining recognition, there has been a move towards exclusivity in the US natural wine scene in recent years—if something is popular, can it possibly be cool? Kimsey-White is wary of this, welcoming the newer discoverers of natural wine. \"We have to stay inclusive,\" he says, \"or run the risk of becoming the elitist wine culture that we countered ourselves against in the first place.\"\n\nOriginally from North Carolina, he comes more recently from the Bay Area natural wine scene, which he describes as tight-knit and rightfully self-assured. In LA he sees \"an abundance of loose and outward-looking, unpretentious excitement.\" With early torchbearers like Jill Bernheimer of Domaine LA as influences, Kimsey-White anticipates the advent of a second wave of incoming personalities and establishments fleshing out the scene.\n\nThe name Psychic Wines, for Kimsey-White, refers to the unnamable qualities of natural wines, the metaphysical presence they can have, their connection to mind and soul. The shop will not have a wine bar element, but Kimsey-White has still found a way to make a cultural space. It's a bustling zone, but Kimsey-White intentionally positioned Psychic off the main drag so that it will offer the intimacy of a neighborhood shop.\n\nBeyond carrying wines from small producers who work properly and make real wine, he finds a connection with the winemakers important. Kimsey-White has visited many of the producers he stocks, and can honestly vouch for the work that they're doing. \"It might sound cheesy, but there is nothing more gratifying in this business for me than putting a wine that I really care about in the hands of someone who is excited to understand and find pleasure in it.\""
    }
  ]
}