{
  "place_slug": "rasarumah",
  "sources": [
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Rasarumah – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/rasarumah",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Los Angeles Restaurants · Rasarumah · 3107 Beverly Blvd., Los Angeles, CA, 90026, USA · $$$ · Malaysian\n\nBib Gourmand: good quality, good value cooking\n\nExpect to be greeted with an array of sambals as well as Malaysian classics on Chef Johnny Lee's Chinese-Malaysian menu. Don't let the slightly higher price point steer you away, as these large plates are designed for sharing. Pork jowl or chicken satay skewers start things off right, as do ulam bendi with charred okra, and steamed eggplant with sambal and dried shrimp. There are plenty of main dishes to choose from, but beef rendang in a rich and creamy curry accompanied by a buttery roti is a sure thing. To finish, look no further than the cendol sundae with coconut and pandan ice cream with pandan jelly noodles, red bean, gula melaka syrup, and toasted buckwheat."
    },
    {
      "source_id": "src_the_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Malaysian spot Rasarumah makes a fun night out feel too easy - Review - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/rasarumah",
      "published_at": "2025-09-12",
      "trust_level": "editorial",
      "content": "3107 Beverly Blvd, Los Angeles, California 90057 · $$$$ Malaysian · Historic Filipinotown\n\nRating: 8.4\nWritten by Jess Basser Sanders\n\nRunning restaurants is hard. Rasarumah, though, makes it look easy. The result of a team-up between the always-expanding group behind spots like Found Oyster, Barra Santos, and Queen St., and the chef who ran Pearl River Deli, Rasarumah feels like it's been open for years. There's a palpable energy in the room, with a birthday celebration (commemorated with a shoutout on the letterboard over the bar) in one corner, dates at the counter sharing natural wine, and a big group of friends shouting about the Dodgers in another corner. Service is smooth and friendly, you can get a table a couple of days ahead, and just generally enjoy a night out that feels effortless.\n\nThe Chinese Malaysian menu complements this easygoing vibe. Piles of shrimp chips with sambal, charred skewers, and chewy noodles are all tasty and well-executed. It's 2025, so of course there's a little gem salad, but here it's inspired by Indonesian gado gado.\n\nBoth of the meat skewers—juicy chicken thigh with peanut sauce and a pop of fresh-grated pineapple, and fattier pork jowl with hot mustard—are winners. If you're crippled by indecision, there's a skewer sampler that also includes a radish one brushed with miso-honey butter.\n\nThese days, we're surprised when a restaurant doesn't have a little gem salad on the menu. But Rasarumah expands the genre, transforming it into a clever take on the Indonesian staple with peanut dressing, crispy tofu, and shrimp chips— a top-tier LA salad in our books.\n\nThese are very good chicken wings, with crunchy battered skin and some sweet tanginess from tamarind. Unfortunately, we are haunted by the previous incarnation of this dish, which featured whole wings with a skin shatter you could hear down the block.\n\nExcellent stir-fried noodles with just the right amount of chew. Chinese sausage, shrimp, and soy sauce add plenty of savory depth.\n\nThe warmth of this cardamom-heavy mushroom curry is more fall-feeling than anything pumpkin-spiced. The super crispy rice underneath and bright snap peas add a pop of brightness and make it a complete meal.\n\nAt the heart of it, Rasarumah is the kind of restaurant so many others aspire to be. Fun, delicious, and capable of invoking that indescribable feeling that makes you want to come back again and again."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Rasarumah | Restaurants in Historic Filipinotown, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/rasarumah",
      "published_at": "2025-02-28",
      "trust_level": "editorial",
      "content": "The newest project by Johnny Lee, the Hainan chicken savant behind now-closed Pearl River Deli, this upscale, beautifully designed restaurant serves an ambitious, slightly uneven interpretation of Malaysian street food.\n\nThough I found the beef rendang and all three of the noodle dishes largely forgettable, any of the cold starters and \"snacky things\" make for marvelous drinking fare. Since January, Lee has wisely started preaching to the choir. Recently, he brought back his cult-favorite Hainan chicken as a \"poached chicken\" Monday night special and swapped out Rasarumah's sambal-inflected black cod (previously the only standout main) for more Chinese-leaning dishes like mushroom claypot rice and a sweet-and-sour whole fried snapper. The San Gabriel Valley is still home to cheaper, ultimately better Southeast Asian cuisine, but if you care to keep up with the Joneses of the L.A. food world, the latest trendy dining and drinking destination from Last Word Hospitality (Found Oyster, Barra Santos) is probably worth paying a visit."
    },
    {
      "source_id": "src_resy_blog_2024",
      "publication": "Resy Blog",
      "title": "Rasarumah Is Defining Malaysian Food on Its Own Terms",
      "url": "https://blog.resy.com/2024/12/rasarumah-malaysian-food-los-angeles/",
      "published_at": "2024-12-18",
      "trust_level": "editorial",
      "content": "Chef Johnny Lee would like to reintroduce himself. It's been nine months since Pearl River Deli — Lee's critically adored Cantonese restaurant in Chinatown, known for its radically old-school approach to Chinese cooking and a Hainan chicken with an insatiable cult following — shuttered. \"We are closing, for real this time,\" read the announcement Lee posted days before its final service. \"The last year has been very challenging as a business and being a solo operator has made me realize it's no longer worth it.\" Now, after a brief hiatus, Lee is back. And this time, he's bringing backup. Meet Lee's latest venture, Rasarumah, a sumptuous full-service restaurant in Historic Filipinotown that offers a wide array of dishes inspired by Malaysian hawker culture.\n\nRasarumah, or \"house of flavor\" in Malay, is a team project: Lee partnered with Last Word Hospitality, the restaurant group behind Found Oyster, Barra Santos, Shins Pizza, and Queen St., among others. It's a match made in sambal-slathered heaven. \"I was already a fan of their restaurants. Honestly, I don't think I would have done Rasarumah with anyone else,\" Lee says. Lee and Last Word have transformed what was once a brasserie factory into a celebration of sweet chile sauce and griddled rice cakes.\n\nMalaysian cafes are renowned for their effortless, natural charm — think earth tones, lovingly restored historic buildings, and lots of plants. Rasarumah's intimate, softly lit 40-seat space on Beverly radiates the same aura: the 1920s-era building is outfitted with Roman clay walls, antique sconces, soaring wooden rafters, and vintage linoleum checkered floor tiles; lush foliage spills over into every corner. The walls are lined with booth and banquette seating; cushions come in colors such as \"yellow, like the fancy French butter\" or \"Los Angeles sunset orange when the air quality is slightly troubling.\" \"That's the benefit of being a part of this group. Everyone has an eye for design,\" Lee explains. \"I basically just sign off and say, 'Yeah, that's cool.'\" Rasarumah is covered in art — there are even a few Zoolander paintings, if one knows where to look. Lee's own original photography is also in the mix, including his shot of a riverboat in Malacca.\n\nAlthough Rasarumah is Lee's first restaurant to serve alcohol, luckily, he has an ace by his side: Last Word Hospitality's wine director, Evelyn Goreshnik, a seasoned pro who previously worked at Petit Trois, Alimento, and Scopa. Goreshnik compiled a playful yet elegant collection of wines, sake, sochu, beer, and non-alcoholic beverages to match the restaurant's spirit. Goreshnik rotates the selection often, but recent highlights included the crispy, tangy 'Forca di Pero,' a biodynamic white from France which translates from Corsican to \"the fork of the pear tree.\" And while most of Rasarumah's white wines hail from France, the full wine list sources from Italy, Germany, and California.\n\nAt Rasarumah, you'll find those flavors reflected in snacky bites like pork jowl satay: juicy meat skewers served Hainanese-style, with sides of peanut sauce and fresh pineapple. Or rojak, a savory fruit salad made with cucumber, jicama, sour mango, and mouth-puckering tamarind."
    },
    {
      "source_id": "src_lamag_2025",
      "publication": "LAmag",
      "title": "Michelin Adds Seven L.A. Restaurants to its California Guide",
      "url": "https://lamag.com/dining/michelin-adds-seven-la-restaurants-to-its-california-guide/",
      "published_at": "2025-03-12",
      "trust_level": "editorial",
      "content": "Rasarumah — The Chinese-Malaysian restaurant where Chef Johnny Lee incorporates Malay culture, alongside Indian and Indonesian flavors sits in the heart of Filipinotown. The higher price point is made up for in large servings that are perfect for sharing.\n\nOn March 12, Michelin added seven Los Angeles restaurants to its California Michelin Guide. The seven restaurants listed on the guide as \"new\" and \"recommended\" will have the opportunity to earn a coveted Michelin star later this year, adding to the current list of 26 Los Angeles-based restaurants with Michelin stars.\n\nNew Michelin addition Rasarumah serves up Chinese Malaysian food that incorporates Indian and Indonesian flavors."
    },
    {
      "source_id": "src_laist_2024",
      "publication": "LAist",
      "title": "Malaysian cuisine is ready for its close-up with Rasarumah in Historic Filipinotown",
      "url": "https://laist.com/news/food/malaysian-cuisine-is-ready-for-its-close-up-with-rasarumah-in-historic-filipinotown",
      "published_at": "2024-12-27",
      "trust_level": "editorial",
      "content": "Rasarumah is a new restaurant from chef Johnny Lee (formerly of Pearl River Deli) and Last World Hospitality (Barra Santos and Found Oyster), specializing in Malaysian and Southeast Asian cuisine. Its aim: to bring Malaysian food into mainstream Los Angeles cuisine.\n\nLee, who was born in China but grew up in Lincoln Heights, is considered one of the premier Asian chefs in Los Angeles. It has a certain amount of cultural cache for Lee, who has been cooking it regularly for the past decade throughout Los Angeles. Using the dish as a lens allowed him to unlock the possibilities within different regional cuisine styles.\n\n\"Rasarumah\" means \"flavor house\" in Malay, a promise undoubtedly delivered. Casual bites can be enjoyed table side or at the stainless steel bar, which includes a selection of satay skewers with a choice of chicken thighs and pork jowl ($12-$21).\n\nThere's also an all-vegetable selection of cold items on the menu, including the ulam bendi ($16), whole blanched okra on thick wedges of eggplant topped with sour sambal and dried shrimp. It resembles an abstract piece of art, matched by its clean yet pungent flavors.\n\nRasarumah's interior is modeled after cafes in Penang, Malaysia, down to the linoleum-checkered floors.\n\n\"Food changes over time with immigration,\" Lee said. \"Geography is one thing, but national borders are just an artificial construct. Chinese people exist everywhere.\" He decided to focus on Malaysian cuisine. While there are plenty of Malaysian restaurants in the region, such as Borneo Eatery in the San Gabriel Valley, they remain very much family-owned independent spots. With Rasarumah, Lee is poised to create something similar to what Pine & Crane did with Taiwanese cuisine, providing a path for Malaysian food to take its place in L.A's culinary food scene.\n\nFocusing on Malaysia's food has given Lee a wide range of food influences to play with. Its cuisine reflects its multi-cultural background, an amalgam of Indigenous populations, diasporic communities from China and India, and colonial influences from Portugal, Holland, and Britain."
    }
  ]
}