{
  "place_slug": "roasted-duck-by-pa-ord",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Thai roasted duck is the glorious headliner at Roasted Duck By Pa Ord - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/roast-duck-by-pa-ord",
      "published_at": "2025-04-09",
      "trust_level": "editorial",
      "content": "If the name (or the sassy grandmotherly duck on the front sign) doesn't make it clear enough, this tiny Thai Town restaurant by the Pa Ord people specializes in roasted duck. The whole place is roughly the size of a micro-studio, with a small counter dividing the kitchen from a handful of tables. The counter slightly shakes when the staff pound chilis in a giant mortar and pestle or hack Daffy's carcass with a meat cleaver. If you brought more than three friends here, you'd take up half the restaurant. Because of the limited legroom, this strip mall spot isn't the best option for big groups, but the spectacular roasted duck makes it a perfect choice for something else: an indulgent, one-of-a-kind meal at a reasonable price.\n\nThe menu's roasted duck specials are available all day, but they tend to sell out on busy nights, so plan an early-ish dinner if a whole duck is a must (we certainly believe it is).\n\nWe all remember when our second-grade teacher told us we were special. But these roasted duck sets are objectively special. Squeeze a slice with your chopsticks, and it releases its sweet, fatty juice. The skin is soft and glossy. The dips on the side are just the right amount of punchy to complement the plump bird, stir-fried greens, and garlicky noodles. Sizes range from single to couple to family (which feeds three to four). We say bring a crew and go big.\n\nOrder this stir-fry \"spicy,\" and you'll think the chef threw an indiscriminate amount of chile peppers into the wok just to test you. Whether or not you can stand the heat, though, you'll be able to smell fragrant Thai basil as this dish comes together in the kitchen. We also appreciate that the duck pieces stay juicy and plump after their quick sauté.\n\nDespite the name, this restaurant isn't a one-trick pony. Non-duck dishes like this crispy pork belly appetizer are just as great. These slices of pork belly are incinerated on the grill until their fat is crunchy, followed by a dunk in a peanut-y spicy sauce.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_latimes_2025",
      "publication": "Los Angeles Times",
      "title": "Three L.A. restaurants where you have to order the duck",
      "url": "https://www.latimes.com",
      "published_at": "2025-06-02",
      "trust_level": "editorial",
      "content": "\"To do duck you have to be really disciplined, like cut out your social life,\" says Chartchai Vongsanikul. Vongsanikul, who goes by Chef Bob, is calling me on his semi-day off to talk about duck. He's the chef at Roasted Duck by Pa Ord, a tiny restaurant in a strip mall in Thai Town that specializes in taut, shiny-skinned roast duck. His is the face you see peeking between the row of hanging ducks behind the counter at the restaurant. He lives and breathes duck, spending his days brining, drying, roasting and chopping it, even contemplating duck when he's not in the kitchen.\n\n\"Today is my day off, but I have to go in and prepare the ducks,\" he says. \"So I don't really have a day off. If you're going to do duck, you should think twice.\"\n\nAbout 15 years ago, during a trip back to Thailand from Los Angeles, Vongsanikul's father asked him to take over the duck restaurant he'd opened in Bangkok. The restaurant served a Kunming-style roast duck, a variation of Peking duck from China. Vongsanikul ended up spending years preparing ducks for the restaurant, tweaking the preparation and presentation to something he believed would appeal to Thai palates.\n\n\"There was a lot of trial and error of getting the taste to something for Thai people,\" he says.\n\nIn early 2024, he had a meeting in Bangkok with Lawan Bhanduram, the woman behind nearly a dozen Los Angeles restaurants, including Pa Ord Noodle. He had actually worked for her for a short time years prior, purchasing goods for her restaurants.\n\n\"She was semi-retired at the time,\" he says. \"I said, come on, let's do this. I got the duck, you got your name and your brand.\" The pair returned to Los Angeles and opened Roasted Duck by Pa Ord shortly after.\n\nVongsanikul dry-brines his ducks for a couple of hours, then dips them in hot water to tighten the skin. He paints the ducks with honey, then lets them air dry for 24 hours. The ducks roast, a dozen at a time, at what he calls \"just the right temperature\" for one hour. The duck meat glistens on the plate, arranged in a small heap of skin-clad tiles. The skin is a deep-golden brown, with the thinnest layer of fat underneath. It clings to the duck, delicate and wrinkly, with a fleeting crunch that melts mere seconds after it hits your tongue. The meat is succulent and tender, saturated in its own juices and fat.\n\nYou can order the duck bobbing in Bhanduram's signature soup ($17), the ruddy broth heady with the flavors of the duck. Or swimming in curry ($17) or on top of a salad ($17). But for duck to the tenth power, there's the roasted duck special, for one ($25) or two ($35), served with the sliced meat and rice or jade noodles."
    },
    {
      "source_id": "src_eater_la_2024",
      "publication": "Eater LA",
      "title": "Los Angeles's Most Exciting New Restaurants 2024",
      "url": "https://la.eater.com/2024/12/23/24325514/los-angeles-most-exciting-new-restaurants-2024",
      "published_at": "2024-12-23",
      "trust_level": "editorial",
      "content": "Roasted Duck by Pa Ord, which sits in the same space as the original Pa Ord that owner Lawan Bhanduram opened more than two decades ago, is a study of a restaurant with a singular, near-obsessive focus. The namesake dish permeates all sections of the menu: served with golden grains of fried rice, submerged in soup or herbaceous green curry, studded with bright chiles and basil leaves, and nestled alongside jade noodles and sauces. Perhaps for security, diners can also order dishes with chicken, beef, pork, or shrimp, but the headliner is clearly duck, which arrives with its glistening, crackling skin smothered in a gravy-like sauce, falling apart at the touch. Chef Bob Vongfanikul, tapped by Bhanduram to open this restaurant, prepares each dish to order in the narrow space, and seats most of its visitors at the counter (a row of crispy ducks waiting to be cut hangs on a rack in its foreground). Nicole Adlman raves that the roasted-duck reinvention is \"the most fantastic, irreverent reinvention of the original Pa Ord location; I could eat there every day and never tire of it.\" Her tip: \"skip the steamed rice or egg noodles that come with the standard roasted duck special and ask for some of that deeply spiced, deeply earthy duck soup broth on the side instead.\""
    },
    {
      "source_id": "src_eater_la_2024_best_dishes",
      "publication": "Eater LA",
      "title": "Editors' Best Dishes Los Angeles 2024",
      "url": "https://la.eater.com/maps/editors-best-dishes-los-angeles-2024-restaurants",
      "published_at": "2024",
      "trust_level": "editorial",
      "content": "This tiny strip mall poultry specialist makes magic happen with Bangkok-style roast ducks. When we snuck a peek of our personal heaven (and Daffy's personal hell): the kitchen's big roaster filled with glistening ducks. The duck special for one with garlic noodles. Beak-to-tail cooking, strip malls, the sound of thwacking meat cleavers."
    },
    {
      "source_id": "src_eater_la_best_thai",
      "publication": "Eater LA",
      "title": "Best Thai Restaurants Los Angeles Essential",
      "url": "https://la.eater.com/maps/best-thai-restaurants-los-angeles-essential",
      "published_at": "",
      "trust_level": "editorial",
      "content": "Pa Ord, or Auntie Ord, is a household name in LA for her impeccable boat noodles. And now she has a duck specialty shop to add to her impressive mini-chain of Pa Ord Noodle restaurants. As the name suggests, the menu is entirely focused on roasted duck, which comes with either steamed rice or noodles. Portion sizes are available for single diners, as well as \"family meals\" that feed up to four. Also on the menu are stewed duck noodle soup, holy basil stir-fried with duck, spicy duck salad, and duck green curry."
    },
    {
      "source_id": "src_eater_la_best_38",
      "publication": "Eater LA",
      "title": "Best Los Angeles Restaurants Eater 38 Essential",
      "url": "https://la.eater.com/maps/best-los-angeles-restaurants-eater-38-essential",
      "published_at": "",
      "trust_level": "editorial",
      "content": "Roasted Duck by Pa Ord specializes in Bangkok-style roasted duck at a small strip mall spot. The duck special for one—sliced roasted duck, vegetables, a vinegary soy sauce with chiles, and a side dish like jade noodles or rice—is enough to serve two, giving the place a high affordability factor. The seating at Roasted Duck by Pa Ord is very limited, so be prepared to take the duck home, or head down the street to Barndsall Park for a picnic. — Nicole Adlman, cities manager"
    }
  ]
}