{
  "place_slug": "ronan",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Ronan - Review - West Hollywood - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/ronan",
      "published_at": "2025-07-03",
      "trust_level": "editorial",
      "content": "At first glance, Ronan looks like an average neighborhood pizzeria with a nice patio. There are comfortable booths and a communal table inside, but nothing about the space is remarkable. But then the burrata appetizer and the anchovy-draped caesar salad hit your table. Followed by perfect, bubbly-crusted Neapolitan pizza dropped off by a tatted server wearing a Dookie Tour T-shirt. And suddenly, it clicks.\n\nWhat makes this Italian spot on Melrose just outside West Hollywood stand out is how easy the meals feel, thanks to consistently great food, friendly service, and a casual space that's always easy to get into.\n\nRonan is a pizzeria first, but we've used this slightly hidden spot (walk into the parking lot, the host stand will be to your right) for all sorts of things. We've had killer first dates on the candlelit patio, sangiovese-fueled friend dinners at the wooden communal table, and last-minute pizza parties with family on the weekends. Speaking of pizza parties, order a few margherita pies or the honey-drizzled Sweet Cheeks directly to your door and you'll be the hero of whatever awards show get-together you're hosting. With pies this good, a few minutes in the back of a Kia won't tank the quality.\n\nThe non-pizza section of the menu—a dozen or so small plates that involve wood-roasted vegetables, spicy clams, meatballs, and the like—are solid additions to a meal here, even if they don't always reach the heights of the plump, nicely charred pizzas.\n\nLA's burrata craze has thankfully subsided, but we still order this dish every time we're at Ronan. It comes to the table in a bath of basil oil and topped with a healthy handful of pine nuts for bite. It's simple, well-balanced, and great smeared on some focaccia.\n\nNo matter whether you're getting the burrata, make sure this dense, crunchy focaccia hits the table. It arrives as a square-shaped loaf about three inches tall with a knife stuck in the center like it's a prized pork chop. Plan to use it as a Zamboni for every plate on the table.\n\nAlong with the electric wine bottle opener, honey drizzled on pizza is one of the greatest inventions of our time. When combined with ricotta and spicy guanciale like it is here, we'll double down on that statement.\n\nRonan has a good cocktail and wine list, but what makes drinking here so exciting are the collaborations with out-of-town sommeliers, whiskey distilleries, and guest bartenders. Keep an eye on their Instagram—they happen frequently.\n\nRonan is a neighborhood restaurant good enough to leave your own neighborhood to experience. And that's what we call a Big Deal Restaurant—except here, you don't need to put on fancy clothes, make reservations a month in advance, or check your bank account afterward with one eye open. And perhaps that makes it an even bigger deal.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Ronan – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/ronan",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Aim for the two-story floral mural to find this Italian favorite with a dive bar-feel and plenty of LA style. Sit in the lovely patio, or head inside to the black marble bar. Other options include booths as well as an attractive communal table crafted from a varnished wood slab. Diners can expect to see pizza dough stretched, blenders whirring and the wood-fired oven crackling, all of which contribute to Ronan's swank allure. Come for their hand-stretched Neopolitan pizza, as well as their shared plates using seasonal produce and ingredients, with appetizers like their spring arancini with pastrami-spiced maitake with English peas and garlic, or their charred broccolini with their house blend of za'atar, fresh mint, and a Meyer lemon aïoli."
    },
    {
      "source_id": "src_opentable_2024",
      "publication": "OpenTable",
      "title": "Ronan in Los Angeles makes some of the city's best pizza",
      "url": "https://www.opentable.com/blog/ronan-los-angeles/",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "In the past few years, LA has undergone something of a pizza renaissance, with different styles of well-made pies popping up over the city. Since 2018, Ronan in Los Angeles has carved out a unique space for itself with its puffy, perfectly blistered sourdough pies—but also its excellent cocktails, thoughtful starters, and always-lively vibe.\n\n\"Even though the market is becoming saturated, there's space for everybody,\" Ronan co-owner Daniel Cutler says. \"Everyone's got a different style of pizza.\"\n\nRonan's also become well-known for its collaboration dinners, like past ones with the Parm Boyz pop-up and an upcoming event with Santa Monica seafood spot Isla.\n\nDaniel Cutler: I think a lot of it has to do with the space itself. When it's buzzing, it gives off an energy that I haven't seen in a lot of restaurants. One of the factors is the proximity of the kitchen to the bar; you really see what you're going to get.\n\nCaitlin Cutler: Daniel is going to be modest, but I think it's one of the last standing, truly chef-driven restaurants. Ronan is only meant to have one location, unlike a lot of restaurants now that feel cut-and-paste. You see that on the menu. This is what Daniel likes to cook and eat, and it's really personal.\n\nDaniel: The Señor Carrots [roasted carrots with spiced yogurt, honeycomb, and coriander]. It's a dish where you put a bunch of easy things together but as a combo it transcends into some other thing.\n\nDaniel: It was nice to be on the Eater 38 for a while. Caitlin: We're both from LA, so anytime we get recognition from The Los Angeles Times or Eater LA, it's a big deal to us. Daniel: Getting in the MICHELIN guide was also really big. I didn't know there were classifications for more casual restaurants."
    }
  ]
}