{
  "place_slug": "sams-place",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Another low-lit wine bar with good food? Yes, but Sam's Place is special",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/sams-place",
      "published_at": "2025-04-09",
      "trust_level": "editorial",
      "content": "We know. Same. But we'll keep going, because a) this is our corner of the internet and b) there's a straightforward confidence to Sam's Place that's kind of intoxicating. On its face, there's not anything particularly special happening at this mellow wine bar and restaurant in Highland Park. There's a list of natural wines, a few beers, accompanied by a short food menu you could order all at once, and a drop-in-and-chat feel. But when was the last time cornichon butter was served with your charcuterie, or your empty wine glass was topped up for free because your friend \"still has a bit to go\"? Or, for that matter, paid $32 for a steak?\n\nAll of this takes place in a low-lit room resembling the 1970s basement all cool dads wish they could preside over. The wood-paneled walls, flannel curtains, candlelight, and soundtrack provided by cassette tapes could come off twee and trying too hard in the wrong hands. Somehow it clicks together unpretentiously at Sam's.\n\nMostly, it's clear from the moment you walk in that the people behind Sam's Place are doing things the way they want, and that's why it works. The wine list is small and natural because that's how they like it. The food is fantastic—way better than it needs to be at a neighborhood wine bar—because they want you to stick around and hang out. We went once and can't stop going back. If you're lucky, Sam's Place will become your place, too.\n\nThe wine list here is short and thoughtful with no bottles over $100, and the owner/bartender will happily help you find what you're looking for. However, you should start with their vermouth spritz, made with bubbly Spanish mineral water and a nice contrast to the sweeter Aperol spritz—bitter, yet refreshing.\n\nSorry to repeat ourselves but did you know that cornichon butter is a real thing and that it is perfect? This cured meat plate also features hot-to-the-touch grilled bread and soft saucisson, but it's the vinegary butter that makes us giddy.\n\nIt's salads like this that convince us we shouldn't even try replicating restaurant salads at home. Sure, we could figure out the leaves and herbs, plus the savory nubs of cheddar. But we wouldn't come close to the heights of the tart vinaigrette and sweet, nutty bits of sesame-hazelnut crunch.\n\nExtremely charred, slightly spicy, extremely good. If you're still missing the sweet potatoes from the dearly departed Mh Zh—topped with tahini and a bright green chile paste—these are almost an exact copy.\n\nThe one dish on the menu that didn't blow us away. These grilled wings are seasoned with warm spices and glazed with pomegranate molasses, but aren't especially crispy. But if you're in the \"always order the wings\" camp, you'll likely be satisfied.\n\nWe're all tired of talking about inflation, but when was the last time you saw a $32 steak at a restaurant? If recently, was it actually good? Because this 10-ounce bavette is simple and fantastic. They won't ask how you want it cooked, but it'll show up 20 minutes later neatly cut into rare slices soaking in red wine jus with crisp watercress on the side.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_theangel_2024",
      "publication": "The Angel",
      "title": "Is It a Bar? Or Is It a Restaurant? Who Cares? It's Sam's Place",
      "url": "https://www.theangel.la/p/sams-place-highland-park",
      "published_at": "2024-09-26",
      "trust_level": "editorial",
      "content": "Perhaps you've seen a picture of a warm, wood-paneled room outfitted with green ceramic candlesticks and booths built of chopped church pews appear in your feed lately. Or of Japanese sweet potatoes, charred in chunks, plated on top of a puddle of tahini, and finished with a heaping of diced chiles. Then you wondered where the picture was taken because there was no tag.\n\nIf you were bold enough to ask, you know that Sam's Place—at 5530 Monte Vista Street in Highland Park—is the answer. This charming new hang, a hybrid bar-restaurant situated two blocks parallel to Figueora, opened at the end of August. In the month since, its existence has amounted to an excited hush-hush, with mounting popularity powered by a good old game of word of mouth.\n\nAs you have likely gathered by now, Sam's Place is not on Instagram. It has no website. It's not yet on Apple Maps, although it is listed on Google.\n\nSam's Place is situated in a Spanish-style building with a dusty green stucco exterior and a roof made of rounded clay tiles. To the right of the entrance, a wood plaque announces the bar's name, framed in flowers and carved by the artist Nik Gelormino.\n\nInside, an inviting interior is thanks to Lafayette Studio, run by Alex Neu and Samantha Wetton (Jones' wife), whom the restaurant is named after—at least in part. (\"Sam's Place\" also refers to a Buck Owens' song about a neighborhood bar.) They sourced the Midcentury church pews from a mission in Ventura, the vintage light fixtures from Europe via Etsy, and the antique sea shell mirrors in Northern California. They also had the ceiling painted cobalt blue. Deetjen's Big Sur Inn was a core inspiration, design-wise.\n\nBefore opening Sam's Place, Cantino tended bar at The Hermosillo for 12 years and eventually graduated to becoming the wine buyer for the popular Highland Park bar. Jones, on the other hand, was in and out of The Hermosillo's kitchen. He also cooked at the formerly beloved Israeli restaurant Mh Zh, catered for Amara Kitchen, helped open Silver Lake's now-closed Eszett, and operated a sourdough pizza pop-up at Gold Line.\n\nWhen the pair started to hone in on opening a spot of their own, they decided to do what they liked to do on their days off. \"Ben would just make food, and I ended up bringing a lot of wine, and then we'd just hang out in the backyard and barbecue, drink wine, and invite friends over,\" says Cantino. To that effect, Jones' describes his menu as \"all of the greatest hits from dinner parties past.\"\n\nEven if Sam's Place has the temperament of a wine bar, beer is what its owners drink 90% of the time. On draft, they serve a crisp house Pilsner made by a secret brewer in Berkeley, Reissdorf Kölsch, and Highland Park Brewery's Hello, LA IPA. Bottles of Coors, Pacifico, and Victoria can be mixed with fresh lime juice and made into a salt-rimmed chelada. And all beer is served ice-cold—a nonnegotiable for both Cantino and Jones.\n\n\"This whole journey started in New Orleans,\" recounts Jones, a Louisiana native. \"One of my best friends works at this dive bar, BJ's, and it just has the coldest beer. The bartenders are moving beers from refrigerators into the ice chest before they serve it to you, so it's as cold as humanly possible. We became obsessed with making that be a fixture here.\" In addition to BJ's, Cantino's first ice-cold beer experience—at a diner that served ground beef tacos in his hometown of Riverside—is seared into his memory.\n\nBy the time Sam's Place is open for five years—a promising possibility, given the restaurant's low rent cost and minimal labor requirement—Cantino will have been serving drinks in Highland Park for almost two decades. \"We're just trying to be consistently good. I'd be psyched if, in five years, it was as good as it is now. That's my focus: just making sure that every beer mug is really cold,\" he says.\n\nIf a true neighborhood joint is dependable, with warm and welcoming service and proprietors who are embedded in the community, then Sam's Place aims to be just that. If it works, it works, and there's no need for Instagram."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Sam's Place",
      "url": "https://www.timeout.com/los-angeles/bars/sams-place",
      "published_at": "2025-03-30",
      "trust_level": "editorial",
      "content": "You could almost miss Sam's Place in passing, but once this tiny Highland Park wine bar catches your eye, you'll be hooked. A wood-paneled interior invites you into a few alcoves offering hints of privacy. A passthrough window between the bar and the simple, dog-friendly patio makes you feel more like a houseguest than a patron."
    }
  ]
}