{
  "place_slug": "santa-monica-proper",
  "sources": [
    {
      "source_id": "src_michelin_guide_2024",
      "publication": "Michelin Guide",
      "title": "Santa Monica Proper Hotel - Los Angeles Area - Book a MICHELIN Guide Hotel",
      "url": "https://guide.michelin.com/us/en/hotels-stays/los-angeles-area/santa-monica-proper-hotel-9129",
      "published_at": "2024-04-25",
      "trust_level": "editorial",
      "content": "The Proper brand debuted in San Francisco with a classic building, a vibrant contemporary design by Kelly Wearstler, and high-luxury details that elevated it above typical high-end boutique fare. For the brand's second installment, it's a similar story: though the Santa Monica Proper Hotel is a new build, designed by Howard Laks Architects with interiors by the very same Kelly Wearstler, it incorporates a 1920s Spanish Colonial building on Wilshire Boulevard, updating a century-old classic for the boutique-hotel era. What results is a hotel that's more contemporary than vintage, even if its history does show through — it's got the romance of the Twenties but the forms and materials of a modern luxury boutique hotel. The rooms feature works by Los Angeles artists, and the full-length windows reveal uncommon views of Santa Monica's rooftops. The Proper brand has its own signature bed, which is an indulgent one indeed, and it's complemented by Fili D'Oro and Bellino linens, Kelly Wearstler bathrobes, and Aesop bath products. The Surya Ayurvedic Spa is joined by a fitness center and a yoga terrace, and not only is the rooftop pool deck the only one in a Santa Monica hotel, but it's also home to one of the restaurants. Calabra, by the poolside, serves a hybrid Mediterranean-Californian cuisine, and it's joined by Olea, another al fresco option on the garden terrace, as well as the swanky Palma Lounge."
    },
    {
      "source_id": "src_timeout_2024",
      "publication": "Time Out LA",
      "title": "15 Best Rooftop Bars in L.A. for Sweeping Views and Tasty Cocktails",
      "url": "https://www.timeout.com/los-angeles/bars/best-rooftop-bars-in-los-angeles-for-views-drinks-pool-parties",
      "published_at": "2025-08-24",
      "trust_level": "editorial",
      "content": "The seventh-floor rooftop restaurant and lounge at the Santa Monica Proper. Why we love it: The upscale Mediterranean food might be fairly mediocre, but the Goop-on-steroids aesthetic and breezy (but fairly pricey) cocktails keep this impeccably designed rooftop oasis top of mind whenever we're drinking on the Westside. Located a few blocks from the Pacific, Calabra's lounge seating and hidden poolside alcoves are the perfect place to impress folks coming in from out of town. The views from this seventh-floor hotel lounge don't include the Santa Monica Pier, however, but the extremely chic elements of Calabra itself, fashionably dressed clientele included, provide more than enough eye candy to make up for it."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "The 14 Best Hotel Bars In LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-hotel-bars-in-la",
      "published_at": "2025-11-12",
      "trust_level": "editorial",
      "content": "You might assume a neighborhood next to the ocean would have rooftop bars on every corner, but Santa Monica proves otherwise. Luckily, Calabra exists. Perched atop the Proper Hotel, this splashy spot has an indoor lounge, a poolside patio, and curved couches that you can rent out for more privacy. The music is loud and people are dressed up, but the atmosphere is still breezy, and their mezcal-heavy cocktails are what you'll want to be drinking while soaking up that sweet Westside sun."
    },
    {
      "source_id": "src_timeout_santa_monica_bars_2025",
      "publication": "Time Out LA",
      "title": "The 10 Best Bars in Santa Monica to Drink at in 2025",
      "url": "https://www.timeout.com/los-angeles/bars/the-best-bars-in-santa-monica",
      "published_at": "2025-05-19",
      "trust_level": "editorial",
      "content": "What is it? The seventh-floor rooftop restaurant and lounge at the Santa Monica Proper. Why we love it: The upscale Mediterranean food might be fairly mediocre, but the Goop-on-steroids aesthetic and breezy (but fairly pricey) cocktails keep this impeccably designed rooftop oasis top of mind whenever we're drinking on the Westside. Located a few blocks from the Pacific, Calabra's lounge seating and hidden poolside alcoves are the perfect place to impress folks coming in from out of town. The views from this seventh-floor hotel lounge don't include the Santa Monica Pier, however, but the extremely chic elements of Calabra itself, fashionably dressed clientele included, provide more than enough eye candy to make up for it."
    },
    {
      "source_id": "src_usnews_2024",
      "publication": "U.S. News Travel",
      "title": "Santa Monica Proper Hotel Reviews & Prices",
      "url": "https://travel.usnews.com/hotels/review-santa_monica_proper_hotel-santa_monica-california-174623/",
      "published_at": "2024",
      "trust_level": "editorial",
      "content": "If a hotel's design is paramount to your stay, you may want to book a room at the Santa Monica Proper Hotel. Decorated by celebrity interior designer Kelly Wearstler, the 267-room hotel is the definition of California cool. Rooms feature mid-century, European-inspired pieces, including wing chairs, geometric wall sconces and walk-in tiled showers. Other in-room amenities include Aesop toiletries, complimentary Wi-Fi access, Apple TVs and bedside controls to adjust blackout shades and lighting. Santa Monica Proper Hotel is the #5 Best Santa Monica Hotel, #56 Best California Hotels, and #295 Best USA Hotels according to U.S. News analysis. The hotel is recognized by Travel + Leisure World's Best Awards 2024 and Forbes Travel Guide Recommended 2024. Reviewers raved about the stunning accommodations and recommended reserving a room with a balcony for views of Wilshire Boulevard and the nearby Santa Monica Beach, which sits about a mile away. Outside their digs, lodgers will find a fitness center and spa, a rooftop pool, a lobby lounge and the Calabra rooftop restaurant."
    }
  ]
}