{
  "place_slug": "silver-lake-wine",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Silverlake Wine - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/silverlake-wine",
      "published_at": "2024-01-04",
      "trust_level": "editorial",
      "content": "Silverlake Wine is technically a wine shop, but it's also our favorite wine bar in Silver Lake."
    },
    {
      "source_id": "src_wine_enthusiast_2023",
      "publication": "Wine Enthusiast",
      "title": "Wine Shop Spotlight: Silverlake Wine",
      "url": "https://www.wineenthusiast.com/culture/wine/silverlake-wine-shop/",
      "published_at": "2023-05-04",
      "trust_level": "editorial",
      "content": "Twelve years ago, lightning struck the Los Angeles retail scene when Silverlake Wine opened in the heart of Silver Lake, a hilly, Eastside neighborhood. Within two years, it was the spot to shop for boutique, esoteric and affordable wines from hidden corners of California, France and beyond. Silverlake Wine, owned by Randy and April Clement along with George Cossette, has grown to include Everson Royce Wine & Spirits in Pasadena, which opened in 2012 and was named after the Clements' twin sons. In 2015, the three partners opened an additional Silverlake Wine and the Everson Royce Bar in the Arts District. This year they plan to double the size of the original store and launch a restaurant, pizzeria and wine shop in a building they bought in Highland Park. Silverlake's selection is rooted in the time that both Clement and Cossette spent at legendary Los Angeles eatery Campanile, where Manfred Krankl built a list of wines not typically associated with California restaurants of the 1990s. The design and offerings of the Arts District shop are just like the Silver Lake store. The bar next door, however, was totally new territory. It features food by Matt Molina, formerly of Chi Spacca, who will also spearhead food at the Highland Park project, as well as a wide array of drinks. Despite more competition among wine shops and bars in Los Angeles these days, the Silverlake Wine empire shows no signs of slowing down. We're interested in being in our own vein and having our own vibe, but we're not interested in breaking laws and doing dumb shit, says Clement. We literally go out and clean the street of the Arts District. Pay it forward is real stuff. Taking a closer look at local wine shops, this is the story of Silverlake Wine, from its start in a run-down former video store to burgeoning wine empire. Campanile was not governed by viticultural dogma, says Clement. We brought that ethos here. It was a little Rage Against the Machine. Plus, he had plenty of resources to explore. Clement recalls earning $1,000 a night. I would blow it on food and wine. After a period living in the eclectic beachside community of Venice, the Clements' moved to Chinatown in East Los Angeles. They'd shop at the Gelson's in Silver Lake, which he found diverse and progressive long before it became a trendy place to live. It was completely different, says Clement. It was firmly before this era. That the real estate was cheap didn't hurt, either. You could be young and dumb, he recalls. There were a lot of people doing really interesting things. On separate days, both Randy Clement and Cossette noticed that the Rockaway Records store was looking to lease out space."
    }
  ]
}