{
  "place_slug": "soho-warehouse-dtla",
  "sources": [
    {
      "source_id": "src_michelin_guide_2024",
      "publication": "Michelin Guide",
      "title": "Soho Warehouse DTLA - Los Angeles Area - Book a MICHELIN Guide Hotel",
      "url": "https://guide.michelin.com/us/en/hotels-stays/los-angeles-area/soho-warehouse-dtla-13099",
      "published_at": "2024",
      "trust_level": "editorial",
      "content": "The original Soho House members' club in London was followed up by another in downtown Manhattan; and though the brand's focus on the creative industries is a natural fit for Los Angeles, Soho Warehouse DTLA is set not in Hollywood but in a 1916-vintage warehouse in the downtown Arts District — which is not just an arts destination, but is also central to the L.A. food scene.\n\nLike the other Soho House locations it's a club first, and a hotel second, but overnight guests earn the benefits of temporary membership — this means access to the 50-foot rooftop swimming pool, as well as the House's public spaces, including the Rooftop Terrace and Bar, the House Kitchen, and the Garden, an impressive indoor-outdoor dining and drinking venue.\n\nThere's art everywhere, including a massive mural by Shepard Fairey, and the lavishly outfitted gym spans two floors of the building.\n\nThe rooms are handsome, to say the least — in typical Soho House style they're eclectic and warm, crisp and contemporary but full of retro-inspired character. They're also quietly luxurious, even if the visual panache obscures this fact; there's no hiding the fact that even the Cosy rooms are generously sized.\n\nIt's a long way from central London, but this concept has proved to be an eminently adaptable one."
    },
    {
      "source_id": "src_mr_and_mrs_smith_2019",
      "publication": "Mr & Mrs Smith",
      "title": "Soho Warehouse | Downtown Los Angeles, Los Angeles | California | Smith Hotels",
      "url": "https://www.mrandmrssmith.com/luxury-hotels/soho-warehouse",
      "published_at": "2019",
      "trust_level": "editorial",
      "content": "LA's cultural landscape has been caught and beautifully curated at Soho Warehouse. An art deco factory in the scuzzy to scene-y DTLA, it's been a recording studio for Off-White records and a semi-legit art gallery with years of graffiti colouring the walls; during restoration, artists snuck in to add tags which were kept as part of the building's DNA.\n\nNow it has work by hundreds of creatives; live music is its lifeblood, with recording and events spaces (plus a content booth); drinks are taken in a Med-style garden; and rooms have design elements from all decades. So, tag in, because this paint-splattered crashpad is very much 'it'.\n\nSoho Warehouse's might be the most desirable of Downtown's high-rise pools. The views travel out across LA to the mountains beyond, giving a spectacular backdrop to revels (especially from the stadium-style tiers), and on a more intimate level the considerations for coolness and comfiness are impressive.\n\nCheery yellow deckchairs sit side by side, cabanas have been upholstered in a custom-print fabric by LA artist Ethan Lipsitz (on eco-friendly hemp fabric, no less), and cocktails, beer and wine chill in vintage baby-blue coolers. The pool itself has plenty of room (the house held a synchronised swimming display in it when it opened), and if there's any doubt about how special it is, well, this is the only Soho House outpost in LA with a pool.\n\nWell, of course this wasn't going to have an ordinary gym; here you hit the state-of-the-art Technogym equipment, Peloton bikes, climbing ropes and Olympic rings under Italian-glass chandeliers, over two floors which feel more like a Berlin nightclub than a place to do burpees.\n\nSoho Warehouse sits on still-gritty Santa Fe Avenue, close to both Downtown LA's Arts and Fashion districts. LAX (Los Angeles International) is the closest airport to the hotel, about a 30-minute drive away. The hotel can help with booking transfers.\n\nUnion Station, where Amtrak cross-country services stop, is a 10-minute drive from the hotel. Its Mission Moderne building is a destination in its own right, with art exhibits, festivals, live music and more.\n\nDTLA's cleaned up its act a lot over the past decade, and has actually become one of the city's most walkable neighbourhoods. However, the hotel is a 40-minute walk from both the Arts and Fashion districts, so if you don't want to be beholden to Uber, you'd best hire yourself some wheels, especially if you want to hit Hollywood or the beach.\n\nIt's very Soho House of Soho Warehouse to not choose an obvious neighbourhood, but one that's steadily climbing to coolness.\n\nDowntown is now one of the most exciting places to grab dinner, with the birthplace of the French dip, wildly diverse cuisines that reflect the wider communities and a brace of James Beard nominees. Bestia (just steps from Soho Warehouse) was one of the restaurants that gave oomph to the area's gastro clout."
    },
    {
      "source_id": "src_c_magazine_2019",
      "publication": "C Magazine",
      "title": "Check In/Check Out: Soho Warehouse in Downtown Los Angeles",
      "url": "https://magazinec.com/travel/check-in-check-out-soho-warehouse-in-downtown-los-angeles/",
      "published_at": "2019-09-01",
      "trust_level": "editorial",
      "content": "Ever wish you could just live at your favorite private club? You can now enjoy the benefits for a day or two at Downtown Los Angeles' Soho Warehouse, open to Founder-level members as of Sept. 30, and to Every House members and their guests starting Oct. 14.\n\nIt's the city's third Soho House outpost — and the only one on the West Coast to offer hotel accommodations. Set inside a seven-story 1916 industrial building that once served as a recording studio and housed storage facilities for various businesses, including a paper manufactory, liquor distillery and tire distributor, the 48-room property comprises more than a whopping 110,000 square feet.\n\nAccommodations (situated on the third, fourth and fifth floors) feature original exposed brickwork, 1970s-style furnishings, king beds, rainfall showers, full-size Cowshed bath products and more. Also unique to this latest location is Soho House's first U.S. in-room shopping experience — guests can experience an exclusive capsule collaboration between luxury streetwear retailer Ssense and DTLA-based designer Rhude, plus even more pieces by hand-selected brands, without ever leaving the comfort of their rooms.\n\nAnd overnight guests will have access to it all: members-only events, a two-story Soho Active gym (complete with scheduled classes, changing rooms, a sauna and more), the exquisitely decorated ground-level indoor-outdoor Mediterranean restaurant called House Garden, and a rooftop pool and bar decorated with an expansive mural by L.A.-based artist Paul Davies — just one example of their commitment to embracing the local art community.\n\nFrom $190/night.\n1000 S. Santa Fe Ave., L.A., 213-205-1000."
    },
    {
      "source_id": "src_kfa_los_angeles_2025",
      "publication": "KFA Los Angeles",
      "title": "Soho House opens second Los Angeles outpost in Downtown warehouse",
      "url": "https://kfalosangeles.com/soho-house-opens-second-los-angeles-outpost-in-downtown-warehouse/",
      "published_at": "2025-05-27",
      "trust_level": "editorial",
      "content": "It is the third Soho House location in California and the West Coast area in general, following another Los Angeles outpost in West Hollywood designed by Michaelis Boyd and a spot in Malibu about an hour outside the city.\n\nThe decor of Soho Warehouse takes cues from two different styles that are prominent in the building's history – art deco accents referencing its early 1900s construction and pieces that are evocative of the 1970s when it functioned as a recording space.\n\nThe interior design \"draws inspiration from the local downtown LA area and the building's historic roots,\" the team said. \"Staying true to the original design, all exposed brick walls, including graffiti tagged before Soho House took over the space, remain untouched.\"\n\nOn the rooftop is an outdoor bar, lounge and pool area, which is filled with cream-coloured seating and sun covers. The level below contains one of Soho Warehouse's two club levels, including a sitting area with a metallic fireplace, a sun-lit bar and a restaurant with an open kitchen.\n\nPops of dark blush, charcoal, cream and teal are interspersed throughout. A feature of the project is the concrete walls marked with graffiti, paired alongside exposed ductworks and pillars for an industrial feel. Vintage furniture, plants, wood tables and leather stools all feature in the areas as well.\n\nFor art, Soho House collaborated with local artists and galleries, including a mural by local street artist Shepard Fairey on the building's original loading dock door next to reception. On the rooftop patio, hemp lounge chairs have a custom print created by local artist and illustrator Ethan Lipsitz. Other decorative elements include a wallpaper by Genevieve Gaignard that lines a stairwell and a canvas mural by Paul Davies.\n\nOn the ground floor is another restaurant with exposed wood beams and panelling, rustic cobblestone floors and lightwells. An outdoor patio and garden is located within the property's former loading dock, and is filled with wood furniture, umbrellas, olive trees and jasmine.\n\nRounding out the project is a split-level gym with a sauna and steam room on the ground floor, in addition to an in-room shopping experience with a collection by Montreal retailer SSENSE and pieces from LA designer Rhude, making it the first Soho House to offer such a service.\n\nSoho House was founded in London in 1995 by Nick Jones as a private members' club for people in the creative and media industries and has grown to clubs around the world, including locations in Brooklyn, Amsterdam and Mumbai. The company launched Soho Home in the US this year for a range of furniture and homeware pieces from its outposts available for purchase."
    },
    {
      "source_id": "src_the_infatuation_2025",
      "publication": "The Infatuation",
      "title": "Where to have your office holiday party in Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/where-to-have-your-office-holiday-party-los-angeles",
      "published_at": "2025-11-20",
      "trust_level": "editorial",
      "content": "Hidden inside Soho Warehouse in the Arts District, this sceney Persian restaurant from London stands out for its dramatic setting. There's a lush garden patio lined with olive trees and a dining room barely lit with flickering, half-melted candles. The food isn't groundbreaking, but stick to starters like mast-o masir with pickled shallots and the char-grilled kababs, and you'll have an enjoyable night."
    }
  ]
}