{
  "place_slug": "surfas-culinary-district",
  "sources": [
    {
      "source_id": "src_sfgate_2024",
      "publication": "SFGATE",
      "title": "This 87-year-old shop is a secret weapon for some of Calif.'s best chefs",
      "url": "https://www.sfgate.com/la/article/los-angeles-restaurant-store-surfas-18691845.php",
      "published_at": "2024-03-06",
      "trust_level": "editorial",
      "content": "California has its share of farmers markets, specialty grocers and restaurant wholesalers — but perhaps none is as beloved or as unique as Surfas Culinary District, the 87-year-old gourmet market, cafe and restaurant kitchen supply store in Los Angeles.\n\nWalk into the 12,000-square-foot brick building and you'll find rows upon rows of specialty ingredients. There are hard-to-source salts, vinegars, pasta, canned tomatoes and individually packaged Valrhona and Callebaut chocolate, all ready to be pulled off the shelf by discerning home cooks. A small sampling table is outfitted with jars of chile crisp and za'atar, some with local labels and others from halfway around the world.\n\nA cafe counter acts as its own gathering place, serving espresso drinks, house-made pastries and sandwiches on fresh-made bread.\n\nBut prepared foods and home cooking are only a part of the Surfas story: Head further into the store and you'll discover why it's a chef's dream for one-stop shopping. Metal shelves, wooden cabinets and just about every conceivable corner are loaded with all the tools that a professional restaurant might require. There are sheet pans in every size, Cambros as far as the eye can see, countless knives, industrial-sized whisks and tall 100-quart stainless steel stock pots. More heavy-duty equipment sits toward the back, like refrigerators, ice machines, Vitamixes, an onion slicer reminiscent of a medieval torture device, and even a popcorn cart.\n\nAll in all, Surfas is a gourmet market-meets-industrial supply store that isn't afraid to cater to all ends of the culinary spectrum — and that's what makes it so special.\n\nThe Surfas story starts in an abandoned Los Angeles garage in 1937, with stops at a Jefferson Boulevard storefront (1947) and ultimately Culver City, where the quiet company began to reach a wider audience. Redevelopment, in part, forced a move to the current Surfas warehouse further east on Washington Boulevard, in 2017.\n\nAlthough it began purely as a retail outlet for food service professionals, over the years the store became a general destination for hard-to-find gourmet ingredients and kitchen tools. Home cooks and in-need restaurant owners dubbed it a \"chef's paradise,\" a moniker that has since become part of the corporate marketing.\n\nFrank Casares, who works closely with partner and family owner Les Surfas, has been running the shop for nearly 20 years. \"This is the only job I've had since I was 14,\" Frank tells SFGATE. \"I started out one summer cleaning the delivery trucks because they told me they'd teach me how to drive. I did everything [including] stocking shelves, and eventually got my own special order desk.\"\n\nThe couple continues to tweak and improve the shopping experience; when she came on board, Vanessa changed the store's soundtrack from 1960s standards to upbeat playlists that include 1980s hits and current pop. \"We're not corporate. People like coming here and just sitting in Frank's office to talk about cars,\" Vanessa says. \"I like having good music on because you'll see customers dancing in the aisles. Happy people buy.\"\n\nSurfas Culinary District, 3225 West Washington Blvd., Los Angeles. Monday through Saturday, 9 a.m. to 5 p.m."
    },
    {
      "source_id": "src_timeout_la_2016",
      "publication": "Time Out LA",
      "title": "Surfas",
      "url": "https://www.timeout.com/los-angeles/shopping/surfas",
      "published_at": "2016-08-11",
      "trust_level": "editorial",
      "content": "This family-run business, a huge gourmet food and restaurant supply emporium, celebrated its 75th birthday in 2012, which makes it virtually prehistoric by LA standards."
    }
  ]
}