{
  "place_slug": "sushi-masuyoshi",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "At Sushi Masuyoshi, an exceptional omakase at an even better value",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/sushi-masuyoshi",
      "published_at": "2025-03-13",
      "trust_level": "editorial",
      "content": "At $165 per person for 18-plus courses, Sushi Masuyoshi is a spectacular value compared to other top-tier omakases around the city. In a past life (a.k.a. during the pandemic), Hozumi Masuyoshi worked as a roving sushi chef for hire, showing up to people's homes with coolers full of fish and putting on private omakase dinners. These days, he's doing it from a cozy five-seat counter setup in Culver City with the same scrappy energy—no staff, no host, just one sushi chef calmly doing five things at once.\n\nThe perfectly paced meal unfolds over two hours and features hit after hit, which starts from the moment you're shown a wooden box of aged sashimi like it was a briefcase on Deal or No Deal. What follows? Salmon so silky it dissolves like a breath strip, smoke-kissed bonito with the meatiness of marbled beef, and sweet-glazed unagi roasted over charcoal until it practically melts.\n\nMasuyoshi took over the lease on a well-worn mom-and-pop sushi spot, and the space hasn't changed much since. The soundtrack of jazzy pop covers comes from a Bluetooth speaker on the shelf, and the walls could use a fresh coat of paint. But as long as you're fine with the water refills lagging a bit, Masuyoshi puts on an entertaining up-close performance that steals the spotlight: assembling handrolls into plump cones, searing fish with a glowing stick of charcoal, and shaping warm rice into precisely balanced nigiri, all while pausing for selfies and flashing peace signs. By the time fresh fruit and green tea show up at the end, you'll feel emboldened to hop behind the counter and start an apprenticeship.\n\nAs with any intimate dinner party, a night at Masuyoshi hinges heavily on who you're with, so bring someone you don't mind sitting shoulder-to-shoulder with for a couple of hours. Or better yet, assemble some friends and book out the entire restaurant for a group of four (or up to six, if you don't mind a few bumped elbows). You'll essentially get a private omakase for the same cost as dinner at most upscale sushi bars. That said, Masuyoshi also excels at making solo diners feel welcome—and even if you do come alone, you and your neighbors will likely be trading sake pours by night's end.\n\nSushi Masuyoshi serves an omakase that changes often. These dishes are examples of what you can expect. At some omakase, the nigiri start to blur together after the fifth piece. Not at Masuyoshi. Highlights include a three-piece tuna progression that starts with an aged lean cut and builds to buttery toro dabbed with caviar, knife-tenderized squid with sea urchin and fish roe, and tender halibut paired with its seared fin and liver. Each piece is substantial in size and flavor, and the subtly seasoned just-warm sushi rice is spot-on. Once the omakase ends, you're handed a short list of off-menu extras—be sure to ask the chef what else he has stashed away that night.\n\nThis showstopping temaki starts with a sheet of nori toasted over charcoal that's a heap of minced fatty tuna and crunchy pickled radish with sushi rice. The ice cream cone of sushi is handed directly across the counter while it's still warm and crackly. Masuyoshi doesn't skimp on the filling, and the ratio of crunch to richness is perfect.\n\nHalfway through the meal, Masuyoshi heats up a pot of oil and starts frying tempura to order (shiso leaf, mushrooms, and a medium-rare scallop in our case). And though he humbly insists he's not a tempura master, what arrives is fantastic. The delicate batter is light and crispy, not greasy, and adds some nice variety to break up the raw fish parade.\n\nThis shrimp head and white fish broth is so rich in sweet oceanic flavor, it makes most other miso soups taste like murky swamp water. It arrives near the end of the meal in a cute cup and will have everyone at the counter murmuring \"mmm\" like they're drinking hot chocolate by a fireplace."
    },
    {
      "source_id": "src_theinfatuation_2025_omakase",
      "publication": "The Infatuation",
      "title": "The 12 Best Omakase Spots In Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/the-best-omakase-spots-in-la",
      "published_at": "2025-10-03",
      "trust_level": "editorial",
      "content": "Sushi Masuyoshi is a five-seat counter run by a chef who used to host sushi dinners in people's homes, and is clearly adept at bringing energy to tight quarters. He slices, plates, and sometimes torches each dish, taking occasional breaks for sake shots or selfies with guests. His 18-course omakase is a generous deal: salmon so silky it dissolves like a breath strip, a three-part tuna progression that builds in fattiness, plus non-nigiri moments like baby squid over seaweed and shrimp head miso soup. Like any good dinner party, the night hinges on who you're with—so enlist a fun friend."
    },
    {
      "source_id": "src_theinfatuation_2025_bestsushi",
      "publication": "The Infatuation",
      "title": "The 25 Best Sushi Restaurants In Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-sushi-in-los-angeles",
      "published_at": "2025-05-07",
      "trust_level": "editorial",
      "content": "Editor's Note: Sushi Masuyoshi is temporarily closed as the chef has stepped away for health reasons. Sushi Masuyoshi is the aspirational version of the dinner party you tried to throw in your first apartment, only with much better fish. This five-seat counter is run by a chef who used to host sushi dinners in people's homes, and is clearly adept at bringing energy to tight quarters. He slices, plates, and sometimes torches each dish, taking occasional breaks for sake shots or selfies with guests. His 18-course $165 omakase is a generous deal: salmon so silky it dissolves like a breath strip, a three-part tuna progression that builds in fattiness, plus excellent non-nigiri moments like baby squid over seaweed and shrimp head miso soup. Like any good dinner party, your night hinges heavily on who you're with—so enlist your most fun friend."
    }
  ]
}