{
  "place_slug": "tacos-los-cholos",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "LA is flooded with good tacos, and Los Cholos sits at the top",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/tacos-los-cholos",
      "published_at": "2025-04-09",
      "trust_level": "editorial",
      "content": "This taquería isn't new to California by any means. In case you haven't gone south of Long Beach since 2019, we'll tell you that it's a big deal in Orange County. After setting up a handful of stands across the OC, Los Cholos opened a two-story location in Huntington Park that's all about smoke. Before you can take in the sheer size of the place—the multiple TVs, the graffiti murals, or the grill layered with flops of meat—you'll meet a wall of mesquite charcoal fumes. Picture a children's Halloween party after the babysitter left the fog machine running all afternoon.\n\nAll this indoor smoke is a bit jarring at first, but it's essential to Los Cholos' crispy carne asada. In some ways, Tacos Los Cholos is more like a barbecue place than it is a straight taco spot. They just happen to use tortillas as a vessel for quality beef, pork, and chicken. Every cut is labeled either \"regular,\" \"premium,\" and \"prime.\" Don't interpret these categorizations as hierarchical, necessarily—filet mignon is just pricier than chicken. The finely minced beef rib warrants its premium status with bits that crackle like Pop Rocks. As for prime cuts, the ribeye gets tenderized in lime until it takes on the texture of butter. One of these ribeye tacos will cost you $7, but it's the best thing on the menu. When you see the pile of meat on the lightly fried tortillas, any price-related outrage goes away.\n\nTacos Los Cholos will unquestionably be the highlight of Steve's LA trip—even if he sees the Chainsmokers at Erewhon. He'll wind up thinking every LA taco spot is just as special. And maybe we should let Steve from Cleveland dwell in blissful taco ignorance. Everyone deserves a smoky dream now and again. But if you already live here, you know not every taquería solidifies LA as America's official taco town. Tacos Los Cholos is the one that does.\n\nThis is not the standard carne asada taco. Sure, it has all the same components, but the woody flavor and minced texture make Tacos Los Cholos' version unforgettable. Edges are crispy but the meat stays juicy. And rather than tasting like it was reheated 20 times on the grill, every bite has a ton of smoke from mesquite charcoal.\n\nIf crackly bits are your thing, this beef rib will be up your alley. The meat is charred and chopped super fine, but there's still enough fat to translate that melty, high-quality meat feeling. The best cut on the menu and 100% worth its $7 price tag. Tacos Los Cholos uses a ton of lime to tenderize these thick cubes of beef. The result is soft and zippy. Combine that with some burnt edges and smoke in every bite, and you're in for one of the better tacos of your lifetime. This squeaky, salty slab of cheese wins the award for the deepest grill marks on the menu. It's torched but never melts, staying sturdy enough to carry a few salsas on its back. These push the limits of what a dainty corn tortilla can handle. An entire anaheim chile gets roasted until soft, then it's butterflied and crusted onto your taco with a cheesy costra. The chile adds crunch and smokiness. But, in comparison to the other tacos here, it feels a little busy and the meat gets lost. This frisbee-sized costra is definitely for someone, just not us. There's a lot of greasy cheese to get through, and it goes down like an anchor in a kiddie pool."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "32 Best Tacos in Los Angeles To Try Right Now",
      "url": "https://www.timeout.com/los-angeles/restaurants/best-tacos-in-los-angeles",
      "published_at": "2025-05-30",
      "trust_level": "editorial",
      "content": "Why we love it: Tacos Los Cholos serves some of the best street meats on a tortilla I've ever had. Yes, I mean ever. The mesquite-grilled meats offer a wealth of flavors, from the chewy, perfectly grilled panela cheese to the ultra-tender rib eye. Three price tiers—regular ($2.99), premium ($3.99), prime ($8.29)—might seem daunting, but you can't go wrong with almost any option. Our suggestion for first-timers? Go for mid-tier options like the costilla de res (pork ribs) and arrachera (skirt steak), which strike the balance between affordability and quality. Tacos Los Cholos' self-serve topping station includes a creamy chipotle mayo, cucumbers and several varieties of salsa, ranging from mild to heart-stopping. Time Out tip: Don't live in the area? Come later in the evening to avoid the worst of traffic—Tacos Los Cholos is open until midnight most days of the week (and 1am on Fridays and Saturdays)."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Tacos Los Cholos - Review - Anaheim",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/tacos-los-cholos-anaheim",
      "published_at": "2024-06-14",
      "trust_level": "editorial",
      "content": "If you're having trouble finding Tacos Los Cholos, just take a big whiff—the fragrant plumes from the mesquite grill will lead you right to this order-at-the-counter taqueria. The grilled meats at this Anaheim original (they have equally excellent locations in Fullerton and Huntington Park) can go toe-to-toe with the best barbecue spots in the country, only here tortillas are the transportation method. Every cut, from lime-marinated ribeye to the crispy-charred short rib, absorbs the flavor of mesquite charcoal. Between the clouds of smoke, the banda music blaring through the speakers, an open-air patio with TVs and misters, and the highest standard of asada, this isn't just the best taco spot in Anaheim, it's one of the best in Southern California."
    }
  ]
}