{
  "place_slug": "the-cheese-store-of-beverly-hills",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The Cheese Store Of Beverly Hills - Review",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/the-cheese-store-of-beverly-hills",
      "published_at": "2024-04-08",
      "trust_level": "editorial",
      "content": "This 50-something-year-old fromagerie is the only historic landmark in Beverly Hills we don't mind visiting over and over again. The shop is filled with crates of wine, imported jams, and wheels of cheese, and you can order from a tight list of seven sandwiches while cheesemongers offer you nibbles of French butter. The ciabatta sandwiches are pricey ($16-$19), but the fillings feel as luxe as everything else in the 90210. Get the lemony La Zucca with fried zucchini and ricotta, or the Dom with jammy sundried tomatoes and aged prosciutto for a smooch of salt. We usually take our goods to the park across the street. This is a fool-proof plan for a day off or treating an out-of-towner to a leisurely afternoon in Beverly Hills with some of the city's best sandwiches.\n\nThe only vegetarian sandwich on the menu also happens to be our favorite. It has all the texture and flavor components of a fantastic sandwich: the fried zucchini is crispy, slatherings of ricotta and pesto keep everything moist and interesting.\n\nYou're at a cheese shop but feeling cold cuts, instead? This one's for you. This is the meatiest sandwich on the menu, but it still doesn't just taste like salty pork. The finocchiona brings a little a sweet fennel-y thing, the cotto is buttery, and the ventricina adds a spicy kick."
    },
    {
      "source_id": "src_michelin_2023",
      "publication": "Michelin Guide",
      "title": "How This Beverly Hills Institution Brings the Cheese to MICHELIN Star Spots",
      "url": "https://guide.michelin.com/us/en/article/features/michelin-guide-beverly-hills-cheese-store",
      "published_at": "2023-08-07",
      "trust_level": "editorial",
      "content": "One of the most popular Los Angeles based purveyors of specialty foods and products to MICHELIN Guide restaurants, The Cheese Store of Beverly Hills, is a gem nestled amongst the mainstays in Beverly Hills. More than 50 years of bringing European delicacies to California.\n\nFounded in 1967 by Colonel Sigmund Roth and purchased by Norbert Wabnig in 1978—The Cheese Store continues to be a staple of the California community due to the owner's passion for providing unique and tasty foods. And late last month, new owner (and longtime employee) Dominick DiBartolomeo ushered in the new era of The Cheese Store's storied history with the opening of an expansive space at 9705 South Santa Monica Boulevard. Knowledgeable, passionate, and welcoming, DiBartolomeo and his team make everyone from locals to MICHELIN Guide Starred spot chefs feel as though they're family.\n\nWith this in mind, we chatted with DiBartolomeo about what it's like to own Beverly Hills's beloved food emporium along with some of his Star clients including Nancy Silverton of One Star and Green Star Osteria Mozza and Green Star Chi Spaaca, and Bib Gourmand Pizzeria Mozza (a client since the early 1980s), Evan Funke of Mother Wolf and Felix (a client since 2000), and one of Beverly Hills's newest talents, Mattia Agazzi of One Star Gucci Osteria da Massimo Bottura (a client since 2020). Below, we get the dish on what makes The Cheese Store a favorite amongst the culinary cognoscenti.\n\nNew owner Dominick DiBartolomeo's unconventional path to The Cheese Store began with his Italian-American roots in New York City. \"Growing up in an Italian family, food is the center of everything we do,\" says DiBartolomeo. \"I was introduced to The Cheese Store in 2001 by a friend who worked down the block [on Beverly Drive]. I was working at a PR firm and hated my job.\n\nFor Agazzi, Silverton, Funke and countless others, this feeling of home is what keeps everyone coming back. \"I'll always try anything that Dom suggests,\" says Silverton. \"Dom recently turned us on to an Italian sheep blue cheese called Briacaccio a Vine, which is a blue cheese stuffed with raisins and infused with syrup. It's not something I'd normally buy, but I always trust Dom, so I tried it and really enjoyed it.\" As for the man himself, he still has the same bewildered enthusiasm as his first day. \"For me, food is very familial,\" says DiBartolomeo. \"Everyday I get to go into work and learn and taste something new.\" Connection and discovery are at the heart of The Cheese Store of Beverly Hills.\n\nDiBartolomeo upped the ante on the store's offerings with his own line of of fresh pastas, peppers, and sauces aptly named Domenico's Foods, along with sourcing hard to find cheeses and specialty goods. This devotion to finding the best is what makes DiBartolomeo and the Cheese Store such a favorite amongst chefs. It's also the secret sauce behind some of California's best dishes. At Felix, Evan Funke uses a five-year aged Parmigiano Vacche Rosse for the Tagliolini Bolognese making each bite transportive, while at Mother Wolf and Funke, it's all about the mozzarella. \"It comes in every Thursday and they fly it in every Thursday,\" adds Funke. \"They've got to go to customs and wait for it and it's a really long and arduous process to get that fresh mozzarella into this country. I really respect Dom and his dedication to getting us that fresh cheese.\""
    }
  ]
}