{
  "place_slug": "the-lonely-oyster",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The Lonely Oyster - Review - Echo Park - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/the-lonely-oyster",
      "published_at": "2024-08-27",
      "trust_level": "editorial",
      "content": "The Lonely Oyster is a seafood spot in Echo Park with some excellent dishes, but also glaring lapses in execution. Let's start with the good stuff: Lonely Oyster's burger is excellent. This is a classic bar burger—a half-pound short rib and brisket patty, thick gem lettuce, tomatoes, and caramelized onions—piled a good six inches high off the plate. It comes with a side of pleasantly crunchy, medium-thick fries coated in Old Bay seasoning. Grabbing a seat at the bar, ordering the burger, and sipping an ice-cold martini is a very fine Tuesday night in our books. There's also a decadent, vibrantly colored lobster cobb on the menu and a shrimp cocktail with some of the plumpest individual shrimp we've ever seen in a restaurant. The oysters are solid, too. Where the experience at Lonely Oyster begins to get shaky is the pricing—yes, it's expensive. Raw starters fall in the $20 range and you'd be hard-pressed to find a main dish for less than $30. That lobster cobb we mentioned earlier is $36. Sourcing high-end, sustainable seafood—an ethos that Lonely Oyster seems to follow—will never be cheap, but it's still up to the restaurant to clearly show that the product they are serving is in line with the expense. And in that regard, Lonely Oyster falls short. On occasion, we've asked Lonely Oyster's wait staff to tell us about where their oysters are from—\"Inquire about our daily selection\" is literally printed on the menu—only to be met with confused stares, nervous laughs, and a staff-wide game of telephone in an attempt to get an answer. A board of daily specials on the far wall would presumably provide some assistance, but the bartender told us that \"it's never updated.\" This, coupled with chronic issues like wrong orders hitting the wrong tables, servers unable to describe their own cocktails, and an unevenly spaced dining room with the energy of a virtual candle-making class, make dinner here more confusing than enjoyable. The most dramatic moment during our handful of visits might've been when a seafood tower inexplicably collapsed with a crash after being placed on a table next to ours, an event so visually chaotic, we still haven't fully processed it. Crudo E Nudo, Connie & Ted's, Found Oyster, Dudley Market—there are plenty of sustainably-sourced seafood restaurants in LA with experiences that back up their high cost. The Lonely Oyster is, unfortunately, not one of them right now. But dang, that burger is good. This is our favorite thing on Lonely Oyster's menu and one of the best new burgers in the city. What initially stands out is the sheer size—it's stacked tall with a half-pound patty, thick gem lettuce, tomatoes, and caramelized onions on a pillowy brioche bun. It's a classic bar burger and a welcome reprieve from the countless greasy smashburgers that continue to plague our city. Also, the crispy Old Bay-seasoned fries are equally delicious. There's a decent chance no one on the staff will be able to tell you which ocean they were sourced from, but at the end of the day, you'll eat solid oysters at TLO. While there's nothing especially unique about this shrimp cocktail compared to others around town, we're awarding major points simply for how gigantic these shrimp are. Seriously, our hands feel small every time we reach for one. If you're looking for an appetizer to go with your burger, this is a good one. A nice idea in theory, this wagyu tartare topped with trout roe (hence the \"surf\" part) ultimately only tastes like raw beef. There's apparently horseradish and anchovy aioli mixed in, but the flavor doesn't come through. Even in LA, a $36 salad is tough to wrap your head around. That said, this one does come with a sizable helping of fresh lobster and the salad itself is definitely big enough for two people. Along with the burger, this is a dish we'd come back to TLO to specifically eat again. Despite fun topping options like charred onion miso butter or casino-style (bacon, peppers, and butter), these grilled oysters shrink down significantly once cooked. They end up so small, you mostly just taste the toppings. We prefer the fresh oysters. We've had better mussels in LA, but the sweet and savory coconut curry broth they come in make this a dish worth ordering. Don't feel embarrassed if you end up putting your mouth right on the bowl for sips—we sure did. It's Fine: 6s can get the job done (depending on the job). There's a strong 'BUT' or caveat as to why this place is acceptable, but not a first choice."
    },
    {
      "source_id": "src_timeout_la_2023",
      "publication": "Time Out LA",
      "title": "The Lonely Oyster | Restaurants in Echo Park, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/the-lonely-oyster",
      "published_at": "2023-07-14",
      "trust_level": "editorial",
      "content": "After a rocky beginning, this sustainable seafood restaurant in Echo Park has transformed into a reliable neighborhood destination for lobster rolls, freshly shucked oysters and a New England-inspired bill of fare. Where the Lonely Oyster stands out most, however, is with certain specialties brought to the table by lead chef Dom Crisp, previously of Pasadena's Saso (now closed) and L&E Oyster Bar. Above all, we're talking about Crisp's must-try cioppino, which features a mix of fresh seafood cooked à la minute in a flavorful, buttery broth we've yet to taste anywhere else. Other touches, like the housemade ice cream and vegetable sides made with seasonal produce, add even more flair to your meal."
    },
    {
      "source_id": "src_eatdrinkla_2022",
      "publication": "Eat Drink LA",
      "title": "The Lonely Oyster is about to get a lot more friends",
      "url": "https://www.eatdrinkla.com/the-lonely-oyster-is-about-to-get-a-lot-more-friends/",
      "published_at": "2022-08-30",
      "trust_level": "editorial",
      "content": "The Lonely Oyster in Echo Park is one of those impossibly cool restaurants that doesn't need to do too much to be remarkable. The door on Echo Park Blvd is unassuming, save for the signage when you look up into the California sky and spot the signature oyster symbol emblazoned on a tiny sailing flag. The dining room is maritime-themed without being kitschy, with dark navy blue walls and gold hardware, and a single red life preserver over the bar. The team behind the restaurant includes owner Don Andes (Little Joy/ Holloway), Creative Director Jena Corbin, Chef Carlos Lopez, and GM Sam Valle. The Lonely Oyster specializes in \"Saltwater-inspired fare\" that doesn't discriminate by region, so all briny bits are welcome here! Are you ready to dive in? The cocktails are all signature creations of the mixologists on staff, who can even suggest which drink pairs best with what oyster. There's something for every spirit of choice, but I'm always a sucker for a martini. The Lonely Oyster Martini is available as is ($17) or with a freshly shucked oyster and \"cavi-bump\" ($13 add-on). There are six different flavor profiles of Oysters on the menu, from New Zealand to Vancouver Island. I enjoyed a dozen of the Kaipara from New Zealand, which are described as crisp with a cucumber melon finish ($25/47). While I always enjoy raw oysters, I'm not sure I could ever distinguish one based on finishes – and I feel like an impostor describing things such as the salinity of the water to you. The staff are experts, though, and make you feel like you're one of them. You'll leave more educated and less hungry for sure. All oysters are served with traditional horseradish and an assortment of sauces like Citrus Soy and Calabrian Chili Oil – which was a personal favorite. The oyster bar is definitely having a moment, with restaurants like Found Oyster and Connie and Ted's rarely wavering in popularity. The difference with The Lonely Oyster though, is that it aims to be a port in the storm for this busy stretch of Echo Park that lacks multiple options for late-night and late weekend brunchers. It's also Echo Park's first Saltwater Bar and a welcome addition to the neighborhood. The Lonely Oyster is open on September 3rd and 4th from noon to midnight and Labor Day, September 5th, for a Low Country Boil from noon to 8 p.m. Make your reservations by emailing ahoy@lonelyoyster.com or by going to their website. The Grand Opening is September 8th, beginning at 5 p.m. Weekend Brunch begins on Saturday, September 17th at noon. The Lonely Oyster: 1320 Echo Park Avenue Los Angeles, CA 90026."
    },
    {
      "source_id": "src_flaunt_2022",
      "publication": "Flaunt",
      "title": "Lonely Oyster | You're Gonna Taste the Ocean, Yes, and Maybe The Stars",
      "url": "https://www.flaunt.com/post/lonely-oyster",
      "published_at": "2022-09-01",
      "trust_level": "editorial",
      "content": "Oysters—long a happy hours aphrodisiac, an appetizing conversation starter—have taken center stage on many of our favorite menus over the past couple of years. The opulent mollusk, whether adorned with tangy mignonette sauce or accompanied by caviar and crab legs, is indeed ethereally transportive and complex. But have we forgotten that oysters were historically food for peasants? At The Lonely Oyster, an under-the-radar den of distilled decadence in LA's Echo Park, the team has not discarded this fact. Rather, they've embraced it. I know what you're thinking: a seafood tower piled with a cunning curation of shellfish doesn't exactly spell a meal for common folk. Yet, while the opportunity exists for you to take the restaurant's raw bar head-on, with \"caviar bumps\" and fresh crudo to your liking, the staff is also just as enthusiastic to serve you a humble plate of fish and chips and a Miller High Life. Before opening its doors in the Fall of 2022, after going to what felt like 100 of the same Northeastern crab shacks and oyster houses, owner Don Andes felt inclined to shake things up. While cultivating the ethos of The Lonely Oyster, Andes decided to seek inspiration elsewhere. \"I flew to Milan and rented a motorcycle for a month,\" Andes recalls. \"Going through Europe and going to great oyster bars in Paris and Belgium and Germany—I was seeing how Europeans are doing oysters. They weren't slamming them or selling them by the dozen. They were doing them differently, they were explaining them. They slow it down. And when you slow it down, then you start to understand what you're doing, you start to really appreciate it differently.\" A couple of months later, Andes, who also owns neighborhood bar stalwart, Little Joy, opened up shop, joining forces with Executive Chef, Dom Crisp, and Master Écailler, Dillon Turner. With the European sentiment in mind, they created a warm space that allows customers to take their time while dining; tasting every unique flavor that the team has so carefully crafted. The Lonely Oyster is serving its quality food \"with a side of education,\" Creative Director Jena Corbin tells me, invoking the sentiment that embodies the nature of this restaurant. \"That is what's unique about what we're doing. We have this educational element where we're constantly bringing together new voices and new dishes. And because of that, our staff becomes very knowledgeable and passes that education on to customers.\" The sustainable ethos and built-in education of The Lonely Oyster is done in a way that's truly refreshing. Regulars who come into the neighborhood spot will know not only what they're eating, but where it was sourced, with what process it came to be, and its environmental impact. Hailing from Humboldt Bay, CA, the Écailler's oyster expertise stems from his own experience in his family's farm. Turner shares with me, \"I come from Old World agriculture—my family and the way that we farm—but there's nothing trendy about it. They've been doing it sustainably for forever, and a lot of these oyster farmers that are especially multigenerational, there's just no other way to do it.\" Well beyond spotting the difference between a Kumamoto and Blue Point, Turner's proficiency and passion in sustainable food extend into the emotional and historical, setting The Lonely Oyster apart from like destinations. Go to another oyster spot in LA, and odds are, you're not going to find a person like him. Of course, The Lonely Oyster features a wide menu of modern fare, with a full lobster offering, steak frites, a burger, a handful of vegan appetizers, and even New England-style chowder. This is all overseen by Executive Chef Dominique Crisp, who joined the team after what he claims was \"a passionate 2 AM e-mail,\" that expressed his desire to work in sustainable seafood. Originally hailing from Oregon, chef has worked in countless acclaimed seafood spots, but found something special in The Lonely Oyster's mission. Once coming aboard, Crisp created a cuisine that invoked Andes' Euro-inspirations, but still leaned into the continental seafood classics, making his own fusion. \"There's a whole playfulness of LA cuisine,\" Crisp tells me, \"where people take something and run with it via cultural or classic, and make it cool and hip and trendy, but also make it taste good. True to Crisp's execution, at The Lonely Oyster, you're not going to find an oyster dressed with Tabasco. You're going to find an oyster kissed with citrus ponzu or Calabrian chili oil—elevated homage to the quintessential accouterment. And while you wouldn't find infusions of chimichurri or miso butter in your beloved seafood shack in Nantucket, or the pristine oyster bar in Paris, that's kind of the point. At the end of the day, The Lonely Oyster is bent on creating its own classics. Despite the name, the small place has an enigmatic energy that will make you feel anything but lonely. Andes has designed a space that embraces its open and airy nautical theme in the day, and transforms into, what Chef Crisp calls, \"an electric vibe\" at night. Andes admits that he wouldn't describe the spot as a 'cheap date,' but says there is substance in the experience, something occasionally lost in the similarly-priced LA food scene."
    }
  ]
}