{
  "place_slug": "the-seafood-shop-gourmet-charcuterie",
  "sources": [
    {
      "source_id": "src_noho_arts_district_2023",
      "publication": "NoHo Arts District",
      "title": "The Seafood Shop Gourmet & Charcuterie",
      "url": "https://nohoartsdistrict.com/the-seafood-shop-gourmet-charcuterie/",
      "published_at": "2023-08-10",
      "trust_level": "editorial",
      "content": "The Seafood Shop Gourmet & Charcuterie owner Leriza Reyes developed an incredible wholesale seafood business supplying the finest restaurants and hotels in Los Angeles over the last 20 years with her late husband Andy. Their dream was always to have their own retail outlet to complement their already established business. However, when Andy passed away, Leriza was determined to honor him by creating the store they had always wanted. Lucky for us, she chose NoHo!\n\nMeet The Seafood Shop Gourmet & Charcuterie owner, Leriza Reyes. It's a really beautiful store, full to the brim with whatever your seafood-loving heart desires! Leriza also has a huge selection of European delicacies, and exceptional seafood such as Branzino, Faroe Salmon, Langoustine, Uni, Roes, and Caviar. Plus, she has some delicious smoked fish, cured meats, and various products from all over the world!\n\nThe NoHo Arts District is developing into quite the foodie paradise, with more restaurants and bistro bars opening all the time! The Seafood Shop Gourmet & Charcuterie is exactly what the NoHo community needed! We wondered how Leriza came to choose North Hollywood and wanted to know more about her story…so we asked her!\n\nWe love NOHO! Its history, the innovative arts, and the architecture evident in modern high-rise buildings are magnificent! We were also impressed to learn that the legendary Andy Warhol lived here, and everyone in NOHO is creative; the ambiance and atmosphere are undoubtedly filled with cool vibes.\n\nIt all started with my late husband Andy and me back in 2008; we first opened our wholesale distribution to high-end restaurants and hotels in Los Angeles County. Gratefully, our business has flourished for more than a decade now. We've always wanted to open a retail shop for the public, so I pursued this to honor Andy.\n\nI designed the shop the way I envisioned the creative people of the NoHo district. I incorporated the modern industrial look with a touch of vintage and an old-charm atmosphere so everyone coming into the Seafood Shop can experience and feel cool vibes.\n\nI love all the products I sell, especially our European products from charcuterie, Duck Pate, Salame, and our local artisan cheeses from Petaluma, California. There's a reason we have every product we have – you'll never go wrong with it! As they say in French, C'est si Bon! It goes with the flow.\n\nMy experiences in wholesale, including the relationships we have built with all the Chefs we worked for, significantly helped me become knowledgeable in the Seafood business. Most of them are our top chefs, and most, if not all, happily share their recipes! It is a pleasure to work with them, just like Chef Ludo Lefevre in his first pop-up restaurants, along with Chef Eme, Chef Eric Greenspan, and more! I learn so much, especially about how and what they use in their Hor's d'oeuvres!\n\nI welcome and talk to every customer to ensure they feel special and valued every time they are here at our retail seafood shop; it's a special shop open for everyone! Building and creating my shop took us a while, but I remember how every time I decorate, people stop in awe, curiosity, and excitement to see the shop. I would always talk to them, and from then, I started to connect and know the beautiful people of NOHO! Everyone was excited and eagerly waiting for our opening that they'd always say, \"You're finally open!\" I love seeing their happy faces, and many of them tell us how our shop is a remarkable addition to the neighborhood, one they wish to see more in the future.\n\nWe are overwhelmed and touched by so many sweet, kind, and beautiful comments from our customers; it's wonderful and inspiring!"
    }
  ]
}