{
  "place_slug": "the-aster",
  "sources": [
    {
      "source_id": "src_michelin_2024",
      "publication": "Michelin Guide",
      "title": "The Aster - Los Angeles Area",
      "url": "https://guide.michelin.com/us/en/hotels-stays/los-angeles-area/the-aster-12557",
      "published_at": "",
      "trust_level": "editorial",
      "content": "The Aster is, before anything else, a private club, a much-needed oasis at the very public intersection of Hollywood and Vine. The obvious way in is to become a member — but the Aster's 35 suites are open to overnight guests as well, and it's perhaps no surprise that they're up there with the finest suites in town — a bit bohemian, a bit retro, more than a bit warm and welcoming, understated in their luxury and, above all, memorable. Naturally there's more to any good hotel than the bedrooms, and that goes double for a private club. The Aster features a wellness program that goes above and beyond typical hotel fare, encompassing yoga and Pilates as well as weights and cardio equipment. And the hotel's liveliest social space is its Lemon Grove restaurant and bar, where members, guests, and locals dine and drink in the shade of the Aster's lemon trees. Hotel guests enjoy access to The Aster's full range of member amenities, including the salon, wellness suite, and F&B outlets, as well as some events."
    },
    {
      "source_id": "src_hollywood_reporter_2022",
      "publication": "The Hollywood Reporter",
      "title": "The Aster, A New Members Club and Hotel, Officially Opens in the Heart of Hollywood",
      "url": "https://www.hollywoodreporter.com/lifestyle/lifestyle-news/the-aster-members-club-hotel-hollywood-1235236173/",
      "published_at": "2022-10-10",
      "trust_level": "editorial",
      "content": "Located on Vine Street in a building formerly occupied by H Club and Redbury Hotel before that, the Aster is the latest venture from award-winning Salt Hotels co-founders David Bowd and Kevin O'Shea. On Thursday night, the 95,000-square-foot hospitality space welcomed notable guests to its grand opening including Evan Ross, Moses Sumney and Blake Gray. \"When we set out to create The Aster, we wanted everything here to be led by hospitality. Often membership clubs can be very cool and trendy but not really focused on service. So, we really wanted to focus on service, and then we wanted to remove some of the barriers and rules of membership clubs to make it much more eclectic, diverse, inclusive … and really just open it up to a much wider base,\" Bowd told The Hollywood Reporter. Programming will be eclectic, the hoteliers say, running the gamut from music to comedy to education-oriented events. The Aster also has a screening room and recording studio, designed with films and podcasts in mind."
    },
    {
      "source_id": "src_hollywood_reporter_2022_pre",
      "publication": "The Hollywood Reporter",
      "title": "The Aster Private Club and Hotel to Open in Hollywood's Former Redbury Hotel",
      "url": "https://www.hollywoodreporter.com/lifestyle/style/aster-private-club-hotel-hollywood-1235102054/",
      "published_at": "2022-03-06",
      "trust_level": "editorial",
      "content": "A building near the intersection of Hollywood and Vine that once was home to SBE's Redbury Hotel and later Paul Allen's h Club will have a third act as The Aster. Due in June, The Aster will be a hybrid project that combines a 35-room hotel and a private members' club, created by Salt Hotels, whose co-founders have extensive backgrounds working for hoteliers Ian Schrager and André Balazs. Each room will be a suite and generously sized at not less than 700 square feet (from $595 a night, theasterla.com), while private member dues will be $3,600 a year. The hotel and a rooftop restaurant will be open to the public, and the development also will include co-working spaces, a roof deck with an outdoor movie theater, a gym, hair and beauty salon, screening room and recording studio."
    },
    {
      "source_id": "src_robb_report_2022",
      "publication": "Robb Report",
      "title": "Meet the Aster, a Lavish New Members-Only Club and Hotel in Hollywood",
      "url": "https://robbreport.com/travel/hotels/the-aster-opens-hollywood-1234733214/",
      "published_at": "2022-08-02",
      "trust_level": "editorial",
      "content": "A swanky new members-only club and hotel has just opened in the heart of Hollywood. The Aster, which started welcoming guests on Monday, sits within a six-story building on the famous intersection of Vine Street and Hollywood Boulevard. Helmed by boutique hospitality group Salt Hotels, it is just one of many new hybrid venues pairing a high-end hotel with an exclusive club to draw in nearby residents as well as visitors. Named after LA's native aster flower, the adults-only establishment comprises 35 suites and a range of lavish amenities that can be enjoyed by overnight guests or members. Spanning 95,000 square feet, the property is spread across five distinct floors and sports a grandiose staircase at the center. Elsewhere on this level, there is a salon helmed by renowned hair stylist Jonathan Antin, two gyms, a pilates studio and a spa offering a range of treatments."
    },
    {
      "source_id": "src_robb_report_2022_lemon",
      "publication": "Robb Report",
      "title": "A Top Chef Alum Leads This New Restaurant Atop the LA Members-Only Club and Hotel the Aster",
      "url": "https://robbreport.com/food-drink/dining/lemon-grove-aster-los-angeles-1234758372/",
      "published_at": "2022-10-12",
      "trust_level": "editorial",
      "content": "Lemon Grove, which sits atop the members-only club and hotel the Aster, has debuted with the Top Chef alum Marcel Vigneron running the kitchen. The 7,200-square-foot indoor-outdoor space has room for 112, and luckily you don't have to be a member of the Aster to enjoy Vigneron's menu. Vigneron, formerly of the local spots Wolf and Tacos Lobos, took over his new role from his fellow Top Chef contestant Sam Talbot, who was previously attached to Lemon Grove. \"[I'm most excited by] the fresh chitarra pasta, inspired by our neighbors over there at Capital Records, and the tom kha sauce is a little nod to our other neighbors down the street in Thai Town,\" the chef told Eater LA. In a very LA move, Lemon Grove is also focused heavily on sustainability: Unused food is donated to the Hollywood Food Coalition; ingredients are sourced from local fish and produce suppliers; and the restaurant uses plastic alternatives."
    },
    {
      "source_id": "src_mr_and_mrs_smith_2024",
      "publication": "Mr & Mrs Smith",
      "title": "The Aster hotel | Los Angeles | California | Smith Hotels",
      "url": "https://www.mrandmrssmith.com/luxury-hotels/the-aster",
      "published_at": "",
      "trust_level": "editorial",
      "content": "Ostensibly a private members' club but with the warmth and welcome of a boutique hotel, the Aster is a world of gleaming wooden floors polished to a near-frictionless sheen, lemon-and-lime paneling and oversized lamps, where Hollywood and Vine's illustrious past meets sophisticated urban LA modernism. Glamourpusses sun themselves by the leafy courtyard's heated pool, lounge lizards sip Aster Spritz at the bar, and the Capitol Records building and Hollywood sign provide cinematic backdrops to movie nights: classic flicks shown under the stars on the rooftop's big screen. But what I loved most was that despite being a members' club, the hotel feels connected to the pulse of the city. To give an example, LA is a great jazz city. There was some suitably smooth jazz soundtracking the lifts, a gigantic mural paying tribute to some of the best jazz artists of all time was on show from my window, and, most importantly, there was live jazz in the lounge. I sat and watched the duo — one on bass, the other on piano — joined by a friend and honorary Angelino. Following their performance, we talked about jazz and the LA music scene, and they invited us to another event they were performing at later."
    },
    {
      "source_id": "src_timeout_la_2024",
      "publication": "Time Out LA",
      "title": "The Aster | Hotels in Hollywood, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/hotels/the-aster",
      "published_at": "2024-03-26",
      "trust_level": "editorial",
      "content": "In the mood for a secluded luxury escape? In that case, the Aster is where you'll want to head for a couple of nights. Featuring 35 elegant suites containing spacious living areas and premium amenities, the hotel offers guests an intimate retreat experience at the iconic intersection of Hollywood and Vine. The property also hosts a rooftop restaurant and bar with views of the Hollywood Hills and Capitol Records Building, as well as a heated courtyard pool and comprehensive wellness facilities."
    }
  ]
}