{
  "place_slug": "the-hollywood-roosevelt",
  "sources": [
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "The Hollywood Roosevelt Review: A Chic Place To Stay In The Frenzied Hollywood Neighborhood",
      "url": "https://www.timeout.com/los-angeles/hotels/hollywood-roosevelt",
      "published_at": "2025-10-01",
      "trust_level": "editorial",
      "content": "The 12-story, Spanish Colonial and Art Deco-styled hotel opened in 1927 and was named after the 26th president of the United States, Theodore Roosevelt. Along with the Chinese Theatre just across the road, The Roosevelt is surely one of the most imposing buildings on Hollywood Boulevard. A super starry proposition in name as well as in construction, it was partially funded by two of the biggest silent movie stars in the world; Mary Pickford and Douglas Fairbanks, and was home to the very first Academy Awards ceremony in 1929. That event took place in the Blossom Ballroom, which remains used for industry events to this day. Restored to its original glory after a multi-million dollar revamp in the 1980s, the Roosevelt remains one of the chicest places in the often hectic Hollywood.\n\nWhy go?\nIf you want a taste of real old school Hollywood, this is the only hotel in the neighborhood where you'll find it without having to venture to the more upscale West Hollywood and the likes of the Sunset Marquis, Sunset Tower and Chateau Marmont. The location can't be beaten—it's literally on the Hollywood Walk of Fame. Rooms aren't overly expensive either, making it the perfect base for exploring one of the most famous neighborhoods in America.\n\nThe Swimming Pool\nThe swimming pool at the Roosevelt might be the most famous pool in L.A. That's thanks to the mural of blue, wave-like forms that pop artist David Hockney painted on its interior walls in 1988. As such, the pool is the hotel's focal point; there's a buzzing bar, the Tropicana, as well as a daytime cafe, and regular evening events open to guests and visitors, from movie screenings to nighttime pool parties soundtracked by some of the city's most interesting record labels. If you're not a pool person, then there's a spa, fitness center, and yoga classes for hotel guests. The hotel is situated right on the Walk of Fame and you're moments away from from Hollywood's main draws, from cinemas such as the Chinese Theatre and Egyptian Theatre, to classic bar and grill Musso and Frank and an ever-popular branch of In-N-Out Burger, which might be the most important local attraction of the lot for non-locals. The Roosevelt is also ideally situated for a show at the Hollywood Bowl (it's just a 20 minute walk away), as well as the vastly underrated Hollywood Heritage Museum, the Magic Castle, or Bond Villain-worthy historic hilltop restaurant Yamashiro. As areas go, Hollywood has reverted to its somewhat sketchy 1970s past, so keep your wits about you when walking around, especially in the evenings.\n\nThe Rooms\nRather than gutting the hotel and doing away with its original features, they've simply spruced the place up, and it glows. If you're a sucker for movie history, then you'll be happy to hear that Marilyn Monroe used to live in suite 229 and her ghost reportedly haunts the hotel. There are 300 guest rooms, including 63 suites, across the 12 floors, making it a pretty sizable space. If you've got cash to splash, then there are cabana suites by the pool and epic penthouse options, including a flash Art Deco-worthy suite named in honour of screen idols Clark Gable and Carole Lombard. Most rooms are 'superior', with four poster beds, hardwood floors, bathrooms clad in white 1950s-style tiles and TVs and mini bars—but alas, no coffee machines. Beds are super cozy and there's fancy Byredo shampoo, conditioner and body wash in the over-tub showers.\n\nEating & Drinking\nThere's a whole host of places to eat and drink at the Roosevelt. The main spot is Shirley Brasserie, then the Lobby Bar, casual diner 25 Degrees, the Library Bar for high-end mixed drinks, and regular events such as close-up magic nights. Out by the swimming pool there's a café and bar and last but not least is the Spare Room, a bar with a vintage-style bowling alley."
    },
    {
      "source_id": "src_timeout_2018",
      "publication": "Time Out LA",
      "title": "L.A.'s Best Hotel Bars and Classiest Lobby Lounges",
      "url": "https://www.timeout.com/los-angeles/bars/best-hotel-bars-las-classiest-lobby-lounges",
      "published_at": "2018-08-14",
      "trust_level": "editorial",
      "content": "A bowling alley might not be the first place you'd think to grab drinks in Hollywood, but this isn't an ordinary bowling alley. Stashed away in the shadowy mezzanine above the Hollywood Roosevelt Hotel lobby is the Spare Room, devised to evoke pure revelry. A show-stopping set of lanes dating back to the early 1800s stretch the length of the handsome parlor, oozing with Art Deco elegance and a clear view of Hollywood Boulevard out of arched windows. Though let's face it: The real reason to visit this covert gaming lounge bookended by two gleaming bars is the ace drink program. Punch bowls and tiki drinks abound here—and yes, they just might make your bowling game better.\n\nYet another outstanding bar can be found inside the Roosevelt Hotel, this time on the ground-floor lobby. Amidst a moody and refined setting full of leather and huntsman-aligned décor, you can sip on fantastic libations driven by seasonal ingredients."
    },
    {
      "source_id": "src_timeout_2016",
      "publication": "Time Out LA",
      "title": "Library Bar at The Roosevelt Hotel",
      "url": "https://www.timeout.com/los-angeles/bars/library-bar-at-the-roosevelt-hotel",
      "published_at": "2016-08-02",
      "trust_level": "editorial",
      "content": "Suggest heading to the Hollywood strip for a nightcap and you'll risk losing friends. But keep smiling while they defame your character because just before they take off with you, drop \"omakase-style cocktail den.\" After a pregnant pause, direct them to the Roosevelt Hotel. The fairly small room is richly furnished with opulent dark leather couches, zebra-striped bar stools and an antiqued glass ceiling. What's lacking are props (as in, things to read) which you'd expect at a place called The Library Bar. Instead, the bar is teeming with jars of fresh herbs and an array of spirits, so know the drill: there's no menu, so surrender your taste preferences to the master mixologist who will deftly guide you. Wait patiently as it may take a few minutes for drinks to arrive, but when they do your friends will be so overwhelmed by cocktail perfection, they'll take back everything bad they've said about you and stare into their drink, trying to decipher its magic.\n\nThe scene: A chic crowd of industry types landing deals and in-the-know cocktail-moguls mix with out-of-towners staying at the hotel. When it gets too crowded inside the bar, folks spill out into the spacious lounge and carry-on sizing up their contemporaries."
    },
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "The 20 Best Bars In Hollywood",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-bars-in-hollywood",
      "published_at": "2024-03-07",
      "trust_level": "editorial",
      "content": "The Roosevelt Hotel is one of the best things to happen to Hollywood since the creation of Hollywood, and The Spare Room is easily our favorite space on the property. Located on the second floor of the iconic hotel, The Spare Room is a good cocktail bar known for one thing: bowling. There are two full bowling lanes in this throwback lounge, and scores are kept the old-fashioned way—by writing them down. The wait gets serious for it though, so put your name in early and go get drunk while you wait."
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "The 10 Best Poolside Restaurants & Bars In LA",
      "url": "https://www.theinfatuation.com/los-angeles/guides/best-poolside-dining-la",
      "published_at": "2025-08-06",
      "trust_level": "editorial",
      "content": "Tropicana at the Hollywood Roosevelt is arguably the most iconic pool bar in LA and the closest you'll get to a weekend in Palm Springs without leaving city limits. The pool area is surrounded by lush palm trees and mid-century bungalows, making the place look like somewhere Burt Reynolds would have hung out in the 1960s. The cocktail bar always has great seasonal drinks suited for the poolside, but the bartenders will also make a mean martini if you ask. Which you should—few things are better than sipping a strong drink and eating crispy calamari with your feet dangling in the water."
    }
  ]
}