{
  "place_slug": "tomat",
  "sources": [
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Tomat – Los Angeles - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/us-los-angeles/restaurant/tomat",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Los Angeles Restaurants · Tomat · 10 · 6261 W. 87th St., Los Angeles, CA, 90045, USA · $$$ · Californian · Farm-to-table Inspectors favorite · Favorite · Visited · Notes · Book · 6261 W. 87th St., Los Angeles, CA, 90045, USA · $$$ · Californian · Farm-to-table Inspectors favorite · Favorite · Visited · Notes · Working with local farmers and suppliers to highlight seasonality along with California's bounty, Tomat features all-day dining, but it's in the evenings when the cooking turns more serious. The design feels as farm fresh as the ingredients, with red-orange leather seat cushions set against a pale green backsplash. Kick things off with their barbari bread with roasted tomato powder-dusted butter before savoring appetizers like charred seasonal vegetables over a smooth ajo blanco. Main dishes are meant for sharing, and the half Liberty Farms duck is a perfect choice. Deftly cooked with crispy skin, it's enhanced with a pomegranate and walnut mole. Sticky toffee pudding with a butterscotch sauce and a scoop of burnt milk gelato is the perfect finale."
    },
    {
      "source_id": "src_timeout_la_2025",
      "publication": "Time Out LA",
      "title": "Review: L.A.'s most ambitious new restaurant grows produce within smelling distance of the LAX In-N-Out",
      "url": "https://www.timeout.com/los-angeles/news/review-l-a-s-most-ambitious-new-restaurant-grows-produce-within-smelling-distance-of-the-lax-in-n-out-022525",
      "published_at": "2025-10-02",
      "trust_level": "editorial",
      "content": "On the face of it, Tomat is an unlikely place for some of the city's most interesting new California cuisine. Hidden inside a sprawling shopping complex, the four-month-old London-inspired restaurant is located less than a mile away from LAX. A giant tomato decorates the exterior of the three-story building; Tomat derives its name from a childhood nickname coincidentally shared by married owners Harry Posner and Natalie Dial. After dark, the bright red neon sign draws in hungry neighborhood locals and in-the-know diners from across the city hankering for an eclectic, unforgettable combination of global flavors most Angelenos have never seen or tasted before. While Posner and Dial's intentions might sound fairly common—they want Tomat to be an upscale neighborhood fixture, worthy of date nights and the like—the painstaking efforts that went into the making of Tomat, along with each meal, reveal a restaurant that is anything but. With a unique mix of British, Persian and Japanese influences, Tomat makes a compelling case for dinner in Westchester—even if you don't need to be at the airport. Nowhere is this distinction more evident than when I stepped into Tomat's nearby garden, the Kids' Lot, where airplanes screech overhead every two to three minutes. With the help of edible landscaper Urban Farms LA, Posner and Dial have completely transformed a former junk-filled parking lot a block away from the LAX In-N-Out. The intoxicating smells of burger and fries cooking hits my nostrils, immediately followed by the unmistakable scent of decomposing organic matter; Tomat composts its coffee grounds and other restaurant-related food waste. For Dial, whose great-grandmother opened the first supermarket in the area, the combination of restaurant and garden has been a great way to reconnect with her family's roots and put academic concepts of community health and sustainability into real-life practice. In other contexts, \"ambitious\" can sound like a dirty word, a less cruel synonym for tryhard. But at a time in the L.A. restaurant industry when most chefs and operators are playing it safe, Tomat holds itself to a higher standard in ways that are both discernible on the plate and sometimes not. In other words, the restaurant dares to be bold—and that, alone, is reason enough to buy the ticket and take the ride. Tomat earned four stars—\"very good\"—from us. Similar to Baroo and Sqirl, the couple also ferment their own miso and hot sauce, the latter made with chili peppers grown in Tomat's garden. But unlike any other place in L.A., Posner (the duo's culinary lead) distills his British upbringing, Irish culinary training, Persian heritage and Japanese influences into a refreshingly ambitious, ever-improving dinner menu that excites and thrills, even if not every dish hits the bull's-eye. Recipe tweaks, seasonal changes and weekly menu specials translate into one of the city's most dynamic new dining destinations. On my first meal in November, I was impressed by the fluffy, hot \"barbari\" bread, whose texture more closely resembled focaccia, served with an umami-rich tomato butter. Even taking that into account, I still appreciate the sheer amount of culinary ambition on display at Tomat, particularly the nearby Kids' Lot. Though Posner actually sources most of the restaurant's produce from the Santa Monica Farmers' Market, the restaurant garden still serves as a major source of menu inspiration. \"When you go to Ballymaloe, you get indoctrinated,\" explains Posner. \"There's no stopping it. You're on the farm, you're using ingredients from the farm, and you're like, 'This is the best way of cooking, ever.'\" These lettuces make their way into Tomat's winter lettuce salad. Despite the menu's occasional shortcomings, the couple's clear sense of vision and undercurrent of idealism have made Tomat stand out in the increasingly homogenous sea of L.A. restaurant openings, which these days usually fall into one of three categories: Crowd-pleasing (read: boring) dining genres like Italian and high-end sushi; follow-ups from established chefs. The restaurant's emphasis on from-scratch cooking reminds me of Yang's Kitchen and earlier versions of Baroo, which I never experienced firsthand but have read extensively about. It may take some time for the kitchen to fire on all cylinders, but the menu's unique mix of cultural influences, combined with Posner and Dial's laudable commitment to growing their own produce and making almost everything in-house, down to $4 sides of hot sauce, could one day translate into Tomat stepping into the spotlight as the city's next-gen torchbearer for California cuisine."
    },
    {
      "source_id": "src_timeout_la_2025_restaurant_guide",
      "publication": "Time Out LA",
      "title": "Tomat: An ambitious, LAX-adjacent farm-to-table spot",
      "url": "https://www.timeout.com/los-angeles/restaurants/tomat",
      "published_at": "2025-04-17",
      "trust_level": "editorial",
      "content": "One of the city's most ambitious new restaurants is hidden within a nondescript Westchester shopping complex. Run by husband-and-wife duo Harry Posner and Natalie Dial, Tomat opened in October after four years of pandemic-related construction and permitting delays. A giant neon tomato—the restaurant's name comes from a childhood nickname coincidentally shared by both co-owners—decorates the side of the three-story building. The ground floor dining room features an open kitchen and a minimalist mix of pale wood, green tiles and red accents. By night, the dim overhead lighting unfortunately emphasizes the bags under your eyes. As of writing, Tomat offers dinner service five nights a week plus coffee and pastries (8am–1pm) every day but Monday. Like many other upscale L.A. restaurants these days, Tomat rotates its offerings with the seasons, proudly listing farmers and other purveyors who made your meal possible. But unlike any other eatery, Posner (the duo's culinary half) draws upon his British upbringing, Persian heritage and Japanese cooking to meld a mishmash of global flavors that most Angelenos have never seen or tasted before. The menu features standouts like \"barbari\" bread that more closely resembles focaccia, a riff on tahdig cooked in a donabe and a juicy roast duck. The last dish, a neighborhood favorite, is served with a mole sauce inspired by fesenjoon, a traditional Persian stew made with pomegranates and walnuts. In my eyes, the must-order is a weekend-only British-style beef and bone marrow pie. On one occasion, I received a crumbly, dry kabocha squash katsu, which was promptly taken off the check but still left a stilted first impression. Rancho Gordo beans with grilled maitake, styled like Persian ghormeh sabzi, offer comfort, but nothing more. But Posner's undeniable talent and creativity, alongside freshly baked madeleines, sticky toffee pudding and other dessert specials by pastry chef Bex Tilton, keep me coming back for more—and madly curious to revisit as the restaurant learns and improves in the long run. The vibe: An upscale, airy neighborhood restaurant. The food: A seasonally inspired British-leaning menu loosely inspired by Posner's Persian heritage, Japanese cuisine and the couple's shared experiences. The drink: A solid line-up of rotating cocktails (with non-alcoholic options) and wines by the glass and bottle curated by Dial. Time Out tip: If you're keen on ordering one of the weekend-only savory pies, you can text the restaurant to reserve one—they often sell out, particularly if you arrive after 7:30pm."
    },
    {
      "source_id": "src_infatuation_2024",
      "publication": "The Infatuation",
      "title": "Tomat - Review - Westchester - Los Angeles - The Infatuation",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/tomat",
      "published_at": "2024-12-04",
      "trust_level": "editorial",
      "content": "Tomat's bright red, tomato-shaped neon sign might make you wonder if Souplantation has risen from the dead. This all-day spot in Westchester is big on seasonal produce—note the massive bowl of squash on the counter and menu that namedrops a long list of local farms. There's coffee and house-baked pastries during the day, but Tomat mostly stands out for being one of the few upscale dinner options near LAX, where you can relax with classic cocktails and solid food before or after dealing with airport-related stress (we love you Sepulveda In-N-Out, but you don't always cut it). The larger dishes on the somewhat-British, Persian-leaning menu are a mixed bag, which is why we'd suggest sticking to snackier items like the warm barbari bread or tomato salad. And if you arrive before the rooftop terrace closes around dusk, ask for a table upstairs where you can gaze up at 747s while sipping a G&T. During the day, Tomat's pastry window has a bunch of sweet and savory croissants, danishes, and the occasional sausage roll on display. They're all solid, but we'd prioritize the chocolate chip cookies. It's basically half-chocolate and half-cookie, and it's satisfying to sink your teeth into the big, gooey chunks of dark chocolate. A must-order. The bread arrives steaming hot, with a crackly crust and a pillowy center, and we like the dusting of tomato powder on the butter that gives it a subtle tang. This salad screams summer, which is even more impressive considering it's on the menu in the middle of fall. The plump tomatoes burst like gushers, and the juices form a pool of sweet dressing at the bottom of the bowl. The black cod is soft and buttery, but the coconut curry beneath it is pretty bland. And the persimmons piled on the side?"
    },
    {
      "source_id": "src_resy_blog_2025",
      "publication": "Resy Blog",
      "title": "Tomat Is an Unlikely Destination for Genre-Defying Food Near LAX",
      "url": "https://blog.resy.com/2025/04/tomat-los-angeles/",
      "published_at": "2025-04-15",
      "trust_level": "editorial",
      "content": "What happens when a British doctor of medicine and an American doctor of global health meet in West Africa and move to Southern California? They end up opening one of L.A.'s most exciting new restaurants. That's the serendipitous story behind Tomat, which husband-and-wife team Harry Posner and Natalie Dial debuted in Westchester last fall. (He's the executive chef, she's the CEO.) Located spitting distance from LAX and in the same strip mall as the beloved Ayara Thai and the indie bookshop Book Jewel, Tomat showcases seasonal ingredients in stunning and unpredictable ways. Although Natalie Dial grew up in Montana with freezers full of elk, antelope, and game birds, she is actually a fourth-generation Westchesterite. In 2019, Dial and Posner were living in the UK, when, thanks to her family's real estate connections, the couple heard that a restaurant space in Westchester was opening up.\"At some point, we'd already decided that we wanted to move back to L.A.,\" Posner says. But was the timing right? They figured they might not get another opportunity like this, so they returned to Southern California, arriving two weeks before the COVID-19 pandemic. \"We were getting ready, guns blazing, and then lockdown happened,\" Posner says. Despite an assortment of COVID-related issues, they found an architect, finalized their plans, secured the permits, and started construction. Along the way, they also had a child. Toward the end of the process, they hit several permitting delays, but in October 2024, they finally opened Tomat as a daytime cafe and bakery. Two weeks later, they expanded into a full restaurant. The full, three-story space is anchored by the restaurant, with a dozen or so tables and eight seats at the bar, on the ground floor. The second floor, with a second kitchen and an event space for private dining, meetings, and parties, can hold another 50. And the rooftop terrace features a 1,500-square foot garden of drought-tolerant, native plants. Tomat also relies on another 4,000-square-foot garden, located two blocks south, for its produce. There, with help from Urban Farms LA, they grow everything from lettuces, root vegetables, alliums, and English peas to passion fruit, grapes, citrus, persimmons, and avocados. The vibe is casual-cozy, with pale wood tables, gold flatware, and minimal decor. \"I think the first thing you'll notice is that it is a green space,\" Dial says. You're leaving a swath of parking lot that LAX is surrounded by and walking into beautiful green tiles. We want everything to be simple, gorgeously made, made to last, and sustainable. We really want the joy to come from the food and seeing the chef and feeling connected to the kitchen.\" As the restaurant becomes more established, they hope to host more events on the second floor — perhaps cooking demos and classes. With spring in the air, Tomat is opening its rooftop terrace starting April 16. Expect cocktails, wine, and a small bites menu featuring items such as Welsh rarebit, Cornish pasties, and an onion tarte tatin. The rooftop will also host trivia every Wednesday, from 6 to 8 p.m. It's the perfect place to have a sip, enjoy a sunset, and watch the airplanes land."
    }
  ]
}