{
  "place_slug": "vespertine",
  "sources": [
    {
      "source_id": "src_michelin_guide_2025",
      "publication": "Michelin Guide",
      "title": "Vespertine – Culver City - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/culver-city/restaurant/vespertine",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Vespertine – a Two Stars: Excellent cooking restaurant in the 2025 MICHELIN Guide USA. Free online booking on the MICHELIN Guide's official website. The meal ends as strong as it begins, with a mesmerizing dessert that features kaleidoscopic flavors. Together with its sister restaurants, Vespertine works to ensure all ingredients are used in their entirety. \"All of our ingredients are sourced ethically from biodynamic, organic or wild origins; we specifically work with 2 local farms that practice biodynamic farming; all herbs are foraged locally. Wild seafood is sustainably sourced from either indigenous fishing communities or local fishermen; open pasture beef is grass-fed. Our commitment to sustainability also applies to the dining room's wool carpeting, recycled glassware and wild-harvested ceramic service pieces.\""
    },
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Vespertine - Review - Culver City - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/vespertine",
      "published_at": "2025-07-03",
      "trust_level": "editorial",
      "content": "Vespertine is a Rorschach test. What you take away from this four-hour-long, avant-garde tasting menu in Culver City depends on your perspective and, maybe more importantly, what kind of experience you expect from a dinner that costs $1000 for two, at minimum, after tax and tip. Vespertine has its fair share of quirk, too, but its setting is undeniably cool. It lives inside a wavy, mesh-like building nicknamed \"The Waffle,\" and dinner comes with a walk-through of the three-story space, starting in its concrete garden where you're served sweet birch sap soda, followed by a kitchen tour from a soft-spoken server dressed in a robe. Once you're seated in The Waffle's belly, at a see-through acrylic table, you're offered drink pairings (alcoholic or nonalcoholic), as well as the option to tack on caviar and wagyu, which at a restaurant so focused on obscure ingredients, feels like a gratuitous attempt to squeeze more money out of big spenders. Vespertine's food, to put it bluntly, is all over the place. Some courses are fairly tasty, including hoja santa cigars stuffed with quail and a bowl of spring flowers and peas that sit like breakfast cereal in almond cream. If your main priority is an utterly one-of-a-kind, carefully orchestrated dining experience—one that involves finely tuned service, a dining room that looks like a spaceship, and Icelandic synth music—there's a reality where Vespertine's steep price is palatable. But if you're expecting food that is uniformly delicious or, in some cases, simply tastes good, save yourself the anguish (and the money). If there's a high point at Vespertine, it's the dessert courses. You're guided downstairs into a quiet room for a \"tea ritual\" and served what are the best dishes of the evening: a bowl of \"milk jam\" topped with a disc of not-too-sweet, frozen birch sap that you smack with your spoon. There's a salty lamb fat donut that's intense on its own but pleasant once dipped in a scotch whipped cream, and a futuristic version of a French entremet that looks like a purple tornado swirling into a pool of tart black raspberry gel. Vespertine is from the same chef behind Destroyer, an experimental daytime spot we love, and Meteora, a quirky prehistoric-themed spot that left us less impressed. Vespertine's 13-course seasonal tasting menu costs $395 per person and is the only option available, save for optional caviar, truffle, and wagyu add-ons. Vespertine offers three pairings that are optional: a high-end $295 \"Vinifera\" pairing, a $175 \"Dynamic\" pairing, and a $125 non-alcoholic \"Vitality\" pairing."
    },
    {
      "source_id": "src_lamag_2025",
      "publication": "Los Angeles Magazine",
      "title": "Vespertine, One of L.A.'s Best Restaurants, Returns",
      "url": "https://lamag.com/food/vespertine-reopens-chef-jordan-kahn/",
      "published_at": "2025-08-21",
      "trust_level": "editorial",
      "content": "Chef Jordan Kahn's experimental two-Michelin-starred eatery is reopening April 2 after a four-year closure. Well, technically it never left, as Kahn famously transformed his fine-dining haven into a take-out standout during the pandemic featuring creative collaborations with esteemed restaurants like Eleven Madison Park and Alinea and themed menus that touched on regions like Sicily and a focus on the southern U.S. And Vespertine 2.0 finds a different Jordan Kahn, a different menu and a new way of thinking about fine dining in Los Angeles. Kahn invited me in to see the new Vespertine, and one of the first changes you'll notice is the welcome experience. A host advisor will sit with you in the outdoor garden and give you an overview of the experience. They'll find out your allergies, preferences, time allotted to eat and more. Vespertine was designed by renowned architect Eric Owen Moss who built The Waffle Building. There will be a couple of throwback dishes to the original Vespertine, but they won't be the same — though frequent past customers will appreciate the nod. If you've ever had the opportunity to go behind the curtain of a fine-dining establishment, it's the details that are most impressive. Kahn wants everything to be one-of-a-kind. That's why he experiments with creating his own scents so they \"creep up on you and give you a scent memory of when you dine.\" It's also true of the dinnerware, designed by Minnesota-based artists Mitch Iburg & Zoë Powell of Studio Alluvium, who designed every dish along Kahn's new 16-course tasting menu. The music, another \"sense memory\" component of the restaurant, is a collaboration with Icelandic vocalist Jónsi, along with American composers/producers Paul Corley (Sigur Rós/Liminal) and CJ Baran (Melanie Martinez, 'Cages'), that changes depending on the space. Kahn went on to explain that his hyper-focus on customer experience came at the expense of his staff. He explained that he didn't fully appreciate that in order to give the customer the best possible experience at his restaurant, the people presenting that experience had to feel the same way that he did. And that if their experience was a bad one, it will trickle down negatively to the guests. \"Do you want to know the biggest change here? It's how I feel now. I no longer feel depleted by the work. I feel nourished and I feel balanced.\""
    },
    {
      "source_id": "src_laweekly_2019",
      "publication": "LA Weekly",
      "title": "Restaurant Review: Vespertine Is Flawed, Frustrating and Fascinating",
      "url": "https://www.laweekly.com/restaurant-review-vespertine-is-flawed-frustrating-and-fascinating/",
      "published_at": "2019-05-23",
      "trust_level": "editorial",
      "content": "So why was it that five or so hours later, after my first meal at Vespertine, I went home and railed at my husband about how frustrated I was, about the lost potential, about how some of the meal felt quite like torture? Once I'd been led down from the roof and into the stark dining room, my golden mood shifted slowly toward darkness. The service was so blank and stark and cold: waiters in black sacks shuffling toward you, laying down a dish and whispering preciously, \"egg yolk and osha,\" then backing away slowly, never breaking cyborg character. The food was impressive in its approximation of what it might mean to eat on another planet, and not necessarily in a good way. There was a repetitive quality to the meal — many dishes had some kind of gel, a frozen thing and a dusting of bitter green powder. And there was so much of it all, dish after dish after dish. I assume that it would please Jordan Kahn, the chef behind Vespertine, that his project spurs such contemplation in its customers; there may never have been an American restaurant with such metaphysical aspirations. In the words of Vespertine's marketing materials, it is \"a gastronomical experience seeking to disrupt the course of the modern restaurant.\" Kahn said ahead of opening that the food would be inspired by architecture, astronomy and the music of John Cage. Kahn has dreamt up for Vespertine an extraterrestrial mythology, a fictitious framework that makes eating here as much performance art as it is dinner. There's a soundtrack that follows you throughout the evening, which sounds less like music and more like the universe shifting its astral gears. There are aspects of the meal that are absolutely meant to unnerve you rather than delight you. Upon arrival, guests are put into an elevator, which opens onto a visage of bright light silhouetting Kahn, who welcomes each diner with a kind of elfin joy. Behind him, you catch a glimpse of the gleaming minimalist kitchen. I thought about how the best chefs, the ones who get away with charging $300 per person, have amazing ideas and then hone them and refine them and don't serve a thing until it's perfect. I wondered if Kahn had ever actually tried to sit through the meal himself, to see how it felt to eat that much, to experience the effect of so many bitter powders, so many similar and off-putting textures. I wondered where his generosity as a cook had gone, his ability to provide comfort and pleasure alongside wild creativity. I had seen that spirit from this chef in the past — it's on full display at Destroyer, his breakfast and lunch cafe right across the street. But at Vespertine, his welcome at the elevator was by far the warmest, most generous component of the evening."
    },
    {
      "source_id": "src_lamag_2017",
      "publication": "Los Angeles Magazine",
      "title": "Is Vespertine Worth it?",
      "url": "https://lamag.com/dining/vespertine-review/",
      "published_at": "2017-09-19",
      "trust_level": "editorial",
      "content": "Challenging–that might be the word to describe dinner at Jordan Kahn's impossibly ambitious Culver City restaurant. One of the year's most anticipated openings, Vespertine had been at the center of speculation months before its July debut. That Kahn, former chef of Red Medicine and the force behind postmodern café Destroyer, declined to reveal details beyond odd tidbits about the space (envisioned as an \"artifact from an extraterrestrial planet\") prompted even open-minded observers to wonder: What the hell is up with this place? Few could have anticipated the answer. As you're whisked via elevator to a rooftop patio by smock-clad servers to begin a monastic four-hour (!) meal, an initial sense of befuddlement gives way to awe, at least briefly. The view atop the futuristic Eric Owen Moss-designed edifice is as captivating as the building itself, an undulating mass of latticed metal that glows during sunset and shudders in the wind. Visually stunning and intricately arranged courses (about 20 in all) arrive at an uneven clip, most introduced by only a few words and served on weighty volcanic-black dishware. A handful of offerings–radiant desserts like Santa Rosa plum bathed in mozzarella milk and cashew caramels wrapped with vinegar-laced mulberries–are bewilderingly good. But the majority, including a punishingly fishy raw flounder dish and a shaved endive assemblage that veers into castor oil bitterness, are bereft of any gustatory pleasure. Kahn is far from a novice, though. Could this dourness be intentional? Viewed as a meditation on sci-fi stoicism, perhaps Vespertine is commendable on its own avant-garde merits. But as a restaurant–one that costs more than $350 per person–Kahn's culinary experiment is hard to swallow."
    },
    {
      "source_id": "src_michelin_guide_2024",
      "publication": "Michelin Guide",
      "title": "Chef Jordan Kahn's Meteoric Rise",
      "url": "https://guide.michelin.com/us/en/article/people/chef-jordan-kahn-meteora-vespertine-michelin-star-los-angeles",
      "published_at": "2024-08-06",
      "trust_level": "editorial",
      "content": "\"It feels like there have been many lives lived in this short period of time,\" says Jordan Kahn, chef/owner of One MICHELIN Star Meteora and Two MICHELIN Star and Green Star Vespertine. Kahn is referring to the relaunch of Vespertine, his much-lauded Culver City restaurant (awarded Two MICHELIN Stars on August 6th). Wildly creative, Kahn is that rare personality who seamlessly blends a dogged determination with an almost spiritual mindset. Spend a few minutes with him and you'll soon see that nothing is done without careful consideration, just like the reopening of Vespertine in spring 2024. \"When we first opened Vespertine (in 2017), we set out to create a beautiful gastronomic experience centered around our ingredients. We incorporated multi-sensory elements, allowing the diner to deepen their connection to and understanding of the taste and impact of those ingredients. It was about creating a place where people could reconnect with the raw materials—essentially connecting with nature.\" While other restaurants in Los Angeles and around the country began reopening, Kahn was slow to reopen Vespertine as a sit-down restaurant, choosing instead to take stock of where they had been and where they wanted to go. \"The pandemic gave us this beautiful gift to learn how we can engage and connect with people in a deeper way through our storytelling and through the ingredients. It's a weird thing to say, but the pandemic made our purpose clearer.\" It was also during this time that the opportunity to open Meteora arose. Over time, the meals became more personal, whether honoring restaurants where Kahn cut his teeth, including Three MICHELIN Star and Green Star The French Laundry and Three MICHELIN Star Alinea, or paying homage to his roots in Cuba, the American South, and Mexico. \"The level that we were executing at, still to this day it's one of my proudest moments. We really tried to distill the experience of dining at those restaurants at home.\""
    }
  ]
}