{
  "place_slug": "vin-folk",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Offbeat South Bay bistro Vin Folk is pure charming fun",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/vin-folk",
      "published_at": "2025-11-07",
      "trust_level": "editorial",
      "content": "If you watch enough underdog sports movies, you know there's always a scene where some character passionately declares their team \"has heart.\" Vin Folk, a spunky neighborhood bistro in Redondo Beach, is what we'd call a restaurant with heart.\n\nOn the surface, this laidback wine bar seems pretty familiar: a small candlelit date spot with an open kitchen and a post-punk playlist that happens to be located a few blocks from the ocean. But peek under the hood and you'll find distinctive elements that set it apart—not just in the South Bay, but across the city. It starts the moment you sit down, when you're greeted by someone in an apron and chef's whites, eager to go over the menu. All the chefs double as servers, which means they're eager to dive into how and why the pea chawanmushi or five-spice beef tartare landed on the menu, a personal touch that can sometimes feel like information overload, but is ultimately endearing.\n\nRun by a husband-and-wife duo who used to cook at tasting-menu spots like Somni and Vespertine, Vin Folk injects geeky fun into the usual wine bar standards, like chopped salad boosted with crispy lap xuong, a pseudo patty melt with pork headcheese, and yellowtail crudo layered with Russian eggplant caviar. Think of it as casual fine dining—a place to drink interesting wines or a low-ABV negroni on a breezy patio, or just have a bite that will remind you why you still bother with small plates.\n\nThe menu is divided simply into \"snacks,\" \"cold,\" and \"hot.\" The dish descriptions can lean toward the inscrutable, which might seem annoying until you try a few. Did we know what pork jowl, mackerel tonnato, pickled carrots, and mashed potatoes would be doing on the same plate when we ordered it? No. Are we happy we did? Without a doubt. Occasionally, dishes feel a bit too clever for their own good, like a deeply crabby crab risotto with an unnecessary splat of fried egg foam on top. We could spend another paragraph talking about the reasonably priced wine list full of unique picks or the heady dessert menu engineered by a dedicated pastry chef, but all you need to know is that Vin Folk is run by people who not only have a clear love of restaurants but also know how to make them feel cozy, thoughtful, and a little surprising. If that's not heart, what is?"
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Review: This tiny South Bay bistro is the antidote to L.A.'s trendy, overpriced wine bars",
      "url": "https://www.timeout.com/los-angeles/news/review-this-tiny-south-bay-bistro-is-the-antidote-to-l-a-s-trendy-overpriced-wine-bars-031725",
      "published_at": "2025-03-17",
      "trust_level": "editorial",
      "content": "If you or a loved one have ever paid $27 for a lone sausage and a measly scoop of mashed potatoes at a certain buzzy wine bar and left hungry, you may be entitled to financial compensation. At least, I wish that were the case.\n\nAt a time when restaurant math isn't working for anyone involved, the humble wine bar has ascended in cultural and algorithmic significance as a legitimate dining genre in Los Angeles. For diners, there's still the thrill of going out to eat, plus less sticker shock, at least upon initial glance at the menu. Still, order more than a few of the carb-heavy, flavor-forward small plates offered at most trendy wine-centric spots—enough to make a full meal—and the grim, undeniable fact remains: The plates are indeed small, the prices don't always match up and the expectations-to-reality gap, especially after factoring in TikTok or media hype, is usually larger than anticipated.\n\nWhich is why it's been such a joy to head down the 405—yes, even during rush hour—and tuck into a meal at Vin Folk, a reasonably priced, deeply satisfying 45-seat bistro in Hermosa Beach. Run almost entirely by trained chefs, this nearly four-month-old restaurant offers a winning menu of French-leaning, globally inspired dishes imbued with the flare of modernist fine dining. Think Singaporean chili crab remixed into a creamy risotto that uses crab caught off the Southern California coast and tender beef tongue flavored with Russian-style spicy horseradish and tatsoi (a type of Asian brassica green that tastes similar to bok choy).\n\nAt Vin Folk, the entire culinary staff rotates through every task, from cooking certain dishes and interacting with diners to the necessary and important act of dishwashing. The fairly democratic kitchen system, combined with the talent De Los Santos and Shastova have managed to recruit and the excellent of the cuisine itself, upends the notion that there are ever \"too many cooks.\" In fact, it resembles the egalitarian atmosphere of early, pre-scandal Horses in Hollywood, which the Los Angeles Times once featured for its team of four co-chefs, sous chef and pastry chef—all of whom had a hand in creating the ever-evolving menu.\n\nThe Filipino-influenced desserts bear more than a passing similarity to the striking edible sculptures at two Michelin-starred Vespertine and its more casual counterpart, Destroyer; the restaurant's pastry chef, Lei Elmann, spent time at both restaurants.\n\nIn addition to Somni, De Los Santos and Shastova have other Michelin-starred restaurant experiences under their belts. The couple have also worked at Curtis Stone's now-closed Maude, as well as Vespertine. While their first priority in quietly opening last fall has been winning over the local community—including the regulars of Chef Melba's Bistro, the space's previous occupant—it's clear that Vin Folk has the potential to be far more than an above-average neighborhood restaurant. With the reasonable price point and exceptional cuisine, I'd already consider this Hermosa Beach bistro a countywide dining destination.\n\nVin Folk earned four stars—\"very good\"—from us.\n\nVin Folk, 1501 Hermosa Ave, Hermosa Beach, CA 90254. Tue–Thu 5–10pm; Fri, Sat 5–11pm."
    },
    {
      "source_id": "src_latimes_2025",
      "publication": "Los Angeles Times",
      "title": "With the new Vin Folk, Hermosa Beach becomes a culinary destination",
      "url": "https://www.latimes.com",
      "published_at": "2025-06-18",
      "trust_level": "editorial",
      "content": "Inside Vin Folk, the dining room crackles with the hopeful, earnest energy of a start-up company, ripe with possibility. And with food that has all the technique and precision of a tasting menu restaurant with less of the fuss, it is without a doubt the most exciting place to eat in the South Bay in recent memory.\n\nThe menu is a jaunt through chef-owner Kevin de los Santos and chef-partner Katya Shastova's backgrounds and travels, each dish attached to one or more specific \"memories\" that your chef will share throughout the evening.\n\nHe launches into a speech about how the restaurant is attempting to do away with the traditional \"front of the house and back of the house\" system. It's an explanation that takes at least a minute. Then he asks if he can take our drink order. I inquire about a bottle of white Nebbiolo. \"Oh, I don't drink yet,\" says Jude, confirming he's not yet old enough to legally consume alcohol. \"But I'll get a staff member more familiar with the wine list.\"\n\nThe mussels tart ($25) is both precious and picturesque, the kind of plate you feel compelled to pull out your phone for and photograph, even if you don't normally do that sort of thing. Inspired by a summer trip to Europe before opening the restaurant, the two remember traveling through Portugal, dining on tins of fish, bread and wine.\n\nDe los Santos and Shastova are making an effort to mentor the staff with a style of service they learned while working at Somni, Aitor Zabala's fine dining restaurant now located in West Hollywood. At Vin Folk, which opened in November, staff are trained in multiple positions, both in and out of the kitchen. Everyone helps with prep, then De los Santos and Shastova play a game of chess with the staff, placing members in positions where they may be strongest. \"We are teaching them,\" says Shastova. \"You go through everything because we believe it's important to learn every single detail of the restaurant if you want to have your own one day.\"\n\nIt's a system that breeds an enthusiastic crop of chefs who beam with pride at the presentation of each dish, all hands having contributed to its creation. It also makes for a cozy, often crowded dining room, with the back of the restaurant occupied by chefs clustered together in the open kitchen, hovering over plates of food.\n\nThe future of L.A. dining might indeed be found in this teensy dining room. Located just a block from the strand, it's a bright spot in an area dense with acai bowls, coffee shops and sports bars. Half the diners on any given evening are couples dressed for a night out."
    },
    {
      "source_id": "src_michelin_2025",
      "publication": "Michelin Guide",
      "title": "Vin Folk – Hermosa Beach - a MICHELIN Guide Restaurant",
      "url": "https://guide.michelin.com/us/en/california/hermosa-beach/restaurant/vin-folk",
      "published_at": "2025-06-25",
      "trust_level": "editorial",
      "content": "Chefs Kevin De Los Santos and Katya Shastova bring a breath of fresh air to Hermosa Beach with their menu of shareable, globally minded dishes. Whether it's the mussels tart, a riff on a pot pie with flaky pastry and seafood in a warm fennel cream or the chili crab prepared with a warm risotto, there's something delicious to be had. End with goat cheese fromage blanc with pear and orange blossom honey granita.\n\nVin Folk is the kind of place you want to come again and again. The staff is friendly and welcoming; the ambience is just right—both indoors and out—and the offerings are widely appealing.\n\nIt's a popular spot, so plan ahead and make reservations."
    }
  ]
}