{
  "place_slug": "wagyu-butcher",
  "sources": [
    {
      "source_id": "src_theinfatuation_2025",
      "publication": "The Infatuation",
      "title": "Wagyu Butcher turns yakiniku into a show, starring premium beef",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/wagyu-butcher",
      "published_at": "2025-11-07",
      "trust_level": "editorial",
      "content": "LA has plenty of spots where you can grill your own meat, but none quite like Wagyu Butcher. Here you'll get a front-row seat to a team of butchers who carve hunks of well-marbled beef with the precision of a sculptor, then hand you slices of meat that you're expected to grill like you know what you're doing. Located in a Torrance strip mall, this lowkey spot has just 20 seats and 10 tabletop grills on a counter that wraps around the open kitchen, so bring a friend or date for a fun night of searing wagyu together and clinking shochu highballs or giant mugs of Sapporo. The state-of-the-art grills are equipped with fans that suck the smoke downward so your clothes won't smell like campfire after, and you're handed a big pair of metal tongs to cook each item to taste.\n\nThere are two omakase options starting at $50 or $70–both excellent deals–though the addition of Japanese A5 wagyu makes the more expensive tier an easy yes. The cuts vary nightly and come from all parts of the cow, so if you're not into intestine or tongue, there's an option to swap in something else. Each cut dissolves in your mouth faster than the last, which means your teeth are basically along for the ride.\n\nWhile the meats are fairly light on seasoning, containers of yuzu kosho and chili paste are stationed around each grill, and almost every round comes with a different sauce. The counter will soon be covered with so many little dishes you might not remember which condiment goes with what, and start dunking and dipping to your heart's content. The delicate slices of meat cook faster than you think, though, so don't get too caught up and forget to flip.\n\nThe cuts vary nightly and come from all parts of the cow. We appreciate a nice slab of tongue, and while the slices are quite tender, they're also one of the more forgettable cuts. Each order is served with just a wedge of lemon for seasoning, so make sure to give them a sprinkle of salt, too. We usually think of skirt steak as a tougher, chewier cut, so it's a nice surprise that this well-marbled one breaks down effortlessly even when cooked medium-rare. Short rib is a standby at pretty much any restaurant where you're grilling meat, but this version stands out for flavor and beefiness. The light marination brings out the meat's richness, and the sweet-savory dipping sauce is great, too.\n\nThe grand finale of the $70 omakase consists of two thin, gorgeously marbled slices of Japanese wagyu that you dip into a fluffy sukiyaki-seasoned whipped cream. After the last cut of beef lands you might not think you need anything else in the world, but then this dish arrives to warm your soul: rice with rich oxtail curry that reminds us of hearty bowl of chili. You can also swap this course out for seared wagyu nigiri for an extra $10, but we usually stick with the curry.\n\nThe ideal tangy accompaniment to all the rich grilled beef you're eating, and we love that Wagyu Butcher makes their kimchi with unique vegetables like okra and mountain yam. It's hard to ration the single serving for the full meat parade, but you can always order another side a la carte for a few bucks.\n\nThis dish of steak tartare usually comes with omakase, but not always. If not, it's worth adding a la carte. The silky yolk mixed in with the raw beef is a winner.\n\nTruly Excellent: An 8 should be on your must-try list, because 8s are great. These spots are worth making an effort or crossing town for."
    },
    {
      "source_id": "src_timeout_2025",
      "publication": "Time Out LA",
      "title": "Wagyu Butcher | Restaurants in Torrance, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/wagyu-butcher",
      "published_at": "2025-02-27",
      "trust_level": "editorial",
      "content": "In my eyes, \"wagyu\" has largely become a shorthand for decadence and culinary laziness, but this sleek yakiniku joint in the South Bay manages to stand out thanks to its excellent sourcing and affordable pricepoint. (Luckily, you don't need to order A5 to have a great meal here.)\n\nThe chef-owner hails from Osaka, where he also ran a Japanese-style grilling eatery, and a grill-your-own experience here includes front row seats to the skilled butchers deftly slicing your meat. An amply portioned $50 tasting menu includes choice pieces of tongue, cheek, short rib and skirt steak, but it's easy to level up your meal with a la carte cuts if you're still feeling hungry. The $70 option ups the ante with beef sashimi and slices of A5."
    }
  ]
}