{
  "place_slug": "wine-eggs",
  "sources": [
    {
      "source_id": "src_sightunseen_2021",
      "publication": "Sight Unseen",
      "title": "A Los Angeles Natural Wine Store Inspired by French Midcentury Groceries",
      "url": "https://www.sightunseen.com/2021/02/wine-eggs-atwater-los-angeles-adi-goodrich-clay-hickson/",
      "published_at": "2021-02-05",
      "trust_level": "editorial",
      "content": "Earlier last month, a bright, cozy, and colorful new shop opened in Los Angeles's Atwater Village neighborhood. Called Wine & Eggs, the store — which sells natural wine and provisions, and in many ways reminds us of the LA version of Dimes Market — is the brainchild of Monica Navarro, owner of the beloved LA boutique Individual Medley (as well as a gem-focused wine store in the desert). For the interior, Navarro hired designer Adi Goodrich, in her first interiors project in Los Angeles. Goodrich, who is known primarily for her ultra-colorful installations for the likes of Instagram and Dropbox (and also known around these parts as the designer of our 2015 Think Big–inspired pop-up), worked with her partner in life and in Sing Sing Studio, Sean Pecknold, on the branding and tapped Clay Hickson to design the logo. But the interior itself is Goodrich's vision, inspired by the small European grocery stores she used to frequent while living in France. \"Why can't a grocery store feel special and fun while fulfilling the simple joy of shopping for your evening's dinner?\" A blue and green checkerboard vinyl floor anchors the space, and the curved shelving units are made from a warm cherry wood. Goodrich's background in set design seems to inform the tiny vignettes that pop up around the store, like a window corner overflowing with merch, flowers, and kitchen stuff."
    },
    {
      "source_id": "src_whatnow_2021",
      "publication": "What Now Los Angeles",
      "title": "Wine & Eggs to Sell a Bit of Everything in a Tiny Space",
      "url": "https://whatnowlosangeles.com/wine-eggs-to-sell-a-bit-of-everything-in-a-tiny-space/",
      "published_at": "2021-01-12",
      "trust_level": "editorial",
      "content": "Reminiscent of a little Bottega in Florence, Wine & Eggs in Atwater Village will have just a little bit of everything—some pasta, some milk, a few spices, a small meat selection, of course, wine and eggs. Kitschier than a convenience store, the teensy 600 square-foot shop at 3129 1/2 Glendale Blvd. will open for business on January 23. Owner Monica Boyes, who owns the Individual Medley boutique across the street, told What Now Los Angeles that she opened the tiny shop to provide the community she has come to love with \"something that I know me, as a mom, would appreciate here.\" Many of the little shop's provisions will be supplied by area favorites—bread from Bub and Grandma's, frozen pizza from La Morra and kombucha from Sunset Culture will all be sold within. Customers will also have a selection of spirits and an array of organic and low-sulfide wines, a passion for Boyes that she also indulges at her Wine and Rock Shop in Joshua Tree. Wine & Eggs will not only carry community-made goods but the flair of an Atwater Village artist's design. Adi Goodrich of Sing-Sing Studio designed the shop's minimalistic logo, painted the building's facade and designed a number of the pieces inside the store. Before the store's grand opening, shoppers can take a sneak peek of the space on January 20th, when Boyes plans to \"tear the paper off the windows and see who comes.\""
    },
    {
      "source_id": "src_hospitalitydesign_2021",
      "publication": "Hospitality Design",
      "title": "Adi Goodrich Crafts Cheerful Grocery Store in Los Angeles",
      "url": "https://hospitalitydesign.com/news/retail-commercial/wine-and-eggs/",
      "published_at": "2021-06-07",
      "trust_level": "editorial",
      "content": "In the Atwater Village section of Los Angeles, a new neighborhood grocery, Wine & Eggs, offers an elevated errand experience inspired by Parisian cafés, Italian tabacchis, and Portuguese storefronts. Locally based artist and spatial designer Adi Goodrich crafted the store to evoke a sense of intimacy, and feature subtle but memorable idiosyncrasies. \"I want every visitor to feel inspired. Inspired to take a small moment for joy in your day. This shop could simply be racks of wine and food, but me and Monica Navarro, the owner, wanted this space to be extra special,\" Goodrich says. \"Designing in the time of COVID meant that small runs to the grocery store may be the only time you get out, so making the space feel inspired was really important for me.\" The storefront features a large geometric arrangement of blue and white tiles spelling out Wine & Eggs, as well as a large peephole window."
    },
    {
      "source_id": "src_timeout_2022",
      "publication": "Time Out LA",
      "title": "Wine and Eggs",
      "url": "https://www.timeout.com/los-angeles/shopping/wine-and-eggs",
      "published_at": "2022-03-04",
      "trust_level": "editorial",
      "content": "Find a little bit of (expensive, organic, small-produced) everything at this small neighborhood grocery and specialty shop in Atwater Village located just steps away from Morihiro, Dune and Proof Bakery."
    }
  ]
}