{
  "place_slug": "yess-restaurant",
  "sources": [
    {
      "source_id": "src_theinfatuation_2024",
      "publication": "The Infatuation",
      "title": "Yess Restaurant - Review - Arts District - Los Angeles",
      "url": "https://www.theinfatuation.com/los-angeles/reviews/yess-restaurant-los-angeles",
      "published_at": "2024-12-17",
      "trust_level": "editorial",
      "content": "The front door of Yess is an angled wall of unfinished wood set against a metal frame. It's gorgeous by entryway standards, but quite bad at being a door. You might stand in front of it wondering if you're looking at a half-finished construction project, or just locked out, before discovering the recessed two-by-four that swings the slab open. This Japanese tasting menu spot in the Arts District is like its door: beautiful, pretentious, and, most of all, head-scratching. Despite lofty menu descriptions and pristine ingredients, most of what ends up on the plate here falls flat. And while the entrance only causes momentary confusion, an underwhelming meal at Yess will cost you a few hundred dollars, several hours, and probably leave you a little hungry.\n\nBetween the muted tones, the meditative Music For Plants soundtrack, and the servers who speak softly and wear robes resembling nurse scrubs, the space could be a boutique sanitarium in Ojai.\n\nOur first sip of this punitively tart, seaweed-infused lemonade was the closest we've gotten to a sitcom-style spit take in real life. Despite looking like standard lemonade, it somehow tastes like a wet dog smells. Great for pranking your enemies, not so great for spending $7 on.\n\nThe word \"kimchi\" might lead you to believe there's some level of fermentation or flavor happening here, but this amuse-bouche is just unseasoned vegetables and sliced fruit lounging in a cold water bath.\n\nThe restaurant's signature dish, you'll always find some variation of this on the menu. It comes with assorted fruits, nuts, and raw and dashi-poached vegetables all scattered over vinegared rice. It's fine but forgettable in a clean-out-the-fridge-lunch sort of way.\n\nCecina is usually a dish of salt-cured meat, but without any salt, these amount to thin, tough lamb slices cooked well-done. And the basic salad of unstemmed spinach, apple slices, and beet chips on the side looks like something your parents would text you a picture of while on a cruise.\n\nWe appreciate Yess' dedication to local seafood, but we also feel the need to pour one out for the poor marine life that gave their lives only to show up on this bland, stodgy bean stew topped with overcooked fish. This $20 dessert arrives as a fluffy, Matterhorn-sized mountain of shaved ice, which looks cool, until your server pours a painfully small amount of what tastes like cran-grape concentrate on top.\n\nThe lackluster execution and precious chef cliches might be less irksome if it weren't for the cost of the meal, which can get out of hand quickly. Sure, there's the baseline $110 six-course tasting menu (five small dishes and one entree) but sticking to this is like booking a Spirit Airlines seat without upgrades. And even after adding on the supplemental $28 grilled mushrooms and a $20 shaved ice, you'll still think about pulling over for tacos on the drive home.\n\nWe get it—Yess is designed to be a fancy restaurant where you're expected to contemplate the peas as much as enjoy them. But if that's your thing, there are better restaurants in LA (or in the Arts District, for that matter) to please those of us who adore avant-garde design, long-winded dish descriptions, and produce so immaculate it cannot be improved upon by human hands. And unlike Yess, they won't have you looking for the door."
    },
    {
      "source_id": "src_timeout_2021",
      "publication": "Time Out LA",
      "title": "Yess Aquatic - Restaurants in Downtown Arts District, Los Angeles",
      "url": "https://www.timeout.com/los-angeles/restaurants/yess-aquatic",
      "published_at": "2021-10-13",
      "trust_level": "editorial",
      "content": "Chef Junya Yamasaki and his talented team of fishermen, divers and cooks live the life Yess Aquatic, and you can spot 'em from a mile away: Just look for the bright orange and aquamarine Arts District food truck staffed by a whole crew in matching striped tees and neon orange beanies, a take on Steve Zissou's own team of seadog adventurers. Of course the food is just as much a part of the lifestyle—which sees Yamasaki and the others regularly freediving off the Southern California coast—and sustainably caught seafood is the name of the game at the truck.\n\nThe menu often finds Japanese influence winding through the pescatarian fare, so you might opt for wild, line-caught sashimi; katsu-fish curry over rice; or smoked miso black cod in sandwich form. Don't order without taking a look at the daily specials, and be sure to grab one of the refreshing, kombu-infused, house-made drinks that fall somewhere between an iced tea and fresh juice."
    }
  ]
}